{
  "Trabajo en clase": {
    "5": [
      "Su participación en clase es sobresaliente. Contribuye con ideas innovadoras y demuestra una profunda comprensión del material. Sus habilidades de liderazgo son verdaderamente notables.",
      "Nos complace destacar su sobresaliente participación en clase. Demuestra una dedicación excepcional y supera todas las expectativas. Sus contribuciones perspicaces y creativas son un testimonio de sus notables habilidades.",
      "La calidad de su participación en clase es consistentemente sobresaliente. Demuestra una capacidad excepcional para aplicar sus conocimientos y una pasión por explorar la materia en profundidad. Sus contribuciones son del más alto calibre.",
      "Hemos observado un nivel sobresaliente de excelencia en su participación en clase. Demuestra un enfoque proactivo y altamente motivado, contribuyendo de manera que establece un nuevo estándar. Sus habilidades analíticas y creativas son verdaderamente excepcionales.",
      "La profundidad de comprensión y pensamiento crítico mostrada en su participación en clase es sobresaliente. Demuestra constantemente una capacidad excepcional para sintetizar información y contribuir de manera innovadora. Su participación es ejemplar."
    ],
    "4": [
      "Su participación en clase es notablemente excelente. Contribuye con ideas perspicaces y demuestra una profunda comprensión del material. Sus habilidades de análisis son impresionantes.",
      "Estamos muy impresionados con sus notables esfuerzos en clase. Muestra una dedicación excepcional y supera las expectativas. Sus contribuciones son un testimonio de su aprendizaje.",
      "La calidad de su participación en clase es consistentemente notable. Demuestra una gran capacidad para aplicar sus conocimientos y un gran interés en explorar más a fondo la materia. Sus contribuciones son perspicaces.",
      "Hemos observado un nivel notable de excelencia en su participación en clase. Demuestra un enfoque proactivo y contribuye con ideas que superan las expectativas. Sus habilidades de pensamiento crítico son particularmente fuertes.",
      "La profundidad de comprensión mostrada en su participación en clase es notable. Demuestra constantemente un alto nivel de pensamiento crítico y una gran capacidad para sintetizar información. Su participación es excepcional."
    ],
    "3": [
      "Está participando muy bien en las actividades de clase. Muestra una gran comprensión del material y contribuye positivamente. ¡Su dedicación es evidente!",
      "Estamos muy impresionados con su participación en clase. Está yendo más allá en sus contribuciones y demostrando un gran interés en aprender. Su atención es excelente.",
      "Su participación en clase es consistentemente muy buena. Muestra un excelente esfuerzo y una profunda comprensión de los conceptos. Su compromiso es encomiable.",
      "Hemos notado que su participación es constantemente muy buena. Está demostrando un enfoque proactivo y una gran capacidad para aplicar sus conocimientos. ¡Siga con el fantástico trabajo!",
      "La calidad de su participación en clase es muy buena. Está mostrando una fuerte ética de trabajo y contribuyendo de manera significativa. Estamos muy contentos con su progreso."
    ],
    "2": [
      "Está participando bien en las actividades de clase. Muestra interés y está completando las tareas de manera adecuada. ¡Siga así!",
      "Estamos contentos con su participación en clase. Está siguiendo las instrucciones y demostrando una buena comprensión de las lecciones. Lo animamos a continuar participando activamente.",
      "Está manejando bien las actividades de clase. Participa con regularidad y muestra un buen nivel de compromiso. ¡Bien hecho!",
      "Está demostrando una buena consistencia en su participación en clase. Muestra iniciativa y aplica lo que ha aprendido. Estamos contentos con su progreso.",
      "Hemos visto un buen nivel de esfuerzo en su participación en clase. Está cumpliendo con las expectativas y mostrando una actitud positiva."
    ],
    "1": [
      "Estamos notando que aún se está adaptando al ritmo de la clase. Con un poco más de participación activa, verá un progreso significativo. ¡Anime a participar y a no tener miedo de preguntar!",
      "Está mostrando potencial en clase. Trabajemos juntos para aumentar su concentración y participación. Pequeños esfuerzos diarios harán una gran diferencia.",
      "A veces, las actividades en clase pueden ser un desafío. Estamos aquí para apoyarlo. Animémoslo a participar más y a pedir ayuda cuando la necesite.",
      "Estamos viendo que empieza a involucrarse en las actividades de clase. Con un poco más de enfoque, su comprensión mejorará. ¡Siga motivándolo!",
      "Cada estudiante aprende a su propio ritmo. Está en una fase de adaptación a la dinámica de la clase. Seguiremos proporcionando apoyo y animándolo a participar."
    ]
  },
  "Trabajo en casa": {
    "5": [
      "La calidad de su trabajo en casa es ejemplar; siempre demuestra comprensión y esfuerzo excepcionales.",
      "Completa todas las tareas a tiempo y con un alto grado de precisión. Su dedicación a la práctica es sobresaliente.",
      "El nivel de profundidad y detalle en su trabajo en casa supera constantemente las expectativas.",
      "Muestra una gran autodisciplina en sus hábitos de estudio, utilizando la tarea para reforzar y expandir su aprendizaje.",
      "Su trabajo en casa refleja una dedicación excepcional a la materia y es una base sólida para su éxito."
    ],
    "4": [
      "Está haciendo un buen trabajo con su tarea. Completa las tareas de manera constante y muestra una buena comprensión del material. ¡Siga con el buen trabajo!",
      "Estamos contentos con sus esfuerzos en la tarea. Está cumpliendo con las expectativas y demostrando una sólida comprensión de las lecciones. Lo animamos a continuar con esta tendencia positiva.",
      "La tarea es una parte importante del aprendizaje y la está manejando bien. Completa las tareas con regularidad y muestra un buen nivel de participación. ¡Bien hecho!",
      "Está demostrando una buena consistencia con su tarea. Muestra iniciativa y aplica lo que ha aprendido en clase. Estamos contentos con su progreso.",
      "Hemos visto un buen nivel de esfuerzo en su tarea. Está cumpliendo con los requisitos y mostrando una actitud positiva hacia la realización de sus tareas."
    ],
    "3": [
      "Está haciendo un muy buen trabajo con su tarea. Completa las tareas de manera constante con precisión y muestra una sólida comprensión del material. ¡Su dedicación es evidente!",
      "Estamos muy impresionados con su tarea. Está yendo más allá en sus tareas y demostrando un gran interés en aprender. Su atención al detalle es excelente.",
      "La tarea es consistentemente de un nivel muy alto. Está mostrando un excelente esfuerzo y una profunda comprensión de los conceptos. Su compromiso con el aprendizaje es encomiable.",
      "Hemos notado que su tarea está constantemente muy bien hecha. Está demostrando un enfoque proactivo del aprendizaje y una gran capacidad para aplicar sus conocimientos. ¡Siga con el fantástico trabajo!",
      "La calidad de su tarea es muy buena. Está mostrando una fuerte ética de trabajo y produciendo constantemente excelentes resultados. Estamos muy contentos con su progreso."
    ],
    "2": [
      "Está haciendo un buen trabajo con su tarea. Completa las tareas de manera constante y muestra una buena comprensión del material. ¡Siga con el buen trabajo!",
      "Estamos contentos con sus esfuerzos en la tarea. Está cumpliendo con las expectativas y demostrando una sólida comprensión de las lecciones. Lo animamos a continuar con esta tendencia positiva.",
      "La tarea es una parte importante del aprendizaje y la está manejando bien. Completa las tareas con regularidad y muestra un buen nivel de participación. ¡Bien hecho!",
      "Está demostrando una buena consistencia con su tarea. Muestra iniciativa y aplica lo que ha aprendido en clase. Estamos contentos con su progreso.",
      "Hemos visto un buen nivel de esfuerzo en su tarea. Está cumpliendo con los requisitos y mostrando una actitud positiva hacia la realización de sus tareas."
    ],
    "1": [
      "Frecuentemente no entrega el trabajo en casa o lo presenta incompleto.",
      "La calidad de su tarea es una gran preocupación y no refleja su capacidad.",
      "Necesita desarrollar hábitos de estudio y disciplina para completar la tarea de manera consistente.",
      "La falta de práctica en casa está impactando negativamente su progreso en clase.",
      "A menudo se olvida de la tarea o muestra poco esfuerzo al completarla."
    ]
  },
  "Esfuerzo": {
    "5": [
      "Su nivel de esfuerzo es sobresaliente. Demuestra una perseverancia excepcional y está dispuesto a asumir desafíos extraordinarios. Sus habilidades de liderazgo y autogestión son verdaderamente notables.",
      "Nos complace destacar sus sobresalientes esfuerzos. Muestra una dedicación excepcional y supera todas las expectativas. Su capacidad para inspirar a otros con su esfuerzo es un testimonio de sus notables habilidades.",
      "La calidad de su esfuerzo es consistentemente sobresaliente. Demuestra una capacidad excepcional para mantenerse motivado y superar cualquier obstáculo. Su compromiso es del más alto nivel.",
      "Hemos observado un nivel sobresaliente de excelencia en su esfuerzo. Demuestra un enfoque estratégico y una gran capacidad para innovar y superar desafíos complejos. Sus habilidades de liderazgo y creatividad son verdaderamente excepcionales.",
      "La profundidad de su compromiso y autodisciplina es sobresaliente. Demuestra constantemente una capacidad excepcional para alcanzar metas ambiciosas y superar cualquier adversidad. Su esfuerzo es ejemplar."
    ],
    "4": [
      "Su nivel de esfuerzo es notablemente excelente. Demuestra una gran perseverancia y está dispuesto a enfrentar desafíos complejos. Sus habilidades de autogestión son impresionantes.",
      "Estamos muy impresionados con sus notables esfuerzos. Muestra una dedicación excepcional y supera las expectativas. Su capacidad para perseverar es un testimonio de su carácter.",
      "La calidad de su esfuerzo es consistentemente notable. Demuestra una gran capacidad para mantenerse enfocado y motivado. Su compromiso es excepcional.",
      "Hemos observado un nivel notable de excelencia en su esfuerzo. Demuestra un enfoque estratégico y una gran capacidad para superar dificultades. Sus habilidades de resolución de problemas son particularmente fuertes.",
      "La profundidad de su compromiso es notable. Demuestra constantemente un alto nivel de autodisciplina y una gran capacidad para alcanzar sus metas. Su esfuerzo es excepcional."
    ],
    "3": [
      "Está mostrando un muy buen nivel de esfuerzo en sus actividades. Se nota su dedicación y compromiso. ¡Su perseverancia es admirable!",
      "Estamos muy impresionados con su disposición para esforzarse. Está buscando oportunidades para mejorar y demostrando un gran interés en aprender. Su dedicación es evidente.",
      "Su nivel de esfuerzo es consistentemente muy bueno. Muestra una gran determinación y se esfuerza por alcanzar sus metas. Su compromiso es notable.",
      "Hemos notado que su esfuerzo es constantemente muy bueno. Está demostrando un enfoque proactivo y una gran capacidad para superar obstáculos. ¡Siga con el excelente trabajo!",
      "La calidad de su esfuerzo es muy buena. Está mostrando una gran disciplina y se esfuerza por alcanzar la excelencia. Estamos muy contentos con su progreso."
    ],
    "2": [
      "Está mostrando un buen nivel de esfuerzo en sus actividades. Completa las tareas con diligencia y muestra una actitud positiva. ¡Siga adelante!",
      "Estamos contentos con su disposición para esforzarse. Está aplicando lo que aprende y demostrando una buena ética de trabajo. Lo animamos a mantener este nivel de compromiso.",
      "Está manejando bien sus responsabilidades y mostrando un buen nivel de dedicación. Participa activamente y se esfuerza por mejorar. ¡Bien hecho!",
      "Está demostrando una buena consistencia en su esfuerzo. Muestra iniciativa y está dispuesto a superar desafíos. Estamos satisfechos con su progreso.",
      "Hemos notado un buen nivel de compromiso en sus actividades. Está cumpliendo con las expectativas y mostrando una actitud responsable."
    ],
    "1": [
      "Está aprendiendo a enfocarse y a persistir en las tareas. Con un poco más de motivación, verá un gran avance. ¡Anímelo a no rendirse y a celebrar cada pequeño logro!",
      "Estamos viendo que está empezando a entender la importancia del esfuerzo. Trabajemos juntos para desarrollar hábitos de estudio positivos. La consistencia es clave.",
      "A veces, mantenerse motivado puede ser difícil. Estamos aquí para apoyarlo. Animémoslo a establecer metas pequeñas y alcanzables.",
      "Estamos observando que comienza a mostrar interés en esforzarse más. Con un poco más de dedicación, su progreso será notable. ¡Siga alentándolo!",
      "Cada estudiante encuentra su propio camino hacia el esfuerzo. Está en una fase de descubrimiento. Seguiremos brindando estrategias y apoyo para que descubra su potencial."
    ]
  },
  "Participación": {
    "5": [
      "Su nivel de participación es sobresaliente. Contribuye con ideas innovadoras y demuestra una gran capacidad para inspirar a sus compañeros. Sus habilidades de liderazgo y comunicación son verdaderamente excepcionales.",
      "Nos complace destacar su sobresaliente participación. Muestra una dedicación excepcional y supera todas las expectativas. Su capacidad para construir un ambiente colaborativo es un testimonio de su liderazgo excepcional.",
      "La calidad de su participación es consistentemente sobresaliente. Demuestra una capacidad excepcional para generar consenso y fomentar la colaboración en situaciones complejas. Su liderazgo es del más alto nivel.",
      "Hemos observado un nivel sobresaliente de excelencia en su participación. Demuestra un enfoque estratégico y una gran capacidad para liderar equipos hacia metas ambiciosas. Sus habilidades de liderazgo y comunicación son verdaderamente excepcionales.",
      "La profundidad de su contribución y empatía es sobresaliente. Demuestra constantemente una capacidad excepcional para fomentar la inclusión y construir comunidades colaborativas. Su participación es ejemplar."
    ],
    "4": [
      "Su nivel de participación es notablemente excelente. Contribuye con ideas perspicaces y demuestra una gran capacidad para liderar discusiones. Sus habilidades de comunicación son impresionantes.",
      "Estamos muy impresionados con sus notables esfuerzos en participación. Muestra una dedicación excepcional y supera las expectativas. Su capacidad para facilitar la colaboración es un testimonio de su liderazgo.",
      "La calidad de su participación es consistentemente notable. Demuestra una gran capacidad para mediar y fomentar el consenso. Su colaboración es excepcional.",
      "Hemos observado un nivel notable de excelencia en su participación. Demuestra un enfoque estratégico y una gran capacidad para generar ideas innovadoras. Sus habilidades de liderazgo son particularmente fuertes.",
      "La profundidad de su contribución es notable. Demuestra constantemente un alto nivel de empatía y una gran capacidad para fomentar la inclusión. Su participación es excepcional."
    ],
    "3": [
      "Está participando muy bien en las actividades grupales. Contribuye con ideas valiosas y demuestra respeto por sus compañeros. ¡Su colaboración es apreciada!",
      "Estamos muy impresionados con su disposición para participar. Está buscando oportunidades para contribuir y demostrando un gran interés en colaborar. Su participación es muy valiosa.",
      "Su nivel de participación es consistentemente muy bueno. Muestra una gran capacidad para trabajar en equipo y aporta ideas constructivas. Su colaboración es notable.",
      "Hemos notado que su participación es constantemente muy buena. Está demostrando un enfoque proactivo y una gran capacidad para fomentar la colaboración. ¡Siga con el excelente trabajo!",
      "La calidad de su participación es muy buena. Está mostrando una gran capacidad para escuchar y contribuir de manera significativa. Estamos muy contentos con su contribución."
    ],
    "2": [
      "Está participando de manera adecuada en las actividades grupales. Comparte sus ideas y escucha a sus compañeros. ¡Siga contribuyendo!",
      "Estamos contentos con su disposición para participar. Está siguiendo las dinámicas de grupo y aportando de manera constructiva. Lo animamos a mantener esta actitud positiva.",
      "Está manejando bien su participación en las discusiones. Contribuye con regularidad y muestra respeto por las opiniones de los demás. ¡Bien hecho!",
      "Está demostrando una buena consistencia en su participación. Muestra interés en colaborar y está dispuesto a trabajar en equipo. Estamos satisfechos con su contribución.",
      "Hemos notado un buen nivel de participación en las actividades. Está cumpliendo con las expectativas y mostrando una actitud colaborativa."
    ],
    "1": [
      "Está comenzando a sentirse más cómodo al compartir sus ideas. Con un poco más de confianza, su participación será más activa. ¡Anímelo a expresar sus opiniones sin temor!",
      "Estamos notando que está empezando a interactuar más. Trabajemos juntos para aumentar su interés en contribuir a las discusiones. Pequeños pasos harán una gran diferencia.",
      "A veces, participar puede sentirse intimidante. Estamos aquí para apoyarlo. Animémoslo a hacer preguntas y a compartir sus pensamientos, por pequeños que sean.",
      "Estamos observando que comienza a mostrar más interés en participar. Con un poco más de iniciativa, su contribución será más notoria. ¡Siga motivándolo!",
      "Cada estudiante encuentra su propia manera de participar. Está en una fase de descubrimiento de su voz."
    ]
  }
}