[
    {
        "id": "travel_1",
        "level": "B1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Talk together about what you like and dislike about different ways of travelling.",
            "topics": [
                "cycling",
                "taking the train",
                "driving a car",
                "travelling by plane",
                "walking"
            ],
            "second_q": "Which way of travelling is the most convenient in your country?",
            "part4_qs": [
                "Do you think people will travel more or less in the future?",
                "What are the best and worst things about public transportation?",
                "How important is it to travel to other countries?",
                "Do you prefer short trips or long holidays, and why?"
            ]
        }
    },
    {
        "id": "jobs_2",
        "level": "B1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Talk together about different aspects that make a job interesting or difficult.",
            "topics": [
                "pay and salary",
                "working hours",
                "helping people",
                "training opportunities",
                "stress and pressure"
            ],
            "second_q": "Which of these aspects do you think is the most important when choosing a career?",
            "part4_qs": [
                "How important is it to enjoy your job?",
                "Do you think technology will create or destroy jobs in the future?",
                "Should young people focus on university or vocational training?",
                "What role do hobbies play in maintaining a good work-life balance?"
            ]
        }
    },
    {
        "id": "education_3",
        "level": "B1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the effectiveness of different ways of learning and studying.",
            "topics": [
                "group study",
                "learning alone",
                "online courses",
                "using textbooks",
                "getting a private tutor"
            ],
            "second_q": "In your opinion, which method is the most beneficial for retaining new information?",
            "part4_qs": [
                "Do you think exams are the best way to test students' knowledge?",
                "What influence do teachers have on a student's success?",
                "Should education systems be more focused on practical skills or academic subjects?",
                "What is the biggest challenge facing students today?"
            ]
        }
    },
    {
        "id": "health_4",
        "level": "B1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Consider the benefits and drawbacks of different activities on personal health.",
            "topics": [
                "meditation",
                "going to the gym",
                "eating organic food",
                "spending time outdoors",
                "sleeping enough"
            ],
            "second_q": "Which of these activities has the most immediate positive effect on your mental health?",
            "part4_qs": [
                "Is the government responsible for promoting a healthy lifestyle among citizens?",
                "Do you think people rely too much on medicine?",
                "How can schools encourage children to be more active?",
                "What are the best ways to deal with stress in modern life?"
            ]
        }
    },
    {
        "id": "environment_5",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss ways that individuals and communities can help protect the environment.",
            "topics": [
                "recycling more",
                "using public transport",
                "saving energy at home",
                "supporting local farmers",
                "joining clean-up campaigns"
            ],
            "second_q": "Which action do you believe makes the biggest long-term difference to the planet?",
            "part4_qs": [
                "Do you think it is already too late to reverse climate change?",
                "Should companies be forced to use sustainable materials?",
                "How do you feel about protests that interrupt daily life?",
                "What impact does deforestation have on global weather patterns?"
            ]
        }
    },
    {
        "id": "technology_6",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Consider the advantages and disadvantages of different forms of technology.",
            "topics": [
                "smartphones",
                "social media",
                "artificial intelligence",
                "self-driving cars",
                "video games"
            ],
            "second_q": "Which of these forms of technology has had the most significant impact on society in the last ten years?",
            "part4_qs": [
                "Do you think artificial intelligence poses a threat to creativity?",
                "At what age should children be given access to social media?",
                "How has the way we communicate changed since the invention of the internet?",
                "Is it possible to live without using technology in the modern world?"
            ]
        }
    },
    {
        "id": "food_7",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Talk about various ways that people around the world shop for and consume food.",
            "topics": [
                "supermarkets",
                "local markets",
                "online delivery",
                "eating out",
                "growing food at home"
            ],
            "second_q": "Which of these options offers the best value for money and highest quality produce?",
            "part4_qs": [
                "Do you think food waste is a serious problem in your country?",
                "What role should tradition play in modern cooking?",
                "How healthy is the average diet in your country?",
                "Should there be global regulations on farming practices?"
            ]
        }
    },
    {
        "id": "culture_8",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the importance of different ways for communities to express their culture.",
            "topics": [
                "music and festivals",
                "traditional clothes",
                "local language",
                "historical monuments",
                "local cuisine"
            ],
            "second_q": "Which of these is the most effective way for immigrants to share their culture with a new society?",
            "part4_qs": [
                "Is it important to preserve local dialects and languages?",
                "How is culture influenced by global events?",
                "Do you think cultural appropriation is a genuine problem?",
                "What is the best way to learn about a culture different from your own?"
            ]
        }
    },
    {
        "id": "entertainment_9",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Consider the various forms of entertainment and their impact on people's free time.",
            "topics": [
                "watching television",
                "reading books",
                "going to concerts",
                "playing sports",
                "visiting museums"
            ],
            "second_q": "Which of these forms of entertainment offers the most educational value?",
            "part4_qs": [
                "Has the quality of television improved or declined in recent years?",
                "Do modern forms of entertainment make us less social?",
                "What do you think will be the most popular form of entertainment in twenty years?",
                "Should governments fund arts and cultural events?"
            ]
        }
    },
    {
        "id": "housing_10",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss factors that influence where people choose to live.",
            "topics": [
                "cost of living",
                "proximity to work",
                "safety and security",
                "access to nature",
                "size of the house/apartment"
            ],
            "second_q": "Which factor do you think is the most difficult for young people to balance when looking for a home?",
            "part4_qs": [
                "Do you believe house prices are fair in your country?",
                "What are the pros and cons of renting versus owning a property?",
                "How important is it to live close to your extended family?",
                "Do you think urban planning should prioritize cars or people?"
            ]
        }
    }
]