[
    {
        "id": "environment_5",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss ways that individuals and communities can help protect the environment.",
            "topics": [
                "recycling more",
                "using public transport",
                "saving energy at home",
                "supporting local farmers",
                "joining clean-up campaigns"
            ],
            "second_q": "Which action do you believe makes the biggest long-term difference to the planet?",
            "part4_qs": [
                "Do you think it is already too late to reverse climate change?",
                "Should companies be forced to use sustainable materials?",
                "How do you feel about protests that interrupt daily life?",
                "What impact does deforestation have on global weather patterns?"
            ]
        }
    },
    {
        "id": "technology_6",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Consider the advantages and disadvantages of different forms of technology.",
            "topics": [
                "smartphones",
                "social media",
                "artificial intelligence",
                "self-driving cars",
                "video games"
            ],
            "second_q": "Which of these forms of technology has had the most significant impact on society in the last ten years?",
            "part4_qs": [
                "Do you think artificial intelligence poses a threat to creativity?",
                "At what age should children be given access to social media?",
                "How has the way we communicate changed since the invention of the internet?",
                "Is it possible to live without using technology in the modern world?"
            ]
        }
    },
    {
        "id": "food_7",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Talk about various ways that people around the world shop for and consume food.",
            "topics": [
                "supermarkets",
                "local markets",
                "online delivery",
                "eating out",
                "growing food at home"
            ],
            "second_q": "Which of these options offers the best value for money and highest quality produce?",
            "part4_qs": [
                "Do you think food waste is a serious problem in your country?",
                "What role should tradition play in modern cooking?",
                "How healthy is the average diet in your country?",
                "Should there be global regulations on farming practices?"
            ]
        }
    },
    {
        "id": "culture_8",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the importance of different ways for communities to express their culture.",
            "topics": [
                "music and festivals",
                "traditional clothes",
                "local language",
                "historical monuments",
                "local cuisine"
            ],
            "second_q": "Which of these is the most effective way for immigrants to share their culture with a new society?",
            "part4_qs": [
                "Is it important to preserve local dialects and languages?",
                "How is culture influenced by global events?",
                "Do you think cultural appropriation is a genuine problem?",
                "What is the best way to learn about a culture different from your own?"
            ]
        }
    },
    {
        "id": "entertainment_9",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Consider the various forms of entertainment and their impact on people's free time.",
            "topics": [
                "watching television",
                "reading books",
                "going to concerts",
                "playing sports",
                "visiting museums"
            ],
            "second_q": "Which of these forms of entertainment offers the most educational value?",
            "part4_qs": [
                "Has the quality of television improved or declined in recent years?",
                "Do modern forms of entertainment make us less social?",
                "What do you think will be the most popular form of entertainment in twenty years?",
                "Should governments fund arts and cultural events?"
            ]
        }
    },
    {
        "id": "housing_10",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss factors that influence where people choose to live.",
            "topics": [
                "cost of living",
                "proximity to work",
                "safety and security",
                "access to nature",
                "size of the house/apartment"
            ],
            "second_q": "Which factor do you think is the most difficult for young people to balance when looking for a home?",
            "part4_qs": [
                "Do you believe house prices are fair in your country?",
                "What are the pros and cons of renting versus owning a property?",
                "How important is it to live close to your extended family?",
                "Do you think urban planning should prioritize cars or people?"
            ]
        }
    }
[
    {
        "id": "b2_01_future_jobs",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Imagine a town is trying to encourage young people to start new careers. Discuss the importance of these factors in attracting them.",
            "topics": [
                "good transport links",
                "affordable housing",
                "training opportunities",
                "social activities",
                "high starting salaries"
            ],
            "second_q": "Which two factors do you think the town should prioritise to attract the most young people?",
            "part4_qs": [
                "Some people say that lifelong learning is more important than university. What do you think (why)?",
                "Do you think artificial intelligence will create more opportunities or more problems (why)?",
                "How much responsibility should companies have for their employees' happiness?",
                "What skills do you think will be most valuable in ten years' time?"
            ]
        }
    },
    {
        "id": "b2_02_city_life",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the advantages and disadvantages of these different things for people who live in a large city.",
            "topics": [
                "public green spaces",
                "historical buildings",
                "busy shopping areas",
                "many job vacancies",
                "high-rise apartments"
            ],
            "second_q": "Which of these factors has the most significant impact on the quality of life in a major city?",
            "part4_qs": [
                "Some people say that people who live in the country are friendlier than city dwellers. Do you agree (why)?",
                "How important is it for a city to preserve its historical monuments?",
                "Do you think governments should limit the size of large cities (why)?",
                "What are the best ways for local communities to reduce noise pollution?"
            ]
        }
    },
    {
        "id": "b2_03_social_media",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the effectiveness of these different ways of sharing personal achievements and events online.",
            "topics": [
                "posting photos on Instagram",
                "writing a personal blog",
                "making short videos",
                "sending private messages",
                "live streaming events"
            ],
            "second_q": "Which way is the most engaging for a wide audience, and why?",
            "part4_qs": [
                "Some people believe social media makes people less social in real life. What is your opinion (why)?",
                "How can people protect their privacy when using the internet?",
                "Do you think the news you get from social media is trustworthy (why)?",
                "Should there be an age limit for children using social media platforms (why)?"
            ]
        }
    },
    {
        "id": "b2_04_learning_skills",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Imagine you are advising new students on different methods they can use to develop useful skills. Discuss these different methods.",
            "topics": [
                "using educational apps",
                "taking evening classes",
                "learning from mentors",
                "practicing in groups",
                "watching online tutorials"
            ],
            "second_q": "Which method do you think is the best for developing a practical, hands-on skill, and why?",
            "part4_qs": [
                "Some people say that mistakes are the best way to learn. Do you agree (why)?",
                "How do you think classrooms will change in the next fifty years?",
                "What is the difference between intelligence and wisdom?",
                "Do you think it's necessary for everyone to learn a second language (why)?"
            ]
        }
    },
    {
        "id": "b2_05_public_art",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the different reasons for putting up public works of art in a town centre.",
            "topics": [
                "attracting tourists",
                "celebrating history",
                "making the area look better",
                "encouraging creativity",
                "making political statements"
            ],
            "second_q": "Which reason do you think is the most important for the people who live in the town?",
            "part4_qs": [
                "Do you think it's important for art to be beautiful or thought-provoking (why)?",
                "Some people say that governments should not spend money on art when there are social problems. What is your view?",
                "How does visiting a museum or gallery affect people?",
                "Should street artists be allowed to create graffiti in public places (why)?"
            ]
        }
    },
    {
        "id": "b2_06_environmental_action",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the impact these different activities have on protecting the natural environment.",
            "topics": [
                "recycling all waste",
                "using solar power",
                "buying second-hand goods",
                "eating local food",
                "taking part in clean-ups"
            ],
            "second_q": "Which action do you believe is easiest for the average person to start doing, and why?",
            "part4_qs": [
                "Some people believe that only governments and large corporations can solve environmental problems. Do you agree (why)?",
                "What is the most serious environmental problem facing your country today?",
                "How effective do you think school lessons on ecology are?",
                "Do you think people are willing to pay more for environmentally friendly products (why)?"
            ]
        }
    },
    {
        "id": "b2_07_shopping_methods",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the advantages and disadvantages of using these different methods for buying clothes and gifts.",
            "topics": [
                "shopping centres",
                "independent local shops",
                "online marketplaces",
                "second-hand stores",
                "catalogue shopping"
            ],
            "second_q": "Which of these methods do you think will be the most popular in the future, and why?",
            "part4_qs": [
                "Some people say that advertising makes people unhappy. What is your opinion (why)?",
                "How important is it to buy products made in your own country?",
                "Do you think young people spend too much money on fashion (why)?",
                "What can local businesses do to compete with large international companies?"
            ]
        }
    },
    {
        "id": "b2_08_advice_sources",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the best sources to get advice when facing a difficult personal decision.",
            "topics": [
                "parents or family",
                "teachers or mentors",
                "online forums",
                "a best friend",
                "self-help books"
            ],
            "second_q": "Which source is generally the most reliable for getting practical and useful advice?",
            "part4_qs": [
                "Do you think it is more important to follow your head or your heart when making big decisions (why)?",
                "Some people say that only life experience can teach you true wisdom. Do you agree (why)?",
                "At what point should young people become completely independent from their parents?",
                "How does culture influence the way we ask for and receive advice?"
            ]
        }
    },
    {
        "id": "b2_09_travel_transport",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the importance of these different factors when planning and taking a long journey.",
            "topics": [
                "speed of travel",
                "cost of tickets",
                "comfort of the seat",
                "access to Wi-Fi",
                "environmental impact"
            ],
            "second_q": "Which factor do you think most people consider to be the most important when traveling for business?",
            "part4_qs": [
                "Some people say that high-speed trains should replace all short-haul flights. What is your view?",
                "How has the way people travel changed in the last 20 years?",
                "Do you think the development of self-driving cars will improve road safety (why)?",
                "What role should public transportation play in reducing traffic congestion in cities?"
            ]
        }
    },
    {
        "id": "b2_10_stress_relief",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the effectiveness of these different methods for reducing stress in daily life.",
            "topics": [
                "listening to music",
                "doing physical exercise",
                "spending time alone",
                "talking to a professional",
                "having a hobby"
            ],
            "second_q": "Which method do you think is the best long-term solution for managing serious stress?",
            "part4_qs": [
                "Some people believe that competition in school causes too much stress for students. Do you agree (why)?",
                "How important is sleep for maintaining good mental health?",
                "Do you think people rely too much on screen time for relaxation (why)?",
                "What can friends and family do to support someone who is very stressed?"
            ]
        }
    },
    {
        "id": "b2_11_sports_benefits",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the benefits that people can get from participating in these different types of sports and physical activities.",
            "topics": [
                "team sports",
                "individual sports",
                "adventure sports",
                "water sports",
                "martial arts"
            ],
            "second_q": "Which type of activity is best for helping young people develop leadership skills?",
            "part4_qs": [
                "Some people say professional athletes are paid too much money. What is your view?",
                "Do you think competitive sports teaches children good values (why)?",
                "How important is it for schools to provide a wide range of sports?",
                "What attracts people to watch sports rather than taking part?"
            ]
        }
    },
    {
        "id": "b2_12_technology_home",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the ways these different types of technology are changing how people live in their homes.",
            "topics": [
                "smart heating systems",
                "voice assistants",
                "online entertainment",
                "home security cameras",
                "kitchen gadgets"
            ],
            "second_q": "Which type of technology do you think provides the most significant practical benefit to busy families?",
            "part4_qs": [
                "Some people worry that too much technology in the home makes us lazy. Do you agree (why)?",
                "How has communication within the family changed since the internet became common?",
                "Do you think it's possible for technology to solve all our domestic problems (why)?",
                "What are the biggest dangers of having home security systems connected to the internet?"
            ]
        }
    },
    {
        "id": "b2_13_film_formats",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the advantages and disadvantages of watching films in these different places or formats.",
            "topics": [
                "a cinema",
                "a laptop",
                "a mobile phone",
                "a home projector",
                "a television"
            ],
            "second_q": "Which format do you think offers the most truly immersive viewing experience?",
            "part4_qs": [
                "Do you think films and books are important for understanding other cultures (why)?",
                "Some people say that modern films rely too much on special effects. What is your opinion?",
                "How important is it to watch films in the original language?",
                "What kind of stories do you think should be made into films?"
            ]
        }
    },
    {
        "id": "b2_14_news_sources",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss how effective these different sources are for staying informed about current affairs.",
            "topics": [
                "social media feeds",
                "traditional newspapers",
                "TV news bulletins",
                "radio broadcasts",
                "online news apps"
            ],
            "second_q": "Which source do you think is the quickest way to get up-to-date information, and what are the risks?",
            "part4_qs": [
                "Some people say that bad news should not be reported. Do you agree (why)?",
                "How has the way we consume news changed in the last decade?",
                "Do you think journalists have too much power (why)?",
                "What can ordinary people do to spot fake news online?"
            ]
        }
    },
    {
        "id": "b2_15_community_projects",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Imagine you are planning a community project. Discuss which of these activities would be most successful at bringing different generations of people together.",
            "topics": [
                "a local market",
                "a shared garden",
                "a historical tour",
                "a sports day",
                "a weekly cooking class"
            ],
            "second_q": "Which activity do you think would be the easiest to organise and manage in the long term?",
            "part4_qs": [
                "Do you think that people today are less involved in their local community than they were in the past (why)?",
                "How important is it for older and younger people to spend time together?",
                "Some people believe that local councils should force unused land to be used for community purposes. What is your opinion?",
                "What benefits does volunteering bring to the people who take part?"
            ]
        }
    },
    {
        "id": "b2_16_eating_habits",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the advantages and disadvantages of these different ways of eating meals.",
            "topics": [
                "eating quickly at your desk",
                "having a late dinner",
                "eating vegetarian food",
                "eating out in restaurants",
                "having a big breakfast"
            ],
            "second_q": "Which of these eating habits do you think is the most difficult to maintain when you have a busy lifestyle?",
            "part4_qs": [
                "Some people say that all food should be locally grown. Do you agree (why)?",
                "How much should governments intervene to encourage healthy eating habits?",
                "Do you think people are becoming more aware of food waste (why)?",
                "What role does food play in celebrating different cultural events?"
            ]
        }
    },
    {
        "id": "b2_17_successful_teams",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the importance of these different characteristics for creating a successful team in school or at work.",
            "topics": [
                "a strong leader",
                "regular meetings",
                "shared goals",
                "good communication",
                "creative thinkers"
            ],
            "second_q": "Which characteristic do you think is the most important for overcoming a serious problem within a team?",
            "part4_qs": [
                "Some people believe that working alone is always better than working in a team. What is your view (why)?",
                "How can cultural differences affect teamwork?",
                "Do you think it's always necessary to have a formal leader in a team (why)?",
                "What is the best way to motivate people who are not performing well in a team?"
            ]
        }
    },
    {
        "id": "b2_18_digital_money",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the advantages and disadvantages of using these different methods of payment.",
            "topics": [
                "cash",
                "credit cards",
                "online transfers",
                "contactless payment",
                "digital currencies"
            ],
            "second_q": "Which method do you think is the safest way to pay for goods and services, and why?",
            "part4_qs": [
                "Some people worry that a cashless society will exclude certain groups of people. Do you agree (why)?",
                "How safe do you think your financial data is online?",
                "Do you think children should be taught about money management in school (why)?",
                "What are the biggest differences between saving money and spending it?"
            ]
        }
    },
    {
        "id": "b2_19_historical_sites",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the best ways to encourage young people to visit and learn about historical places and monuments.",
            "topics": [
                "interactive displays",
                "school trips",
                "social media campaigns",
                "video games based on history",
                "free entry"
            ],
            "second_q": "Which method do you think is the most effective at making history relevant to teenagers?",
            "part4_qs": [
                "Some people say that historical sites should be left untouched. What is your opinion?",
                "How important is it to remember negative or difficult parts of a country's history?",
                "Do you think historical accuracy is essential in films and books (why)?",
                "What are the benefits of learning about history for future generations?"
            ]
        }
    },
    {
        "id": "b2_20_reading_formats",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the advantages and disadvantages of reading in these different formats.",
            "topics": [
                "paper books",
                "e-readers",
                "audiobooks",
                "mobile apps",
                "magazines"
            ],
            "second_q": "Which format do you think is the most relaxing for reading before you go to sleep?",
            "part4_qs": [
                "Do you think reading fiction or non-fiction is more beneficial (why)?",
                "Some people believe that reading is losing popularity among young people. Do you agree (why)?",
                "How does the way we read change when we are reading online compared to reading a book?",
                "What kind of books do you think should be recommended to students?"
            ]
        }
    },
    {
        "id": "b2_21_global_travel",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the importance of these factors for people deciding where to travel on holiday.",
            "topics": [
                "cost of flights",
                "safety and security",
                "weather conditions",
                "cultural attractions",
                "language spoken"
            ],
            "second_q": "Which two factors are the most important for people travelling alone?",
            "part4_qs": [
                "Do you think global tourism does more harm than good to the planet (why)?",
                "Some people say that you cannot truly experience a place without speaking the local language. What is your view?",
                "How much do you think travel broadens the mind?",
                "What is the most memorable souvenir you can bring back from a holiday?"
            ]
        }
    },
    {
        "id": "b2_22_pet_ownership",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the different responsibilities involved in owning a pet.",
            "topics": [
                "providing exercise",
                "cleaning and grooming",
                "paying for vets",
                "finding a sitter when away",
                "training the animal"
            ],
            "second_q": "Which responsibility is the most difficult for someone with a very busy work schedule?",
            "part4_qs": [
                "Some people believe that animals should have the same rights as humans. Do you agree (why)?",
                "How can having a pet benefit a child's development?",
                "Do you think exotic pets should be allowed in city apartments (why)?",
                "What are the best ways to care for wild animals in a city environment?"
            ]
        }
    },
    {
        "id": "b2_23_school_rules",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the importance of these different rules or areas of behaviour in a school environment.",
            "topics": [
                "respecting teachers",
                "homework deadlines",
                "dress code",
                "no mobile phones",
                "punctuality"
            ],
            "second_q": "Which rule do you think prepares students best for life and work after school?",
            "part4_qs": [
                "Do you think students should have a say in creating school rules (why)?",
                "Some people believe that strict discipline is necessary for good learning. What is your opinion?",
                "How important is it for schools to teach life skills like cooking or budgeting?",
                "What is the best way for a teacher to deal with an unmotivated student?"
            ]
        }
    },
    {
        "id": "b2_24_celebrations",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the different ways people celebrate special public holidays in your country.",
            "topics": [
                "street parades",
                "family gatherings",
                "religious services",
                "public fireworks displays",
                "giving gifts"
            ],
            "second_q": "Which way of celebrating is the most effective at promoting a sense of national unity?",
            "part4_qs": [
                "Some people say that traditional holidays are becoming too commercial. Do you agree (why)?",
                "How important is it for countries to share their cultural celebrations with the world?",
                "Do you think local festivals should receive funding from the government (why)?",
                "What is the role of music and dancing in celebrations?"
            ]
        }
    },
    {
        "id": "b2_25_personal_time",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the advantages and disadvantages of using different methods to manage your personal time more effectively.",
            "topics": [
                "making a daily to-do list",
                "using a digital calendar",
                "waking up very early",
                "taking short breaks",
                "planning weekly goals"
            ],
            "second_q": "Which method do you think is most effective for reducing the feeling of being overwhelmed by work?",
            "part4_qs": [
                "Some people say that planning too much takes the fun out of life. What is your opinion?",
                "How important is it to dedicate time purely to relaxation?",
                "Do you think young people today have less free time than previous generations (why)?",
                "What can people do to avoid procrastination?"
            ]
        }
    },
    {
        "id": "b2_26_health_lifestyle",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the importance of these different factors for achieving a generally healthy lifestyle.",
            "topics": [
                "a balanced diet",
                "regular check-ups",
                "having a positive attitude",
                "avoiding pollution",
                "sufficient sleep"
            ],
            "second_q": "Which two factors do you think young people often neglect the most, and why?",
            "part4_qs": [
                "Do you think governments should ban unhealthy advertising aimed at children (why)?",
                "Some people believe that physical health is more important than mental health. Do you agree (why)?",
                "How can technology be used to help people track and improve their health?",
                "What is the influence of friends and family on your lifestyle choices?"
            ]
        }
    },
    {
        "id": "b2_27_museum_design",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Imagine you are designing a new modern museum. Discuss how important these different features are to make it attractive.",
            "topics": [
                "a quiet reading room",
                "a gift shop and café",
                "interactive virtual tours",
                "a large, interesting building",
                "free Wi-Fi"
            ],
            "second_q": "Which feature is the most essential for attracting visitors who do not usually go to museums?",
            "part4_qs": [
                "Some people say that museums should only display original works, not copies. What is your view?",
                "How can museums use technology to educate people more effectively?",
                "Do you think it is important for a country to have a national museum (why)?",
                "What is the most interesting museum exhibition you have ever visited?"
            ]
        }
    },
    {
        "id": "b2_28_learning_languages",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the advantages and disadvantages of using these different methods to learn a foreign language effectively.",
            "topics": [
                "intensive courses abroad",
                "language exchange partners",
                "watching foreign films",
                "using flashcards and apps",
                "one-to-one tutoring"
            ],
            "second_q": "Which method do you think is best for achieving fluent conversational skills quickly?",
            "part4_qs": [
                "Do you think the internet is making it easier or harder to learn a new language (why)?",
                "Some people say that everyone should learn English as a global language. Do you agree (why)?",
                "How important is grammar compared to vocabulary when learning a language?",
                "What are the best ways to keep practicing a language after you leave school?"
            ]
        }
    },
    {
        "id": "b2_29_creative_hobbies",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the benefits people get from having these different types of creative hobbies.",
            "topics": [
                "playing a musical instrument",
                "writing stories or poems",
                "drawing or painting",
                "photography",
                "making clothes"
            ],
            "second_q": "Which creative hobby do you think is most effective for expressing emotions and feelings?",
            "part4_qs": [
                "Some people say that creativity cannot be taught. What is your opinion?",
                "How important is it to be creative in a job that is not artistic?",
                "Do you think hobbies help people manage the stress of work or study (why)?",
                "What is the difference between a hobby and a profession?"
            ]
        }
    },
    {
        "id": "b2_30_customer_service",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the importance of these different characteristics when dealing with a customer complaint.",
            "topics": [
                "quick response time",
                "polite attitude",
                "offering compensation",
                "being knowledgeable",
                "listening carefully"
            ],
            "second_q": "Which characteristic is the most crucial for ensuring the customer uses the company again?",
            "part4_qs": [
                "Do you think customer service is generally improving or getting worse (why)?",
                "Some people believe that robots and AI should completely replace human customer service. Do you agree (why)?",
                "How important is it for companies to respond to feedback on social media?",
                "What is the most frustrating experience you have had with customer service?"
            ]
        }
    },
    {
        "id": "b2_31_future_cities",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Imagine you are planning a futuristic city. Discuss the importance of these different features.",
            "topics": [
                "vertical farms",
                "high-speed underground transport",
                "self-repairing roads",
                "public energy zones",
                "moving pavements"
            ],
            "second_q": "Which feature do you think will have the greatest impact on reducing pollution in the city?",
            "part4_qs": [
                "Some people say that living in smaller communities is better for human happiness. What is your view?",
                "How can governments ensure that futuristic cities are affordable for everyone?",
                "Do you think people will be able to work from home all the time in the future (why)?",
                "What is the greatest challenge facing town planners today?"
            ]
        }
    },
    {
        "id": "b2_32_making_friends",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the effectiveness of these different methods for making new friends after moving to a new area.",
            "topics": [
                "joining a sports team",
                "using social apps",
                "attending evening classes",
                "volunteering for a cause",
                "talking to neighbours"
            ],
            "second_q": "Which method do you think is the best for finding friends with genuine, long-term shared interests?",
            "part4_qs": [
                "Do you think it is possible to have too many friends (why)?",
                "Some people believe that online friendships are not as valuable as real-life ones. Do you agree (why)?",
                "How important is it to have friends who are different from you?",
                "What qualities do you look for in a good friend?"
            ]
        }
    },
    {
        "id": "b2_33_music_genres",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the different reasons why people enjoy listening to these different types of music.",
            "topics": [
                "pop music",
                "classical music",
                "electronic music",
                "traditional folk music",
                "heavy rock"
            ],
            "second_q": "Which genre do you think is the most effective at changing a person's mood?",
            "part4_qs": [
                "Some people say that music should be used more often in schools for teaching. What is your opinion (why)?",
                "How has the way we listen to music changed in recent years?",
                "Do you think live concerts are better than listening to music at home (why)?",
                "What is the role of music in national identity?"
            ]
        }
    },
    {
        "id": "b2_34_marketing_methods",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the effectiveness of these different ways for a company to advertise a new product to young people.",
            "topics": [
                "social media influencers",
                "television commercials",
                "celebrity endorsements",
                "pop-up shops",
                "free samples"
            ],
            "second_q": "Which method do you think is the most annoying, and which is the most easily ignored?",
            "part4_qs": [
                "Do you think all advertising aimed at children should be banned (why)?",
                "Some people believe that companies should be more honest in their advertising. Do you agree (why)?",
                "How has the internet changed the way people shop for expensive items?",
                "What are the ethical responsibilities of social media influencers?"
            ]
        }
    },
    {
        "id": "b2_35_education_future",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the importance of these different elements in preparing students for the modern world.",
            "topics": [
                "learning coding skills",
                "learning teamwork",
                "practical work experience",
                "studying philosophy",
                "memorising facts"
            ],
            "second_q": "Which two elements do you think are most important for someone starting their own business?",
            "part4_qs": [
                "Some people say that grades and exams do not measure real intelligence. What is your view?",
                "How important is the role of parents in a child's education?",
                "Do you think online degrees will eventually replace traditional universities (why)?",
                "What are the advantages of single-sex schools compared to mixed schools?"
            ]
        }
    },
    {
        "id": "b2_36_saving_planet",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the importance of these different areas for protecting endangered animals and habitats.",
            "topics": [
                "creating national parks",
                "reducing air pollution",
                "controlling hunting laws",
                "raising public awareness",
                "protecting ocean areas"
            ],
            "second_q": "Which area of focus do you think requires the most immediate international cooperation?",
            "part4_qs": [
                "Do you think ordinary people can make a big difference to global environmental issues (why)?",
                "Some people believe that new technology can solve all environmental problems. Do you agree (why)?",
                "How should governments balance economic development with environmental protection?",
                "What responsibility do developed countries have to help developing countries protect the environment?"
            ]
        }
    },
    {
        "id": "b2_37_personal_goals",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the importance of these different methods when trying to achieve a long-term personal goal.",
            "topics": [
                "getting a mentor",
                "setting small steps",
                "telling friends about it",
                "rewarding yourself",
                "ignoring criticism"
            ],
            "second_q": "Which method is the most important for maintaining motivation when facing setbacks and failure?",
            "part4_qs": [
                "Some people say that true happiness comes from enjoying the journey, not the destination. What is your view?",
                "How important is it to be ambitious in life?",
                "Do you think young people feel more pressure to succeed today than in the past (why)?",
                "What are the benefits of learning from failure?"
            ]
        }
    },
    {
        "id": "b2_38_health_system",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the different ways a country's government can improve the overall health of its citizens.",
            "topics": [
                "investing in local hospitals",
                "increasing exercise facilities",
                "improving air quality",
                "subsidizing healthy food",
                "running public health campaigns"
            ],
            "second_q": "Which way is the most effective for quickly addressing a major health crisis, like a pandemic?",
            "part4_qs": [
                "Do you think everyone should have free access to medical care (why)?",
                "Some people believe that people should be fined if they do not lead a healthy life. Do you agree (why)?",
                "How has modern technology changed the practice of medicine?",
                "What are the biggest challenges in providing healthcare in rural areas?"
            ]
        }
    },
    {
        "id": "b2_39_entertainment_value",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the different kinds of value that people get from these various forms of entertainment.",
            "topics": [
                "watching live comedy",
                "playing video games",
                "reading graphic novels",
                "going to an opera",
                "watching a sports match"
            ],
            "second_q": "Which form of entertainment do you think is the best for bringing a large group of strangers together?",
            "part4_qs": [
                "Some people say that video games are a waste of time. What is your opinion (why)?",
                "How has the rise of online streaming changed the entertainment industry?",
                "Do you think governments should control the content of entertainment (why)?",
                "What are the benefits of using humor to communicate serious ideas?"
            ]
        }
    },
    {
        "id": "b2_40_work_flexibility",
        "level": "B2",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the advantages and disadvantages of these different types of job flexibility.",
            "topics": [
                "flexi-time (choosing your hours)",
                "working from home",
                "a four-day work week",
                "long paid holidays",
                "taking a career break"
            ],
            "second_q": "Which type of flexibility is most beneficial for improving productivity?",
            "part4_qs": [
                "Do you think everyone will work from home in the future (why)?",
                "Some people believe that long working hours are necessary for a successful career. Do you agree (why)?",
                "How can employers ensure that people who work flexible hours still feel like part of a team?",
                "What is the biggest difference between working for a large corporation and a small business?"
            ]
        }
    },
    {
        "id": "c1_41_leadership_qualities",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss which two of these qualities are most important for an effective leader in a modern, global business.",
            "topics": [
                "being charismatic",
                "being decisive",
                "having expert knowledge",
                "being empathetic",
                "having a vision"
            ],
            "second_q": "Which of these qualities do you think is the most difficult to teach, and why?",
            "part4_qs": [
                "Some people say that leaders are born, not made. To what extent do you agree (why)?",
                "How does the concept of leadership differ between politics and business?",
                "What are the potential dangers of a leader being too charismatic?",
                "Do you think the age of a leader matters in a modern company (why)?"
            ]
        }
    },
    {
        "id": "c1_42_historical_impact",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the relative importance of these factors in shaping a country's national identity.",
            "topics": [
                "literature and arts",
                "geography and climate",
                "political system",
                "historical conflicts",
                "famous national figures"
            ],
            "second_q": "Which two factors are the most difficult to change or influence, and why?",
            "part4_qs": [
                "Some people say that history always repeats itself. Do you think this is true (why)?",
                "To what extent should people judge historical figures by today's standards?",
                "How does a shared language influence national cohesion?",
                "Do you think globalization is making national identities weaker (why)?"
            ]
        }
    },
    {
        "id": "c1_43_artificial_intelligence",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the ethical implications and potential benefits of integrating Artificial Intelligence (AI) into these areas of daily life.",
            "topics": [
                "healthcare and diagnosis",
                "legal decision making",
                "education and grading",
                "creative industries",
                "personal finance"
            ],
            "second_q": "Which area do you think poses the greatest risk to human jobs and which offers the greatest benefit to human welfare?",
            "part4_qs": [
                "Some people believe that AI should be regulated by international law. Do you agree (why)?",
                "How will the widespread use of AI change the definition of 'intelligence'?",
                "What is the difference between human creativity and computer-generated creativity?",
                "Do you think it's possible to build an AI that has consciousness (why)?"
            ]
        }
    },
    {
        "id": "c1_44_managing_fame",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss which of these methods would be the most effective for a young person who achieves sudden fame to manage their privacy and mental well-being.",
            "topics": [
                "hiring a media team",
                "taking a break from social media",
                "moving to a remote place",
                "only giving written interviews",
                "working with a therapist"
            ],
            "second_q": "Which method would be the hardest for a celebrity to implement, and which is the most crucial for long-term happiness?",
            "part4_qs": [
                "Some people say that people who seek fame deserve the lack of privacy that comes with it. What is your view (why)?",
                "To what extent do the media have a responsibility to protect famous people?",
                "How important is it for celebrities to use their platform to talk about serious issues?",
                "Do you think modern communication makes it easier or harder to be a private person (why)?"
            ]
        }
    },
    {
        "id": "c1_45_urban_sustainability",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the extent to which these measures can help a major city become truly sustainable.",
            "topics": [
                "implementing congestion charges",
                "requiring green roofs on buildings",
                "banning private car ownership",
                "using public water recycling",
                "subsidizing renewable energy"
            ],
            "second_q": "Which two measures are likely to face the most public opposition, and which would provide the most immediate positive change?",
            "part4_qs": [
                "Do you think it is fair for citizens to pay higher taxes for environmental improvements (why)?",
                "Some people believe that technology will eventually solve all climate change issues. Do you agree (why)?",
                "How can city planning encourage people to walk and cycle more?",
                "To what extent are individual choices less effective than government policy in tackling climate change?"
            ]
        }
    },
    {
        "id": "c1_46_risk_taking",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the motivations behind taking these different kinds of risks.",
            "topics": [
                "investing in a new business",
                "traveling to a remote area alone",
                "changing careers late in life",
                "participating in extreme sports",
                "confronting an injustice"
            ],
            "second_q": "Which motivation do you think leads to the greatest personal growth, and which is driven purely by adrenaline?",
            "part4_qs": [
                "Some people believe that society discourages young people from taking risks. What is your view (why)?",
                "How does the concept of risk differ in personal life versus professional life?",
                "Do you think cultural background influences how people view risk (why)?",
                "To what extent is caution a sign of intelligence?"
            ]
        }
    },
    {
        "id": "c1_47_modern_communication",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the potential benefits and drawbacks of these recent changes in communication methods.",
            "topics": [
                "video calls",
                "short-form messages (e.g., tweets)",
                "voice notes",
                "instant translation apps",
                "emojis and reaction buttons"
            ],
            "second_q": "Which development has caused the greatest improvement in professional communication and which has caused the biggest deterioration in clarity?",
            "part4_qs": [
                "Do you think the speed of modern communication leads to more misunderstandings (why)?",
                "Some people say that handwritten letters will eventually disappear completely. Do you agree (why)?",
                "How important is body language in a video conference call?",
                "To what extent is modern communication making people less articulate?"
            ]
        }
    },
    {
        "id": "c1_48_ethical_consumption",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the challenges involved for consumers when trying to ensure that their purchasing habits are ethical and sustainable.",
            "topics": [
                "identifying genuine ethical brands",
                "affordability of ethical products",
                "dealing with misleading advertising",
                "accessing sustainable options",
                "time spent researching"
            ],
            "second_q": "Which two challenges should governments prioritize tackling to help consumers make better choices?",
            "part4_qs": [
                "Some people believe that ethical consumption is a luxury that not everyone can afford. What is your view (why)?",
                "To what extent should companies be legally responsible for their supply chain ethics?",
                "Do you think boycotting unethical brands is an effective form of protest (why)?",
                "How does the pursuit of fashion conflict with sustainability goals?"
            ]
        }
    },
    {
        "id": "c1_49_education_models",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the likely consequences of these different approaches to educational assessment.",
            "topics": [
                "no formal exams at all",
                "peer-to-peer grading",
                "continuous assessment",
                "only oral examinations",
                "standardized international tests"
            ],
            "second_q": "Which approach would best prepare students for the pressures of a competitive professional career, and which would best encourage creativity?",
            "part4_qs": [
                "Do you think the current educational system stifles critical thinking (why)?",
                "Some people say that all knowledge is now available online, so the role of the teacher is obsolete. Do you agree (why)?",
                "How should schools address the issue of cheating in examinations?",
                "To what extent can education systems reflect the values of a society?"
            ]
        }
    },
    {
        "id": "c1_50_human_memory",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the ways these different things help us to record and preserve memories.",
            "topics": [
                "writing a diary",
                "taking digital photos",
                "telling stories",
                "visiting old places",
                "collecting physical objects"
            ],
            "second_q": "Which method do you think provides the most authentic record of the past, and which is the most likely to distort memories over time?",
            "part4_qs": [
                "Some people say that forgetting is just as important as remembering. What is your view (why)?",
                "How has the ease of digital recording changed the value we place on human memory?",
                "Do you think governments should actively preserve public memories through national archives (why)?",
                "To what extent do false memories influence people's beliefs and actions?"
            ]
        }
    },
    {
        "id": "c1_51_public_transport_design",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Imagine a major transport company is redesigning their system. Discuss the importance of these factors in creating an ideal public transport system.",
            "topics": [
                "affordability of fares",
                "onboard Wi-Fi and charging",
                "accessibility for all users",
                "frequency of service",
                "interconnected routes"
            ],
            "second_q": "Which factor do you think is the most essential for persuading car owners to switch to public transport, and why?",
            "part4_qs": [
                "Some people believe that all public transport should be free. Do you agree (why)?",
                "How can city planners balance the needs of cyclists, pedestrians, and motorists?",
                "Do you think the environmental impact of transport should be the main planning consideration (why)?",
                "What role can technology play in improving safety on public transport?"
            ]
        }
    },
    {
        "id": "c1_52_job_satisfaction",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the importance of these different characteristics when assessing job satisfaction in a demanding career.",
            "topics": [
                "feeling respected",
                "high degree of autonomy",
                "opportunities for promotion",
                "ethical work principles",
                "regular performance feedback"
            ],
            "second_q": "Which characteristic is the most crucial for retaining highly-skilled employees, and which is often overlooked by employers?",
            "part4_qs": [
                "Do you think the current generation views job satisfaction differently from previous generations (why)?",
                "Some people say that a high salary can compensate for a boring job. What is your view (why)?",
                "How important is it for a job to have a positive impact on society?",
                "To what extent should employees be involved in making major company decisions?"
            ]
        }
    },
    {
        "id": "c1_53_media_influence",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the extent to which these media forms influence people's perception of world events.",
            "topics": [
                "documentaries",
                "news satire and comedy",
                "expert analysis podcasts",
                "user-generated content",
                "international newspapers"
            ],
            "second_q": "Which two media forms are the most likely to present a biased view, and which is the most difficult to regulate?",
            "part4_qs": [
                "Some people believe that traditional media have lost their power to influence public opinion. Do you agree (why)?",
                "How can people develop critical thinking skills in relation to the media?",
                "Do you think it's possible for the media to be truly objective (why)?",
                "To what extent should media organisations be held accountable for spreading misinformation?"
            ]
        }
    },
    {
        "id": "c1_54_personal_finance",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the potential advantages and disadvantages of using these different ways to manage personal finances.",
            "topics": [
                "getting advice from a financial advisor",
                "investing in the stock market",
                "using budgeting apps",
                "keeping all money in savings",
                "buying property"
            ],
            "second_q": "Which method offers the greatest long-term security, and which carries the greatest risk for a young person?",
            "part4_qs": [
                "Do you think financial literacy should be a compulsory subject in schools (why)?",
                "Some people say that debt is an essential part of a modern economy. What is your view?",
                "How has the rise of online banking changed the relationship people have with money?",
                "To what extent should people rely on the state for financial security in old age?"
            ]
        }
    },
    {
        "id": "c1_55_technological_obsolescence",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the negative consequences of the constant and rapid obsolescence (becoming outdated) of technology.",
            "topics": [
                "increased e-waste",
                "pressure on consumers to upgrade",
                "loss of data and memories",
                "incompatibility issues",
                "short-term thinking by companies"
            ],
            "second_q": "Which consequence do you think has the most serious impact on the environment, and which is most frustrating for the average consumer?",
            "part4_qs": [
                "Some people believe that planned obsolescence should be illegal. Do you agree (why)?",
                "How can consumers push companies to produce more durable goods?",
                "Do you think technology is advancing too quickly for society to keep up (why)?",
                "What kind of products should governments require manufacturers to support for a minimum number of years?"
            ]
        }
    },
    {
        "id": "c1_56_global_culture",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the extent to which these things contribute to the development of a global culture.",
            "topics": [
                "global film franchises",
                "international sports leagues",
                "fast food chains",
                "English as a common language",
                "internet memes"
            ],
            "second_q": "Which two contributors do you think are having the most impact on traditional local cultures, and which is the most positive influence?",
            "part4_qs": [
                "Do you think a global culture will eventually lead to world peace (why)?",
                "Some people say that cultural exchange is just a form of economic exploitation. What is your view?",
                "How can local traditions be preserved in the face of globalisation?",
                "To what extent should countries adapt their laws to accommodate different cultural practices?"
            ]
        }
    },
    {
        "id": "c1_57_science_funding",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the criteria that should be used when deciding how to allocate limited government funds to scientific research projects.",
            "topics": [
                "potential for profit",
                "solving immediate global problems",
                "investigating fundamental theories",
                "developing military technology",
                "improving public health"
            ],
            "second_q": "Which criterion should be given the highest priority, and which is the most difficult to measure?",
            "part4_qs": [
                "Some people believe that private companies should fund all scientific research. Do you agree (why)?",
                "How can governments ensure that scientific advances benefit everyone equally?",
                "Do you think it is ethical to pursue research just for knowledge, without any practical application (why)?",
                "To what extent should scientists be responsible for how their discoveries are used?"
            ]
        }
    },
    {
        "id": "c1_58_moral_dilemmas",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the role of these different principles when making difficult moral decisions.",
            "topics": [
                "religious beliefs",
                "social convention",
                "personal conscience",
                "legal implications",
                "advice from elders"
            ],
            "second_q": "Which principle is the most reliable guide for an individual, and which is the most likely to change over time?",
            "part4_qs": [
                "Do you think the difference between right and wrong is absolute or relative (why)?",
                "Some people say that moral standards are declining in modern society. What is your view?",
                "How is morality influenced by the use of the internet?",
                "To what extent should governments try to enforce moral behaviour?"
            ]
        }
    },
    {
        "id": "c1_59_influence_methods",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the effectiveness of these different methods for persuading a large number of people to change their established habits.",
            "topics": [
                "government laws and fines",
                "celebrity campaigns",
                "public education programs",
                "financial incentives (subsidies)",
                "peer pressure"
            ],
            "second_q": "Which method is the most difficult to implement, and which is the most effective in the short term?",
            "part4_qs": [
                "Some people believe that a democracy should not try to influence people's personal choices. Do you agree (why)?",
                "How effective are large-scale protests in bringing about lasting change?",
                "Do you think people are generally resistant to change (why)?",
                "To what extent does propaganda rely on emotional appeal rather than logic?"
            ]
        }
    },
    {
        "id": "c1_60_future_of_workplaces",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the likely consequences of these different features becoming common in future workplaces.",
            "topics": [
                "fully automated assembly lines",
                "shared desks (hot-desking)",
                "on-site gyms and childcare",
                "remote digital management",
                "no fixed working hours"
            ],
            "second_q": "Which feature poses the greatest challenge to employee unity and which is the most beneficial for reducing work-life imbalance?",
            "part4_qs": [
                "Do you think the traditional concept of an 'office' will disappear completely (why)?",
                "Some people say that excessive office perks reduce an employee's motivation. What is your view?",
                "How important is it for employees to separate their work and personal lives?",
                "To what extent can automation increase job satisfaction?"
            ]
        }
    },
    {
        "id": "c1_61_political_participation",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the effectiveness of these different forms of political participation in bringing about fundamental change.",
            "topics": [
                "signing online petitions",
                "voting in elections",
                "joining political parties",
                "organizing public protests",
                "writing to elected officials"
            ],
            "second_q": "Which form of participation is the most difficult for young people to engage with, and which is the most easily dismissed by governments?",
            "part4_qs": [
                "Some people believe that young people are less interested in politics than they used to be. Do you agree (why)?",
                "How has social media changed the nature of political debate?",
                "Do you think politicians should always follow the will of the public (why)?",
                "To what extent is political apathy a dangerous sign for a democracy?"
            ]
        }
    },
    {
        "id": "c1_62_leisure_value",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the relative value of these different types of leisure activities for personal development.",
            "topics": [
                "traveling to historical places",
                "watching live theatre",
                "playing complex strategy games",
                "learning a physical skill",
                "reading philosophical texts"
            ],
            "second_q": "Which activity contributes most to intellectual development and which provides the greatest emotional benefit?",
            "part4_qs": [
                "Do you think society places too much value on being busy (why)?",
                "Some people say that the distinction between work and leisure is becoming blurred. What is your view?",
                "How important is it to dedicate time to 'doing nothing'?",
                "To what extent should governments subsidize arts and leisure activities?"
            ]
        }
    },
    {
        "id": "c1_63_global_problems",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the primary obstacles to international cooperation when attempting to solve these major global problems.",
            "topics": [
                "managing mass migration",
                "tackling poverty",
                "regulating arms trade",
                "addressing pandemics",
                "fighting cybercrime"
            ],
            "second_q": "Which problem is the most difficult for individual countries to solve on their own, and which is most influenced by cultural differences?",
            "part4_qs": [
                "Some people believe that nations should focus only on their own problems first. Do you agree (why)?",
                "How effective are international organizations like the UN in maintaining peace?",
                "Do you think global borders will become less important in the future (why)?",
                "To what extent does a country's wealth determine its global influence?"
            ]
        }
    },
    {
        "id": "c1_64_public_health_policy",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the ethical justification for governments to intervene in these aspects of citizens' health and lifestyle.",
            "topics": [
                "banning tobacco sales",
                "taxing sugary drinks",
                "mandating public exercise",
                "restricting freedom of movement (e.g., during a pandemic)",
                "compulsory vaccination"
            ],
            "second_q": "Which intervention is the most controversial in a free society, and which is the most difficult to implement fairly across all social classes?",
            "part4_qs": [
                "Do you think people have a moral obligation to maintain a healthy lifestyle (why)?",
                "Some people say that individuals are responsible for their own health, not the state. What is your view?",
                "How can public trust in health institutions be maintained?",
                "To what extent can wealth inequality be linked to health inequality?"
            ]
        }
    },
    {
        "id": "c1_65_future_energy",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the potential benefits and environmental costs of relying on these different sources of energy in the future.",
            "topics": [
                "wind farms",
                "nuclear power",
                "fossil fuels",
                "solar panels",
                "hydroelectric dams"
            ],
            "second_q": "Which source should governments invest in most heavily for a reliable, long-term national supply, and which is the safest option?",
            "part4_qs": [
                "Do you think the average person has a good understanding of energy production (why)?",
                "Some people believe that rich countries should share their renewable energy technology freely. Do you agree (why)?",
                "How can societies reduce their overall energy consumption without sacrificing quality of life?",
                "To what extent should a country's energy policy be independent of global politics?"
            ]
        }
    },
    {
        "id": "c1_66_influence_of_architecture",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the ways in which architecture and building design can influence the daily lives and well-being of the people who use them.",
            "topics": [
                "natural light in offices",
                "large public plazas",
                "narrow, crowded streets",
                "functional and simple housing",
                "grand, decorative monuments"
            ],
            "second_q": "Which design factor has the biggest impact on public mental health, and which is most effective at creating a sense of community?",
            "part4_qs": [
                "Do you think the government should be allowed to demolish old buildings to make way for new ones (why)?",
                "Some people say that modern architecture lacks creativity and character. What is your view?",
                "How important is it for public buildings to reflect the culture of the area?",
                "To what extent can good design reduce crime in city environments?"
            ]
        }
    },
    {
        "id": "c1_67_truth_in_art",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the importance of truth and accuracy in these different forms of art and media.",
            "topics": [
                "historical fiction films",
                "landscape paintings",
                "political cartoons",
                "journalistic photography",
                "songs about relationships"
            ],
            "second_q": "In which form is historical or factual accuracy the least important, and in which is it the most ethically necessary?",
            "part4_qs": [
                "Do you think art should challenge people's beliefs or reinforce them (why)?",
                "Some people believe that digital manipulation in photography is destroying the value of images. Do you agree (why)?",
                "How does the interpretation of art change over time?",
                "To what extent should an artist's personal life affect how their work is viewed?"
            ]
        }
    },
    {
        "id": "c1_68_environmental_protest",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the relative effectiveness and ethical implications of using these different methods of environmental protest.",
            "topics": [
                "non-violent civil disobedience (e.g., blocking roads)",
                "lobbying politicians",
                "using social media campaigns",
                "consumer boycotts",
                "taking legal action"
            ],
            "second_q": "Which method is the most successful at forcing immediate government action, and which is the most sustainable long-term strategy?",
            "part4_qs": [
                "Do you think it is acceptable to break the law to protest for a worthy cause (why)?",
                "Some people say that environmental protests are only a distraction from real policy work. What is your view?",
                "How does media coverage influence the public perception of protests?",
                "To what extent should international bodies protect the rights of environmental activists?"
            ]
        }
    },
    {
        "id": "c1_69_personal_information",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the ethical implications of collecting and using people's personal data in these different contexts.",
            "topics": [
                "online shopping habits",
                "health records",
                "location tracking",
                "school performance data",
                "job application history"
            ],
            "second_q": "In which context is data collection the most beneficial for society, and in which is it the greatest invasion of privacy?",
            "part4_qs": [
                "Do you think people are aware of how much of their personal data is being used (why)?",
                "Some people believe that privacy is an outdated concept in the modern digital age. Do you agree (why)?",
                "How can consumers ensure that companies delete their data when requested?",
                "To what extent should governments use AI to analyze public data to prevent crime?"
            ]
        }
    },
    {
        "id": "c1_70_tourism_impact",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the ways in which governments and local authorities can best manage the negative effects of mass tourism on famous destinations.",
            "topics": [
                "limiting the number of daily visitors",
                "increasing tourist taxes",
                "developing alternative attractions",
                "regulating short-term rentals",
                "investing in local infrastructure"
            ],
            "second_q": "Which measure is the most effective at protecting the local residents' quality of life, and which is the most difficult to enforce?",
            "part4_qs": [
                "Do you think it is fair for tourists to be charged more for local services than residents (why)?",
                "Some people say that sustainable tourism is an impossible goal. What is your view (why)?",
                "How has the rise of social media changed where people choose to travel?",
                "To what extent does travel help break down international prejudices?"
            ]
        }
    },
    {
        "id": "c1_71_future_of_learning",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the ethical and practical challenges of using these different immersive technologies in education.",
            "topics": [
                "Virtual Reality (VR) field trips",
                "Augmented Reality (AR) textbooks",
                "AI-driven personalized tutors",
                "holographic teacher projections",
                "brain-computer interfaces"
            ],
            "second_q": "Which technology do you think will be the most common in schools in 20 years, and which poses the biggest challenge to student privacy?",
            "part4_qs": [
                "Do you think traditional classroom learning will eventually be replaced by technology (why)?",
                "Some people believe that technology is making students rely less on their own intellect. Do you agree (why)?",
                "How important is the element of human interaction in the learning process?",
                "To what extent can technology help bridge the gap between rich and poor students?"
            ]
        }
    },
    {
        "id": "c1_72_judging_talent",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
            "part3_data": {
            "initial_q": "Discuss the reliability of these different methods for identifying and judging true talent in professional fields.",
            "topics": [
                "long written exams",
                "blind auditions (judges cannot see the candidate)",
                "personal interview performance",
                "peer recommendations",
                "practical demonstrations"
            ],
            "second_q": "Which two methods are the most objective and fair, and which is the most prone to personal bias?",
            "part4_qs": [
                "Do you think natural talent is more important than hard work for success (why)?",
                "Some people say that people should have multiple careers throughout their lifetime. What is your view?",
                "How can employers ensure that their hiring process is culturally fair?",
                "To what extent does luck play a role in becoming successful?"
            ]
        }
    },
    {
        "id": "c1_73_public_apologies",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the necessary elements for a public figure's apology to be genuinely effective and accepted by the public.",
            "topics": [
                "taking full responsibility",
                "offering clear compensation",
                "showing genuine emotion",
                "providing a concrete plan for change",
                "apologizing quickly"
            ],
            "second_q": "Which element do you think the public values the most, and which is the easiest for a public figure to fake?",
            "part4_qs": [
                "Do you think the public is too quick to forgive or too quick to judge public figures (why)?",
                "Some people believe that social media has made public apologies less meaningful. Do you agree (why)?",
                "How important is it for public figures to admit when they are wrong?",
                "To what extent should past mistakes affect a person's current career?"
            ]
        }
    },
    {
        "id": "c1_74_digital_security",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the main challenges involved in maintaining robust digital security for individuals and large organizations.",
            "topics": [
                "human error and carelessness",
                "sophisticated phishing attacks",
                "outdated software and hardware",
                "lack of international cooperation",
                "inadequate legal protection"
            ],
            "second_q": "Which challenge is the most difficult for individuals to overcome, and which requires the most investment from companies?",
            "part4_qs": [
                "Some people say that complete digital security is an illusion. What is your view (why)?",
                "How much responsibility should technology companies have for protecting users from cybercrime?",
                "Do you think governments should have the right to access private encrypted communication (why)?",
                "To what extent is online anonymity beneficial for society?"
            ]
        }
    },
    {
        "id": "c1_75_value_of_tradition",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the reasons why people value traditions and rituals in modern society.",
            "topics": [
                "creating a sense of belonging",
                "connecting with the past",
                "providing stability and routine",
                "teaching moral values",
                "forming tourist attractions"
            ],
            "second_q": "Which reason is the most essential for the psychological well-being of the individual, and which is the most beneficial for the economy?",
            "part4_qs": [
                "Do you think societies should be quicker to abandon traditions that no longer serve a purpose (why)?",
                "Some people believe that traditions slow down progress and change. Do you agree (why)?",
                "How can different cultural traditions coexist peacefully in one society?",
                "To what extent should children be forced to participate in family traditions?"
            ]
        }
    },
    {
        "id": "c1_76_scientific_ethics",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the ethical principles that should guide scientific research, particularly in controversial areas.",
            "topics": [
                "informed consent of participants",
                "potential for misuse of findings",
                "avoiding unnecessary suffering",
                "transparency of methodology",
                "independence from commercial interest"
            ],
            "second_q": "Which principle is the most difficult to maintain in a competitive research environment, and which should be the absolute priority?",
            "part4_qs": [
                "Do you think the pace of scientific discovery is outstripping ethical debate (why)?",
                "Some people say that there are some scientific questions that should never be answered. What is your view?",
                "How should society deal with scientific advances that challenge deeply held beliefs?",
                "To what extent should the public have a say in setting the ethical limits for scientific research?"
            ]
        }
    },
    {
        "id": "c1_77_art_funding",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the justification for governments allocating public funds to these different aspects of the arts.",
            "topics": [
                "local amateur theatre",
                "maintaining national galleries",
                "funding experimental films",
                "providing art education in schools",
                "offering grants to individual artists"
            ],
            "second_q": "Which aspect is the most vital for long-term cultural enrichment, and which is the most likely to face political criticism?",
            "part4_qs": [
                "Do you think art can be considered a human necessity rather than a luxury (why)?",
                "Some people believe that successful art should fund itself. Do you agree (why)?",
                "How can governments ensure that art funding is distributed fairly and not just to elite projects?",
                "To what extent should art be used for social commentary or political messages?"
            ]
        }
    },
    {
        "id": "c1_78_crisis_response",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the importance of these different characteristics when a government is responding to a major national crisis.",
            "topics": [
                "speed of reaction",
                "transparency in communication",
                "cooperation with international partners",
                "ability to improvise solutions",
                "financial reserves"
            ],
            "second_q": "Which characteristic is the most crucial for maintaining public trust during the crisis, and which is the most difficult to achieve under pressure?",
            "part4_qs": [
                "Do you think a crisis often reveals the true character of a society (why)?",
                "Some people say that the media exaggerates crises for profit. What is your view?",
                "How can leaders prepare effectively for unpredictable major events?",
                "To what extent should citizens be expected to sacrifice personal freedoms during a crisis?"
            ]
        }
    },
    {
        "id": "c1_79_personal_reputation",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the ways in which people can control or influence their own reputation in the modern world.",
            "topics": [
                "managing social media profiles",
                "choosing a public mentor",
                "performing acts of charity",
                "achieving professional excellence",
                "controlling personal information online"
            ],
            "second_q": "Which method is the most effective for creating a reliable professional reputation, and which is the most vulnerable to damage?",
            "part4_qs": [
                "Do you think a person's online reputation is more important than their real-life reputation (why)?",
                "Some people believe that reputation is entirely based on perception, not reality. Do you agree (why)?",
                "How has the concept of privacy changed in the age of constant digital surveillance?",
                "To what extent can a bad reputation be successfully repaired?"
            ]
        }
    },
    {
        "id": "c1_80_value_of_solitude",
        "level": "C1",
        "set_time_p3": 120,
        "set_time_p4": 240,
        "part3_data": {
            "initial_q": "Discuss the benefits and drawbacks of spending long periods of time in solitude (being alone) in these different contexts.",
            "topics": [
                "traveling solo",
                "working on a creative project",
                "living in a remote location",
                "studying for an exam",
                "spending time in nature"
            ],
            "second_q": "In which context is solitude the most beneficial for psychological clarity, and in which is it the most challenging for maintaining motivation?",
            "part4_qs": [
                "Do you think modern life makes it harder or easier to find genuine solitude (why)?",
                "Some people say that people who live alone are more independent. What is your view?",
                "How important is it for children to learn to be comfortable on their own?",
                "To what extent is silence a necessary component of deep thought?"
            ]
        }
    }
]