[
    {
        "id": "B2_01",
        "level": "B2",
        "title": "The Origin of Chewing Gum",
        "content": "We tend to think of chewing gum as a modern American invention, but it has actually been around for thousands of years. The ancient Greeks used to chew a resin called mastic, [1] came from the bark of a tree. This substance was thought to have health benefits as [2] as freshening the breath. In South America, the Aztecs chewed a substance called chicle. This was natural, but in [3] of its popularity, it had a drawback: it would eventually break [4] . In modern times, early versions of gum were tasteless, but in 1869, flavoured gum was introduced. It was an instant success. Today, [5] the fact that it is banned in some places, it remains popular globally. However, environmentalists assume it is [6] problem because it is not biodegradable. Therefore, scientists are looking [7] ways to make it eco-friendly. Perhaps in the future, we will see gum that disappears [8] trace.",
        "answers": { "1": "WHICH", "2": "WELL", "3": "SPITE", "4": "UP", "5": "DESPITE", "6": "A", "7": "INTO", "8": "WITHOUT" }
    },
    {
        "id": "B2_02",
        "level": "B2",
        "title": "Learning a New Instrument",
        "content": "Many people say they would like to learn a musical instrument, but they often give [1] before they have really started. One of the main reasons for this is that they [2] not realise how much practice is involved. It is said that to become an expert [3] anything, you need to put in 10,000 hours of practice. That is a [4] of time! However, you don't need to be an expert to enjoy playing. If you set achievable goals, [5] as learning one simple song a week, you will see progress. It is also important to choose an instrument that suits you. For example, [6] you live in a small apartment, a drum kit might not be the best idea. Above [7] , remember that playing music should be fun, so don't be too hard on [8] if you make mistakes.",
        "answers": { "1": "UP", "2": "DO", "3": "AT", "4": "LOT", "5": "SUCH", "6": "IF", "7": "ALL", "8": "YOURSELF" }
    },
    {
        "id": "B2_03",
        "level": "B2",
        "title": "The Northern Lights",
        "content": "The Aurora Borealis, commonly known as the Northern Lights, is one of nature's most spectacular displays. These lights appear [1] the sky above the magnetic poles of the earth. They are created [2] electrically charged particles from the sun collide with gases in the Earth's atmosphere. The colours depend on which gas is being affected; oxygen produces green and red lights, [3] nitrogen creates blue and purple ones. The best time to see them is in winter, when the nights are longest. However, seeing them is never guaranteed because it relies [4] clear skies. Many people travel thousands of miles just [5] the chance to witness this phenomenon. It is widely regarded [6] one of the most beautiful sights in the world. If you ever get the opportunity to see them, it is an experience you [7] never forget. Just make sure you dress warmly, as it can get freezing [8] !",
        "answers": { "1": "IN", "2": "WHEN", "3": "WHILE", "4": "ON", "5": "FOR", "6": "AS", "7": "WILL", "8": "COLD" }
    },
    {
        "id": "B2_04",
        "level": "B2",
        "title": "Running a Marathon",
        "content": "Running a marathon is widely considered one of the toughest physical challenges a person can undertake. It requires months of training to ensure the body is capable [1] running 42 kilometres without stopping. Beginners are advised to start slowly, gradually increasing [2] distance they run each week. It is also vital to pay attention to diet, as runners need plenty of energy-rich foods like pasta and rice. On the day of the race, the atmosphere is usually electric, with crowds cheering the runners [3] . Many participants run for charity, raising money for good causes. Even [4] you are not a professional athlete, finishing a marathon is a huge achievement. Most runners say that crossing the finish line makes all the hard work worth [5] . However, be warned: once you have completed one, you might find [6] wanting to do another. It can be quite addictive! So, why [7] buy a pair of running shoes and give it a [8] ?",
        "answers": { "1": "OF", "2": "THE", "3": "ON", "4": "IF", "5": "IT", "6": "YOURSELF", "7": "NOT", "8": "GO" }
    },
    {
        "id": "B2_05",
        "level": "B2",
        "title": "The History of Pizza",
        "content": "Pizza is one of the most popular foods in the world, but its origins are often debated. While flatbreads with toppings have existed for centuries, the modern pizza was born in Naples, Italy, in the late 18th century. It was originally food [1] the poor, sold by street vendors and eaten on the go. In 1889, a chef named Raffaele Esposito created a special pizza [2] honour of Queen Margherita of Savoy. He used tomatoes, mozzarella, and basil to represent the colours of the Italian flag. The Queen loved it, and the 'Pizza Margherita' [3] named after her. However, pizza did not become globally famous [4] after World War II, when soldiers returning from Italy brought their love for the dish home with them. Today, there are countless variations, [5] from classic Italian styles to American deep-dish. Whether you like it with pineapple [6] not, there is no denying that pizza is here to [7] . It truly is a global [8] .",
        "answers": { "1": "FOR", "2": "IN", "3": "WAS", "4": "UNTIL", "5": "RANGING", "6": "OR", "7": "STAY", "8": "PHENOMENON" }
    },
    {
        "id": "B2_06_XMAS",
        "level": "B2",
        "title": "The Tradition of the Christmas Tree",
        "content": "For many families, the Christmas tree is the centrepiece of their holiday decorations. But where did this tradition come [1] ? It is generally believed to have started in Germany in the 16th century. devout Christians brought decorated trees [2] their homes. Some built wooden pyramids and decorated them with evergreens and candles if wood [3] scarce. It is widely thought that Martin Luther, the Protestant reformer, was the first person to [4] lighted candles to a tree. Walking home one winter evening, he was awed by the brilliance of stars twinkling [5] evergreens. To recapture the scene for his family, he erected a tree in the main room and wired its branches with lighted candles. Today, we use electric lights [6] of wax candles to avoid fire hazards. Whether real [7] artificial, the tree remains a symbol of the festive season. It is often topped with an angel or a [8] .",
        "answers": { "1": "FROM", "2": "INTO", "3": "WAS", "4": "ADD/PUT", "5": "AMIDST/AMONG/AMONGST", "6": "INSTEAD", "7": "OR", "8": "STAR" }
    },
    {
        "id": "B2_07_AIR",
        "level": "B2",
        "title": "My First Flight",
        "content": "I will never forget the first time I went on a plane. I was ten years old and we were going [1] holiday to Spain. My parents had booked the tickets months [2] advance. When we arrived at the airport, I was amazed by [3] big it was. We checked in our bags and then went through security. I felt a bit nervous when the plane started to speed [4] the runway. However, once we were in the air, the view was incredible. The houses below looked [5] toy buildings. The flight attendants were very friendly and gave us snacks. I spent most of the time looking out [6] the window at the clouds. It felt [7] magic to be flying so high. When we landed, everyone clapped, which I thought was funny. It was [8] an exciting experience that I wanted to do it again immediately.",
        "answers": { "1": "ON", "2": "IN", "3": "HOW", "4": "DOWN/ALONG", "5": "LIKE", "6": "OF", "7": "LIKE", "8": "SUCH" }
    },
    {
        "id": "B2_08_SCOOT",
        "level": "B2",
        "title": "Electric Scooters in Cities",
        "content": "Electric scooters, or e-scooters, have become a common sight in many cities around the world. They are seen [1] a convenient and eco-friendly way to travel short distances. You can rent them using an app on your phone and leave them [2] you finish your journey. This makes them perfect for the 'last mile' of a commute, [3] as getting from the train station to the office. However, they are not without problems. Some pedestrians complain that riders drive [4] fast on pavements, which can be dangerous. There have also been accidents [5] cars because drivers did not see the scooters. As a result, some cities have introduced strict rules about where they can [6] ridden. Despite these issues, their popularity shows [7] sign of slowing down. They are a fun way to get [8] the city without using a car.",
        "answers": { "1": "AS", "2": "WHERE/WHEREVER/WHEN", "3": "SUCH", "4": "TOO", "5": "INVOLVING/WITH", "6": "BE", "7": "NO", "8": "AROUND/ROUND" }
    },
    {
        "id": "B2_09_BIRD",
        "level": "B2",
        "title": "The Parakeets of London",
        "content": "If you walk through a park in London, you might be surprised to see bright green parrots flying among the trees. These are ring-necked parakeets, and [1] are thousands of them in the city. Nobody knows for sure [2] they arrived. One famous story says that Jimi Hendrix released a pair [3] the 1960s. Another theory is that they escaped from a film set. Whatever the truth is, these birds have adapted remarkably well [4] the British climate. They are very noisy and can often be heard before they are [5] . They live in holes in old trees and eat fruit, berries, and nuts. While many people love seeing such colourful birds, others are worried. The parakeets can be aggressive and might take food [6] native birds. Despite this, they seem quite happy to live alongside humans. They are now a permanent part [7] London's wildlife. It is certainly [8] unusual sight in a rainy English city.",
        "answers": { "1": "THERE", "2": "HOW/WHEN", "3": "IN", "4": "TO", "5": "SEEN", "6": "FROM", "7": "OF", "8": "AN" }
    },
    {
        "id": "B2_10_HEAT",
        "level": "B2",
        "title": "Hotter Summers",
        "content": "Summer used to be everyone's favourite season, but recently, the heat has become a bit too much. With temperatures regularly rising [1] 35 degrees, staying cool is a priority. Many people in northern Europe are not used [2] such heat. Houses are built to keep heat in, not let it [3] , which makes sleeping difficult. Sales of electric fans and air conditioning units have gone [4] significantly. We are also changing our habits; people go for walks later in the evening [5] it is cooler. Doctors advise drinking plenty of water to avoid becoming dehydrated. It is also important to wear sunscreen to protect [6] skin from the sun. While it is nice to go to the beach, we must be careful not to stay in the sun [7] long. It seems that hot summers are here to [8] .",
        "answers": { "1": "ABOVE/TO/OVER", "2": "TO", "3": "OUT", "4": "UP", "5": "WHEN/AS/BECAUSE", "6": "YOUR/THE", "7": "TOO", "8": "STAY" }
    },
    {
        "id": "B2_11_AI",
        "level": "B2",
        "title": "Fun with AI Images",
        "content": "Artificial Intelligence is not just for serious work; it can also be a lot of fun. New programs allow anyone [1] create amazing pictures just by typing a description. For example, you can ask for a picture of a cat riding a skateboard [2] space, and the AI will generate it in seconds. It feels [3] magic! You don't need to be an artist or know [4] to draw. This technology uses millions of images from the internet to learn what things look like. People are using it to make funny greeting cards or designs for T-shirts. However, sometimes the results are [5] bit strange. The AI might give a person six fingers [6] three legs! Despite these mistakes, it is a great way to unleash your creativity. It is exciting to see [7] the computer comes up with. Why not give it [8] try?",
        "answers": { "1": "TO", "2": "IN/INTO/THROUGH", "3": "LIKE", "4": "HOW", "5": "A", "6": "OR", "7": "WHAT", "8": "A" }
    },
    {
        "id": "C1_01",
        "level": "C1",
        "title": "The Impact of Noise",
        "content": "Noise pollution is often defined as unwanted sound released into the environment. It disturbs humans and causes an adverse effect on [1] mental and psychological well-being. It is measured in decibels and is generated [2] a number of sources, including traffic, construction and industrial activities. [3] not commonly considered a major environmental concern, its impact is significant. Prolonged exposure to high levels of noise can lead to hearing loss, stress, and sleep disturbances. Furthermore, it interferes [4] communication and concentration. What is [5] , it affects wildlife; animals rely on sound for navigation and finding food, and noise pollution disrupts these essential activities. Consequently, urban planners are now placing [6] emphasis on noise reduction strategies. These include sound barriers and the use of quieter materials. [7] these measures are expensive, they are deemed necessary for improving the quality of life. It is high [8] we took this issue seriously.",
        "answers": { "1": "BOTH", "2": "BY", "3": "ALTHOUGH", "4": "WITH", "5": "MORE", "6": "GREATER", "7": "WHILE", "8": "TIME" }
    },
    {
        "id": "C1_02",
        "level": "C1",
        "title": "Christmas in Iceland",
        "content": "Icelandic Christmas traditions are steeped in folklore and are quite distinct from those in the rest of Europe. [1] leads the celebrations is not a single Santa Claus, but thirteen 'Yule Lads'. These mischievous trolls come down from the mountains one by one in the thirteen nights [2] up to Christmas. Children place a shoe on their windowsill, hoping to wake up to a small gift. However, if they have misbehaved, they will find a rotting potato [3] . The Lads are the sons of Grýla, a terrifying ogress said to have an appetite for naughty children. As [4] that were not enough, there is also the Yule Cat, a beast that eats anyone who hasn't received a new piece of clothing [5] Christmas Eve. This tradition likely started to encourage farm workers to finish processing wool [6] time for the holidays. Despite their scary origins, these figures are now beloved, adding a unique [7] of mystery to the season. It is certainly a time of year [8] locals and tourists alike look forward to.",
        "answers": { "1": "WHAT", "2": "LEADING", "3": "INSTEAD", "4": "IF", "5": "BY", "6": "IN", "7": "SENSE", "8": "WHICH" }
    },
    {
        "id": "C1_03",
        "level": "C1",
        "title": "Vertical Farming",
        "content": "By the year 2050, the world's population is expected to increase by 3 billion people. To feed everyone, we will need land the size of Brazil, but we simply do not have [1] space. This is where vertical farming comes in. It involves growing crops in stacked layers, often in controlled indoor environments. [2] only does this save space, but it also uses 95% less water than traditional farming. Furthermore, because the environment is strictly controlled, there is no need for chemical pesticides, making the food healthier. Another benefit is that crops can be grown year-round, regardless [3] the weather outside. However, the technology is not without its challenges. The artificial lighting required consumes a vast [4] of electricity, making it expensive. Critics argue that unless renewable energy sources are used, the carbon footprint could be higher than [5] of conventional agriculture. Nevertheless, as costs come down, vertical farming may well turn [6] to be the future of food production. It is a field [7] watching closely in the coming years. We are on the [8] of an agricultural revolution.",
        "answers": { "1": "ENOUGH", "2": "NOT", "3": "OF", "4": "AMOUNT", "5": "THAT", "6": "OUT", "7": "WORTH", "8": "VERGE" }
    },
    {
        "id": "C1_04",
        "level": "C1",
        "title": "The Benefits of Bilingualism",
        "content": "Speaking more than one language is often seen as a useful skill for travel, but recent research suggests the benefits go far deeper. It appears that the bilingual brain operates differently [1] that of a monolingual speaker. Constantly switching between languages serves as a form of exercise for the brain, strengthening the area responsible [2] executive functions like problem-solving and multitasking. Moreover, studies have shown that bilingualism can delay the onset of dementia by up to five years. It seems that the effort required to suppress one language while speaking the [3] builds up a 'cognitive reserve'. This protects the brain against aging. [4] addition to cognitive benefits, there are social advantages. Bilinguals are often better at understanding other people's perspectives, [5] leads to greater empathy. It is never too late to start learning; even adults who pick [6] a new language later in life can experience these positive effects. So, [7] than viewing language learning as a chore, we should see it as an investment in our mental health. The evidence speaks for [8] .",
        "answers": { "1": "FROM", "2": "FOR", "3": "OTHER", "4": "IN", "5": "WHICH", "6": "UP", "7": "RATHER", "8": "ITSELF" }
    },
    {
        "id": "C1_05",
        "level": "C1",
        "title": "Remote Working",
        "content": "The concept of working from home is not new, but the scale at which it is happening today is unprecedented. Advancements in technology have [1] it possible for employees to collaborate from opposite sides of the globe. For many, the lack of a daily commute is the biggest advantage, freeing [2] hours of time each week. Additionally, it offers a better work-life balance, allowing parents to spend more time with their children. On the [3] hand, some argue that remote work leads to isolation. Without the casual interactions that take place in an office, team spirit can suffer. There is also the risk of 'burnout', as the boundary [4] work and home life becomes blurred. Many employees find it hard to switch [5] at the end of the day. To combat this, experts suggest creating a dedicated workspace and sticking to a strict schedule. Whether remote work will replace the traditional office entirely remains to be [6] . However, it is clear that the 'hybrid' model is likely to become the new norm. The way we work has changed [7] good. We must adapt [8] get left behind.",
        "answers": { "1": "MADE", "2": "UP", "3": "OTHER", "4": "BETWEEN", "5": "OFF", "6": "SEEN", "7": "FOR", "8": "OR" }
    },
    {
        "id": "C1_06_XMAS",
        "level": "C1",
        "title": "KFC for Christmas?",
        "content": "In most parts of the world, a traditional Christmas dinner involves turkey or ham. However, in Japan, the festive meal of choice is Kentucky Fried Chicken. This unique tradition dates [1] to 1974, when KFC launched a marketing campaign called 'Kentucky for Christmas'. At the time, Japan had no established Christmas traditions, so the company filled the void [2] remarkable success. Today, it is [3] popular that families have to order their meals months in advance. The 'party bucket' often includes not just chicken, [4] also cake and wine. While it may seem strange to outsiders, for many Japanese people, Christmas wouldn't be the same [5] it. The Colonel Sanders statues outside the restaurants are even dressed [6] in Santa suits. It serves as a fascinating example of how a commercial brand can integrate [7] into a culture's holiday customs. It just goes to [8] the power of advertising.",
        "answers": { "1": "BACK", "2": "WITH", "3": "SO", "4": "BUT", "5": "WITHOUT", "6": "UP", "7": "ITSELF", "8": "SHOW/PROVE" }
    },
    {
        "id": "C1_07_AIR",
        "level": "C1",
        "title": "The Changing Face of Air Travel",
        "content": "The Golden Age of air travel, characterized by ample legroom and gourmet meals, is largely a thing of the past. Today, flying is often viewed [1] a means to an end rather than a luxury experience. Budget airlines have democratised travel, making it accessible to millions, but this has come at a [2] . Passengers are often subjected to cramped seats and a plethora of extra charges for baggage and food. Furthermore, the environmental impact of aviation has come [3] intense scrutiny. The concept of 'flight shame' is discouraging people [4] taking unnecessary trips. Consequently, there is a growing demand for cleaner aviation fuels. Engineers are currently working on electric planes, though they are likely years [5] from commercial use. Until then, we must weigh the convenience of flying [6] the carbon footprint it leaves. The industry finds itself at a crossroads, needing to adapt [7] face being grounded by regulations. The future of flight remains up in the [8] .",
        "answers": { "1": "AS", "2": "PRICE/COST", "3": "UNDER", "4": "FROM", "5": "AWAY/OFF", "6": "AGAINST", "7": "OR", "8": "AIR" }
    },
    {
        "id": "C1_08_SCOOT",
        "level": "C1",
        "title": "The E-Scooter Debate",
        "content": "Walk through any major European city today, and you are likely to encounter the silent hum of electric scooters. Hailed by many [1] the solution to urban congestion, they offer a quick and emission-free way to navigate traffic. However, their arrival has not been universally welcomed. The sight of scooters scattered across pavements has drawn the ire of pedestrians, [2] claim they are a tripping hazard. Moreover, the speed [3] which they travel can be alarming. Accidents involving e-scooters are on the rise, leading to calls for stricter regulation. Some cities have banned them entirely, while others have introduced speed limits and mandatory parking zones. The challenge lies [4] integrating this new mode of transport with existing infrastructure. Roads built for cars are ill-equipped to handle them, [5] are pavements designed for walking. Unless a compromise is [6] , the conflict between riders and pedestrians will escalate. We need to find a way to share our streets [7] endangering anyone. It is a bumpy road [8] .",
        "answers": { "1": "AS", "2": "WHO", "3": "AT", "4": "IN", "5": "NOR/NEITHER/AS", "6": "REACHED/FOUND", "7": "WITHOUT", "8": "AHEAD" }
    },
    {
        "id": "C1_09_BIRD",
        "level": "C1",
        "title": "Bin Chickens: An Australian Icon?",
        "content": "The Australian White Ibis is a bird that elicits strong reactions. Historically a wetland species, drought and habitat loss forced it to migrate to urban areas. Now, it is a common sight in Sydney, scavenging for food in rubbish bins, earning it the nickname 'bin chicken'. [1] from being admired, it is often reviled as a pest. However, ecologists argue that the ibis is simply doing [2] it takes to survive. They have shown remarkable adaptability, learning to open bin lids and navigate busy streets. In [3] of their poor reputation, they have become a cultural icon, featuring on merchandise and even tattoos. Their resilience is actually quite admirable. They serve [4] a reminder of how wildlife is forced to adapt to human encroachment. Rather [5] viewing them with disgust, perhaps we should view them with a degree of respect. After [6] , it is our waste that sustains them. We have created the perfect environment [7] them to thrive. They are here to stay, whether we like it [8] not.",
        "answers": { "1": "FAR", "2": "WHAT/WHATEVER", "3": "SPITE", "4": "AS", "5": "THAN", "6": "ALL", "7": "FOR", "8": "OR" }
    },
    {
        "id": "C1_10_HEAT",
        "level": "C1",
        "title": "Adapting to the Heat",
        "content": "As global temperatures continue to break records, the reality of hotter summers is something we must all adjust to. For countries traditionally accustomed to mild weather, this shift presents [1] significant logistical challenge. Our infrastructure, particularly our housing stock, is designed to retain heat, which becomes a liability [2] temperatures soar. Retrofitting homes with shutters and ventilation is expensive but necessary. Beyond architecture, our daily routines may need to change. The southern European concept of the 'siesta' might [3] become the norm further north. Working during the hottest part of the day could become unsafe. Agriculture is also [4] threat, with crops failing due to drought. Water conservation will move from being a moral choice to a legal [5] . We are entering unchartered territory. Ignoring the problem is no [6] an option. We must adapt our cities and our behaviour to cope with this new thermal reality. The heat is [7] just uncomfortable; it is a warning. We need to act [8] it is too late.",
        "answers": { "1": "A", "2": "WHEN/AS/WHENEVER", "3": "WELL", "4": "UNDER", "5": "REQUIREMENT/NECESSITY/OBLIGATION", "6": "LONGER", "7": "NOT", "8": "BEFORE" }
    },
    {
        "id": "C1_11_AI",
        "level": "C1",
        "title": "The Art of Algorithms",
        "content": "The emergence of AI image generators has sparked a fierce debate in the art world. On the one hand, these tools allow anyone to create stunning visuals simply by entering a text prompt. It democratises art, allowing those [1] technical skills to express themselves visually. The results can be surreal, amusing, and breathtakingly detailed. On the [2] hand, traditional artists are concerned about copyright. The AI models are trained [3] millions of existing images, often without the consent of the original creators. Is it inspiration, or is it theft? Furthermore, there is the question of authorship; [4] creates the image, the user or the machine? Despite these ethical grey areas, the technology is undeniably fun to play with. It allows us to visualise the impossible, [5] as a city made of cheese or a cat playing poker. It blurs the line [6] reality and fantasy. Whether it will replace human artists is [7] to be seen. However, it has certainly opened [8] a new frontier in digital creativity.",
        "answers": { "1": "WITHOUT/LACKING", "2": "OTHER", "3": "ON/USING/WITH", "4": "WHO", "5": "SUCH", "6": "BETWEEN", "7": "YET", "8": "UP" }
    },
    {
        "id": "C2_01",
        "level": "C2",
        "title": "The Nature of Memory",
        "content": "Memory is often likened to a video recorder, faithfully capturing events as they happen. However, this analogy could not be further from the [1] . In reality, memory is a reconstructive process, prone to error and manipulation. Every time we recall a memory, we are effectively rewriting it, adding current emotions and knowledge to the original event. This explains [2] two people can witness the same incident yet describe it in contradictory terms. Furthermore, our memories are heavily influenced by suggestion. Studies have shown that it is possible to implant entirely false memories in people's minds simply [3] asking leading questions. This malleability of memory has serious implications, particularly in the legal system, where eyewitness testimony is often held [4] high regard. [5] it not for corroborating evidence, innocent people could be convicted based on false recollections. We must therefore treat memory with caution. It is [6] so much a record of the past, but rather a story we tell ourselves in the present. To rely on it implicitly is to [7] a risk. We are, to all intents and [8] , unreliable narrators of our own lives.",
        "answers": { "1": "TRUTH", "2": "WHY", "3": "BY", "4": "IN", "5": "WERE", "6": "NOT", "7": "TAKE", "8": "PURPOSES" }
    },
    {
        "id": "C2_02",
        "level": "C2",
        "title": "The Art of Translation",
        "content": "Translation is rarely a straightforward process of substituting one word for another. If it [1] , computers would have replaced humans long ago. The true challenge lies not in the vocabulary, [2] in conveying the cultural nuance and tone of the original text. A translator must be [3] parts linguist and writer, capable of dismantling a sentence and rebuilding it in a new form without losing its soul. Idioms, in particular, pose a significant hurdle; a phrase that resonates in one language may sound nonsensical in [4] . For instance, poetry is often deemed 'untranslatable' because the sound and rhythm are just as important as the meaning. [5] attempts have been made to automate this process, the results often lack the subtlety of a human touch. A poor translation can alter the entire reception of a novel, sometimes [6] the extent that the author's original voice is lost. Therefore, we should not underestimate the skill involved. It is a task that requires [7] no means a small amount of creativity. Ultimately, translation is the bridge that allows ideas to cross borders [8] hindrance.",
        "answers": { "1": "WERE", "2": "BUT", "3": "EQUAL", "4": "ANOTHER", "5": "WHILE", "6": "TO", "7": "BY", "8": "WITHOUT" }
    },
    {
        "id": "C2_03",
        "level": "C2",
        "title": "Citizen Science",
        "content": "The term 'citizen science' refers to the involvement of the general public in data collection for scientific projects. Historically, science was the preserve of the elite, but the digital age has democratised the field to an extent previously [1] of. Today, ordinary people can contribute to complex studies by tracking bird migrations or classifying galaxies online. This massive workforce allows scientists to process data at a speed that would otherwise be impossible. [2] from being a cost-cutting exercise, this collaboration fosters a deeper public understanding of scientific methods. However, concerns have been [3] regarding the quality of data collected by amateurs. Can a hobbyist be relied upon to be as rigorous as a professional? To mitigate this, strict verification protocols are put [4] place. The consensus is that the benefits far outweigh the risks. Had it not been [5] citizen scientists, many recent environmental changes might have gone unnoticed. It serves [6] a reminder that we all have a stake in understanding our world. We should [7] no account dismiss the contributions of the enthusiast. Science is, after [8] , a collective endeavour.",
        "answers": { "1": "UNDREAMED", "2": "FAR", "3": "RAISED", "4": "IN", "5": "FOR", "6": "AS", "7": "ON", "8": "ALL" }
    },
    {
        "id": "C2_04",
        "level": "C2",
        "title": "Restoring Old Masterpieces",
        "content": "Art restoration is a delicate and controversial field. The goal is to preserve a work of art for future generations, but the question of [1] far to intervene is fiercely debated. Over centuries, varnish creates a yellow tint, obscuring the artist's original colours. Removing this layer can reveal vibrancy that shocks the public, often leading [2] accusations that the restorer has 'ruined' the painting. The cleaning of the Sistine Chapel, for instance, was met with [3] praise and outrage. Critics argued that the shadows had been scrubbed away, leaving the figures looking flat. Restorers, however, maintained they were simply revealing Michelangelo's true intent. The process is irreversible; [4] the varnish is removed, it cannot be put back. Consequently, modern restorers operate under the principle of 'minimum intervention'. They use materials that are reversible, ensuring that [5] future technologies offer better solutions, their work can be undone. It is a balancing act between preservation and aesthetics. One must tread [6] caution. Ultimately, the restorer is a ghost, whose work is successful only [7] it remains invisible. Their role is to serve the artist, [8] than their own ego.",
        "answers": { "1": "HOW", "2": "TO", "3": "BOTH", "4": "ONCE", "5": "SHOULD", "6": "WITH", "7": "IF", "8": "RATHER" }
    },
    {
        "id": "C2_05",
        "level": "C2",
        "title": "The Decline of Silence",
        "content": "In our hyper-connected world, true silence has become a rare commodity. We are bombarded by a constant stream of notifications, traffic, and background music, to the [1] where silence can feel unsettling. Yet, silence is essential for cognitive regeneration. Research indicates that the brain requires periods of quiet to consolidate memory and emotion. Without it, we exist in a state of chronic cognitive load, unable to think deeply or creatively. It is [2] wonder that practices like meditation are surging in popularity. We are seemingly desperate to reclaim a sense of peace. Some have gone so [3] as to pay for 'silent retreats', where speech is forbidden for days. It seems paradoxical that we must pay for something that was once free and abundant. [4] doubt, technology has brought many benefits, but it has also eroded the boundaries of our private mental space. Unless we make a conscious effort to disconnect, we risk losing the ability to be alone with our thoughts. We must carve [5] moments of stillness in our day. [6] is at stake is nothing less than our mental health. Silence is not empty; it is full [7] answers. We need only listen [8] them.",
        "answers": { "1": "POINT", "2": "NO", "3": "FAR", "4": "NO", "5": "OUT", "6": "WHAT", "7": "OF", "8": "TO" }
    },
    {
        "id": "C2_06_XMAS",
        "level": "C2",
        "title": "The Winter Solstice and Christmas",
        "content": "The placement of Christmas in late December is no coincidence; it aligns almost perfectly with the winter solstice. For ancient cultures, this was a pivotal time, marking the shortest day and the turning [1] towards the return of the sun. The Romans celebrated Saturnalia, a riotous festival of overturning social norms, [2] which slaves were served by their masters. Many customs we associate with Christmas, such as greenery and feasting, have their [3] in these pagan observances. The church, rather than suppressing these deep-rooted traditions, opted to co-opt them. By assigning the birth of Christ to this date, they ensured a smoother transition for converts. Thus, Christmas is a hybrid festival, a tapestry woven from various threads of history. [4] the theological significance is paramount for believers, the underlying rhythm is one of seasonal renewal. It speaks to a primal human need to find light in the darkness. Even in our secular age, this urge remains [5] strong as ever. We gather, we light fires, and we feast, just [6] our ancestors did. It is a celebration of survival [7] much as faith. The solstice reminds us that even the longest night must [8] way to dawn.",
        "answers": { "1": "POINT", "2": "DURING/IN", "3": "ROOTS/ORIGINS", "4": "WHILE/ALTHOUGH/WHILST", "5": "AS", "6": "AS/LIKE", "7": "AS", "8": "GIVE" }
    },
    {
        "id": "C2_07_AIR",
        "level": "C2",
        "title": "The Future of Flight",
        "content": "Aviation stands on the precipice of a major transformation. For decades, the focus was purely on speed and capacity, but the climate crisis has shifted the paradigm entirely. The industry is under immense pressure to decarbonise, a task [1] is easier said than done. Electric batteries, while promising for short hops, are currently too heavy for long-haul flights. Hydrogen offers a potential solution, yet the infrastructure required to support it is virtually non-existent. [2] technological hurdles, there is the issue of cost. Green aviation will almost certainly come with a higher price tag, potentially ending the era of cheap mass tourism. We may see a return to a time when flying was a rare luxury. Furthermore, the concept of supersonic travel is experiencing a renaissance. New designs promise to muffle the sonic boom, [3] overland flights feasible. However, this seems at [4] with the sustainability agenda. The industry must thread a needle between innovation and responsibility. [5] we can reconcile our desire to travel with the health of the planet is the defining question. Radical change is not just desirable; it is [6] . The skies of tomorrow will look very different [7] those of today. We must brace ourselves for [8] turbulence ahead.",
        "answers": { "1": "WHICH/THAT", "2": "BESIDES/DESPITE", "3": "MAKING", "4": "ODDS", "5": "WHETHER/HOW", "6": "IMPERATIVE/ESSENTIAL/UNAVOIDABLE", "7": "FROM/TO", "8": "SOME" }
    },
    {
        "id": "C2_08_SCOOT",
        "level": "C2",
        "title": "Micromobility and the City",
        "content": "The proliferation of dockless electric scooters represents a paradigm shift in urban micromobility. Ostensibly, they offer a panacea for the 'last mile' problem, bridging the [1] between public transport hubs and final destinations. Advocates laud them for reducing reliance on private cars and lowering emissions. However, their integration into the urban fabric has been anything [2] seamless. The haphazard abandonment of vehicles on thoroughfares constitutes a significant nuisance, particularly for the visually impaired. Furthermore, the legal status of riders often occupies a grey area, complicating liability in the [3] of accidents. City planners are scrambling to retrofit infrastructure that was never designed with such devices in [4] . We are witnessing a clash between disruptive technology and civic order. To ban them would be to stifle innovation, yet to allow them unfettered access is to invite chaos. A regulatory framework that balances safety [5] utility is urgently required. The scooter phenomenon forces us to reimagine who the streets belong to. They are a litmus test for our adaptability. Ultimately, the success of micromobility rests [6] our ability to foster a culture of mutual respect. Until then, the pavement remains a battleground. It is a bumpy ride in [7] respects than one.",
        "answers": { "1": "GAP", "2": "BUT", "3": "EVENT", "4": "MIND", "5": "WITH/AND", "6": "ON/UPON", "7": "MORE" }
    },
    {
        "id": "C2_09_BIRD",
        "level": "C2",
        "title": "Synanthropes: Wildlife in the Concrete Jungle",
        "content": "We tend to view cities as devoid of nature, yet a specific class of animals, known as synanthropes, flourishes alongside us. The Ring-necked Parakeet in London is a prime example. Originally from the Himalayas, these birds have not merely survived in the urban sprawl; they have [1] . Their success lies in their cognitive flexibility; they exploit our waste and our warmth. While their vibrant plumage is aesthetically pleasing, their presence is not without controversy. They are aggressive competitors, often displacing native species [2] nesting sites. This raises uncomfortable questions about what constitutes 'natural' in the Anthropocene. Are they invasive aliens to be culled, or pioneers to be admired? Our reaction to them reveals much about our own relationship with the environment. We appreciate nature [3] so long as it adheres to our rules. When it becomes noisy or messy, our tolerance wanes. Yet, these birds mirror our own success; they are adaptable, opportunistic, and loud. They are the ultimate urbanites. To wish them [4] is futile. We must learn to coexist with the biodiversity we have inadvertently created. The city is an ecosystem in its [5] right. We are not the [6] inhabitants.",
        "answers": { "1": "THRIVED", "2": "FROM", "3": "ONLY", "4": "AWAY", "5": "OWN", "6": "ONLY/SOLE" }
    },
    {
        "id": "C2_10_HEAT",
        "level": "C2",
        "title": "The Urban Heat Island Effect",
        "content": "As climatic patterns shift, our cities are becoming thermal traps, a phenomenon known as the Urban Heat Island effect. Concrete and asphalt absorb solar radiation by day and re-radiate it by night, preventing the city [1] cooling down. This creates a microclimate significantly hotter than the surrounding countryside. The implications for public health are profound, particularly for the vulnerable. We are facing a future where heatwaves are not anomalies [2] the norm. Architectural responses are evolving; green roofs and reflective surfaces are moving from niche to mainstream. However, mitigation is only half the battle; adaptation is equally crucial. We may see a restructuring of the working day, or a redesign of public spaces to prioritise shade. The era of the glass-facade skyscraper, essentially a greenhouse, may well be [3] . We must build with the climate, not [4] it. The resilience of our urban centres depends on it. Water management, too, will become a defining issue of the century. We can no [5] take a temperate climate for granted. The city of the future must be a cool refuge. Failure to act will render large swathes of our urban environment [6] .",
        "answers": { "1": "FROM", "2": "BUT", "3": "OVER/ENDED", "4": "AGAINST", "5": "LONGER", "6": "UNINHABITABLE" }
    },
    {
        "id": "C2_11_AI",
        "level": "C2",
        "title": "Generative AI and Creativity",
        "content": "The advent of generative AI models capable of synthesizing images from textual prompts has precipitated an ontological crisis in the arts. For centuries, the act of creation was inextricably linked to human agency and technical skill. AI ruptures this link, allowing for the instantaneous manifestation of visual ideas. Proponents hail this as a liberation of imagination, a tool that transcends the [1] of manual dexterity. Detractors, however, view it as an existential threat, a commodification of the soul. The legal labyrinth regarding copyright is equally complex; does an algorithm infringe on the rights of the artists whose work it digested? We are forced to interrogate the very definition of 'art'. Is it the process or the product that [2] ? If a machine can move us to tears, is the emotion any less valid? The genie is well and truly out of the [3] . Rather than resisting, we might be better served by exploring the new hybrid forms of creativity that emerge. It acts as a mirror, reflecting our collective visual culture back at us, often in distorted ways. It is a tool of infinite potential and [4] risk. We are the curators of this new synthetic reality.",
        "answers": { "1": "LIMITATIONS/CONSTRAINTS/LIMITS", "2": "MATTERS/COUNTS", "3": "BOTTLE", "4": "INHERENT/CONSIDERABLE" }
    }
]