[
    {
        "id": "B2_WF_01",
        "level": "B2",
        "title": "A Healthy Lifestyle",
        "content": "Living a healthy lifestyle is of vital [1] if you want to avoid illness. It is not just about eating fruit and vegetables; regular [2] is also essential. Many people make the [3] of thinking they can eat whatever they want as long as they run occasionally. Unfortunately, this is [4] . A balanced diet is key. Furthermore, getting enough sleep is beneficial for your [5] well-being. If you are constantly tired, your [6] to concentrate will suffer. Finally, try to avoid [7] situations where possible. Stress can be extremely [8] to your health.",
        "answers": {
            "1": { "root": "IMPORTANT", "answer": "IMPORTANCE" },
            "2": { "root": "FIT", "answer": "FITNESS" },
            "3": { "root": "DECIDE", "answer": "DECISION" },
            "4": { "root": "CORRECT", "answer": "INCORRECT" },
            "5": { "root": "PSYCHOLOGY", "answer": "PSYCHOLOGICAL" },
            "6": { "root": "ABLE", "answer": "ABILITY" },
            "7": { "root": "STRESS", "answer": "STRESSFUL" },
            "8": { "root": "HARM", "answer": "HARMFUL" }
        }
    },
    {
        "id": "B2_WF_02",
        "level": "B2",
        "title": "The Job Interview",
        "content": "Going for a job interview can be a nerve-wracking experience. To increase your chances of [1] , you must prepare thoroughly. Dress [2] to make a good first impression. When answering questions, try to speak with [3] , even if you feel nervous inside. Employers are looking for [4] employees who can solve problems. It is also helpful to show [5] for the position. Ask intelligent questions about the [6] requirements of the role. If you are [7] , do not be disheartened. Ask for feedback so you can make an [8] next time.",
        "answers": {
            "1": { "root": "SUCCEED", "answer": "SUCCESS" },
            "2": { "root": "SMART", "answer": "SMARTLY" },
            "3": { "root": "CONFIDENT", "answer": "CONFIDENCE" },
            "4": { "root": "RELY", "answer": "RELIABLE" },
            "5": { "root": "ENTHUSIAST", "answer": "ENTHUSIASM" },
            "6": { "root": "DAY", "answer": "DAILY" },
            "7": { "root": "SUCCESS", "answer": "UNSUCCESSFUL" },
            "8": { "root": "IMPROVE", "answer": "IMPROVEMENT" }
        }
    },
    {
        "id": "B2_WF_03",
        "level": "B2",
        "title": "Extreme Weather",
        "content": "In recent years, there has been a significant increase in [1] weather events. Scientists believe that global [2] is largely to blame. We are seeing more [3] storms and floods than ever before. This causes massive [4] to homes and infrastructure. The [5] of sea levels is another major concern for coastal cities. Governments are trying to find a [6] to this crisis, but progress is slow. Individuals can also make a difference by reducing their [7] of energy. It is our [8] to protect the planet for future generations.",
        "answers": {
            "1": { "root": "DANGER", "answer": "DANGEROUS" },
            "2": { "root": "WARM", "answer": "WARMING" },
            "3": { "root": "POWER", "answer": "POWERFUL" },
            "4": { "root": "DESTROY", "answer": "DESTRUCTION" },
            "5": { "root": "RISE", "answer": "RISING" },
            "6": { "root": "SOLVE", "answer": "SOLUTION" },
            "7": { "root": "CONSUME", "answer": "CONSUMPTION" },
            "8": { "root": "RESPONSIBLE", "answer": "RESPONSIBILITY" }
        }
    },
    {
        "id": "B2_WF_04",
        "level": "B2",
        "title": "A Famous Musician",
        "content": "Ed Sheeran is one of the most [1] musicians in the world today. His rise to [2] was not instant; he spent years busking on the streets. He is known for his incredible [3] to write catchy songs. His [4] on stage is simple, often just him and a guitar, yet he captivates audiences. Despite his wealth, he remains surprisingly [5] by fame. He often supports [6] causes and gives money to charity. His fans love him for his [7] and down-to-earth nature. It is rare to find such a [8] artist who is also so humble.",
        "answers": {
            "1": { "root": "FAME", "answer": "FAMOUS" },
            "2": { "root": "STAR", "answer": "STARDOM" },
            "3": { "root": "ABLE", "answer": "ABILITY" },
            "4": { "root": "APPEAR", "answer": "APPEARANCE" },
            "5": { "root": "AFFECT", "answer": "UNAFFECTED" },
            "6": { "root": "VARY", "answer": "VARIOUS" },
            "7": { "root": "HONEST", "answer": "HONESTY" },
            "8": { "root": "TALENT", "answer": "TALENTED" }
        }
    },
    {
        "id": "B2_WF_05",
        "level": "B2",
        "title": "Learning Languages",
        "content": "Learning a foreign language can be highly [1] to your career. In today's global market, companies value [2] who can speak more than one language. It requires a lot of [3] and patience to master a new tongue. You need to memorise vocabulary and understand grammatical [4] . Listening to [5] speakers is one of the best ways to learn. Don't worry if your [6] is not perfect at first. The most important thing is communication. With [7] practice, you will eventually become fluent. It is definitely a [8] investment of your time.",
        "answers": {
            "1": { "root": "ADVANTAGE", "answer": "ADVANTAGEOUS" },
            "2": { "root": "EMPLOY", "answer": "EMPLOYEES" },
            "3": { "root": "DEDICATE", "answer": "DEDICATION" },
            "4": { "root": "CONSTRUCT", "answer": "CONSTRUCTIONS" },
            "5": { "root": "NATURE", "answer": "NATIVE" },
            "6": { "root": "PRONOUNCE", "answer": "PRONUNCIATION" },
            "7": { "root": "DAY", "answer": "DAILY" },
            "8": { "root": "VALUE", "answer": "VALUABLE" }
        }
    },
    {
        "id": "B2_RECIPE_BOOKS",
        "level": "B2",
        "title": "The Survival of the Cookbook",
        "content": "In an age of digital convenience, the continued [1] of the printed recipe book is somewhat surprising. While online recipes are free and accessible, many home cooks still prefer the [2] feel of a hardback volume. A well-written book offers clear [3] that are often easier to follow than scrolling through a screen with sticky fingers. Furthermore, internet recipes can sometimes be [4], leading to kitchen disasters. A good cookbook is seen as a [5] investment for anyone serious about food. Precise [6] are particularly crucial for baking, where chemistry matters. Reading a cookbook is [7] a more relaxing experience than staring at a tablet. For many, cooking from a physical book brings a sense of [8] that technology simply cannot replicate.",
        "answers": {
            "1": { "root": "SURVIVE", "answer": "SURVIVAL" },
            "2": { "root": "TRADITION", "answer": "TRADITIONAL" },
            "3": { "root": "INSTRUCT", "answer": "INSTRUCTIONS" },
            "4": { "root": "RELY", "answer": "UNRELIABLE" },
            "5": { "root": "VALUE", "answer": "VALUABLE" },
            "6": { "root": "MEASURE", "answer": "MEASUREMENTS" },
            "7": { "root": "BASIC", "answer": "BASICALLY" },
            "8": { "root": "SATISFY", "answer": "SATISFACTION" }
        }
    },
      {
    "id": "B2_HISTORY_BERLIN_WALL",
    "level": "B2",
    "title": "The Fall of the Berlin Wall",
    "content": "The fall of the Berlin Wall in 1989 was a momentous event in European history. For decades, the wall had been a symbol of [1] and separation. Its collapse represented the [2] of Germany and the end of the Cold War. On that famous night, thousands of people gathered at the wall, filled with [3] and excitement. It was an [4] moment for everyone watching around the world. Many people climbed the wall, celebrating a newly found [5] that had been denied to them for so long. The event happened relatively [6]; few political analysts had predicted it would happen so fast. Today, pieces of the wall serve as [7] that we must work to maintain peace. It remains one of the most [8] demonstrations of people power in history.",
    "answers": {
      "1": { "root": "DIVIDE", "answer": "DIVISION" },
      "2": { "root": "UNIT", "answer": "REUNIFICATION/UNITY" },
      "3": { "root": "HAPPY", "answer": "HAPPINESS" },
      "4": { "root": "FORGET", "answer": "UNFORGETTABLE" },
      "5": { "root": "FREE", "answer": "FREEDOM" },
      "6": { "root": "EXPECT", "answer": "UNEXPECTEDLY" },
      "7": { "root": "REMIND", "answer": "REMINDERS" },
      "8": { "root": "SUCCESS", "answer": "SUCCESSFUL" }
    }
  },
  {
    "id": "B2_REFUGEE_YUSRA",
    "level": "B2",
    "title": "A Swimmer's Journey",
    "content": "Yusra Mardini's story is one of incredible [1] and resilience. Fleeing conflict in Syria, she found herself in a [2] situation when their boat's engine failed in the Aegean Sea. Yusra and her sister jumped into the water and swam for hours to push the boat to [3]. Her actions saved the lives of 18 people. Later, she settled in Germany and returned to her training as a competitive [4]. Her talent led her to participate in the Olympics as part of the Refugee Team. She has become an [5] to millions of people worldwide. Yusra proves that despite [6] challenges, it is possible to rebuild your life. She now advocates for refugees and speaks [7] about the need for peace and [8] across borders.",
    "answers": {
      "1": { "root": "BRAVE", "answer": "BRAVERY" },
      "2": { "root": "DANGER", "answer": "DANGEROUS" },
      "3": { "root": "SAFE", "answer": "SAFETY" },
      "4": { "root": "SWIM", "answer": "SWIMMER" },
      "5": { "root": "INSPIRE", "answer": "INSPIRATION" },
      "6": { "root": "COUNT", "answer": "COUNTLESS" },
      "7": { "root": "PASSION", "answer": "PASSIONATELY" },
      "8": { "root": "FRIEND", "answer": "FRIENDSHIP" }
    }
  },
  {
    "id": "B2_SINGER_ADELE",
    "level": "B2",
    "title": "Adele's Rise to Fame",
    "content": "Adele is known globally for her powerful voice and emotional ballads. Her albums have achieved massive [1] success, breaking numerous records. Unlike many modern pop stars who rely on elaborate dance routines, Adele is famous for the [2] of her performances. She stands alone on stage, captivating audiences with her raw talent and [3]. Despite her fame, she is known for her [4] and down-to-earth attitude during interviews. However, early in her career, she suffered from severe [5] before going on stage. Over time, she has learned to manage these nerves. Her songs often explore themes of heartbreak and [6], resonating with listeners of all ages. She is undoubtedly one of the most [7] artists of her generation, yet she remains surprisingly [8] by celebrity culture.",
    "answers": {
      "1": { "root": "COMMERCE", "answer": "COMMERCIAL" },
      "2": { "root": "SIMPLE", "answer": "SIMPLICITY" },
      "3": { "root": "HONEST", "answer": "HONESTY" },
      "4": { "root": "KIND", "answer": "KINDNESS" },
      "5": { "root": "ANXIOUS", "answer": "ANXIETY" },
      "6": { "root": "LOSE", "answer": "LOSS" },
      "7": { "root": "INFLUENCE", "answer": "INFLUENTIAL" },
      "8": { "root": "AFFECT", "answer": "UNAFFECTED" }
    }
  },
  {
    "id": "B2_SLEEP_IMPORTANCE",
    "level": "B2",
    "title": "The Science of Sleep",
    "content": "We all know that sleeping is essential, but many people underestimate its true [1]. Scientists have shown that a good night's rest is vital for both physical and mental health. During sleep, the body repairs itself and the brain processes the events of the day. A lack of sleep can lead to an [2] to concentrate at work or school. It can also weaken the immune system, making people more [3] to illnesses. Furthermore, [4] show that people who sleep poorly are more likely to suffer from stress and depression. To improve sleep quality, experts recommend establishing a [5] routine and avoiding screens before bed. Creating a dark, quiet environment is also [6]. Surprisingly, short naps can be [7], but sleeping too much can actually be [8] to your health.",
    "answers": {
      "1": { "root": "IMPORTANT", "answer": "IMPORTANCE" },
      "2": { "root": "ABLE", "answer": "INABILITY" },
      "3": { "root": "SUSCEPT", "answer": "SUSCEPTIBLE" },
      "4": { "root": "SEARCH", "answer": "RESEARCHERS" },
      "5": { "root": "DAY", "answer": "DAILY" },
      "6": { "root": "HELP", "answer": "HELPFUL" },
      "7": { "root": "BENEFIT", "answer": "BENEFICIAL" },
      "8": { "root": "HARM", "answer": "HARMFUL" }
    }
  },
  {
    "id": "B2_HISTORY_RENAISSANCE",
    "level": "B2",
    "title": "The Renaissance",
    "content": "The Renaissance was a period of great cultural rebirth in Europe, bridging the Middle Ages and modern history. It was a time of incredible [1] in art, science, and literature. Famous [2] like Leonardo da Vinci and Michelangelo created masterpieces that are still admired today. The era also saw major [3] in science, such as the realization that the Earth revolves around the sun. This period encouraged [4] curiosity and the questioning of traditional ideas. The invention of the printing press was particularly [5], as it allowed information to spread quickly. Suddenly, knowledge was [6] to a much wider audience, not just the wealthy. This led to a significant increase in [7] rates across the continent. The impact of this era is still [8] in our modern educational systems.",
    "answers": {
      "1": { "root": "CREATE", "answer": "CREATIVITY" },
      "2": { "root": "PAINT", "answer": "PAINTERS" },
      "3": { "root": "DISCOVER", "answer": "DISCOVERIES" },
      "4": { "root": "INTELLECT", "answer": "INTELLECTUAL" },
      "5": { "root": "REVOLT", "answer": "REVOLUTIONARY" },
      "6": { "root": "ACCESS", "answer": "ACCESSIBLE" },
      "7": { "root": "LITERATE", "answer": "LITERACY" },
      "8": { "root": "VISIBLE", "answer": "VISIBLE" }
    }
  },
  {
    "id": "B2_REFUGEE_BUSINESS",
    "level": "B2",
    "title": "Building a New Future",
    "content": "When Ahmed arrived in his new country, he faced many difficulties. He was initially [1] and struggled to find work despite his engineering degree. However, Ahmed refused to be [2] by the rejection letters. He decided to start a small business repairing electronics. His [3] to succeed was evident to everyone who met him. Slowly, he built a reputation for providing [4] service and honest advice. The local community was very supportive, and he was deeply [5] for their help. Today, his company has ten employees and has grown [6]. Ahmed's story demonstrates that with hard work and a bit of luck, the [7] to start over is real. He often gives speeches to encourage other newcomers not to feel [8] about their future.",
    "answers": {
      "1": { "root": "EMPLOY", "answer": "UNEMPLOYED" },
      "2": { "root": "COURAGE", "answer": "DISCOURAGED" },
      "3": { "root": "DETERMINE", "answer": "DETERMINATION" },
      "4": { "root": "RELY", "answer": "RELIABLE" },
      "5": { "root": "GRATEFUL", "answer": "GRATEFUL" },
      "6": { "root": "SIGNIFY", "answer": "SIGNIFICANTLY" },
      "7": { "root": "OPPORTUNE", "answer": "OPPORTUNITY" },
      "8": { "root": "HOPE", "answer": "HOPELESS" }
    }
  },
  {
    "id": "B2_SINGER_FREDDIE",
    "level": "B2",
    "title": "A Rock Legend",
    "content": "Freddie Mercury is remembered as one of the greatest rock stars in history. His [1] stage presence and unique voice set him apart from other singers. As the lead vocalist of Queen, he wrote many [2] hits that are still played on the radio today. Freddie was known for his [3] costumes and his ability to connect with huge crowds. His performance at Live Aid is often voted the best live gig of all time. Despite his flamboyant public persona, he was [4] quite shy in his private life. His premature [5] in 1991 shocked the world, but his legacy lives on. The band's music continues to grow in [6], reaching new generations of fans. There have been many [7] of his songs, but none compare to the originals. He was truly an [8] artist.",
    "answers": {
      "1": { "root": "MAGNET", "answer": "MAGNETIC" },
      "2": { "root": "MEMORY", "answer": "MEMORABLE" },
      "3": { "root": "THEATRE", "answer": "THEATRICAL" },
      "4": { "root": "ACTUAL", "answer": "ACTUALLY" },
      "5": { "root": "DIE", "answer": "DEATH" },
      "6": { "root": "POPULAR", "answer": "POPULARITY" },
      "7": { "root": "INTERPRET", "answer": "INTERPRETATIONS" },
      "8": { "root": "REPLACE", "answer": "IRREPLACEABLE" }
    }
  },
  {
    "id": "B2_SLEEP_NAPPING",
    "level": "B2",
    "title": "The Power of Napping",
    "content": "In many cultures, taking a short nap in the afternoon is a common practice. However, in some busy societies, sleeping during the day is seen as a sign of [1]. This is a mistake, as research suggests that napping can actually boost [2] and alertness. A short rest of 20 minutes can make you feel more [3] and ready to tackle the rest of the day. It is important not to sleep for too long, though, as this can lead to feeling groggy and [4]. Also, napping too late in the day might make it [5] to fall asleep at night. For students, a power nap can be particularly effective before revision, helping to improve [6] and memory retention. It is a [7] way to recharge your batteries without caffeine. So, don't feel guilty about that afternoon rest; it might be exactly what your body [8] needs.",
    "answers": {
      "1": { "root": "LAZY", "answer": "LAZINESS" },
      "2": { "root": "PRODUCT", "answer": "PRODUCTIVITY" },
      "3": { "root": "ENERGY", "answer": "ENERGETIC" },
      "4": { "root": "CONFUSE", "answer": "CONFUSED" },
      "5": { "root": "POSSIBLE", "answer": "IMPOSSIBLE" },
      "6": { "root": "CONCENTRATE", "answer": "CONCENTRATION" },
      "7": { "root": "NATURE", "answer": "NATURAL" },
      "8": { "root": "TRUE", "answer": "TRULY" }
    }
  },
  {
    "id": "B2_HISTORY_ERASMUS",
    "level": "B2",
    "title": "The Erasmus Programme",
    "content": "One of the most positive developments in recent European history is the Erasmus programme. Established in 1987, it allows university [1] to study in another European country for a semester or a year. The main aim is to promote cultural [2] and personal growth among young people. Living abroad helps students become more [3] and confident. They learn to adapt to new environments and often overcome language [4]. The experience is also highly valued by employers, who look for candidates with international experience. Although there can be [5] challenges involved in living abroad, the EU provides grants to help cover costs. Since its inception, millions have participated, leading to countless cross-border [6] and marriages. It has [7] strengthened the sense of a shared European identity. The programme is widely regarded as a huge [8].",
    "answers": {
      "1": { "root": "STUDY", "answer": "STUDENTS" },
      "2": { "root": "AWARE", "answer": "AWARENESS" },
      "3": { "root": "DEPEND", "answer": "INDEPENDENT" },
      "4": { "root": "DIFFICULT", "answer": "DIFFICULTIES" },
      "5": { "root": "FINANCE", "answer": "FINANCIAL" },
      "6": { "root": "RELATION", "answer": "RELATIONSHIPS" },
      "7": { "root": "DOUBT", "answer": "UNDOUBTEDLY" },
      "8": { "root": "SUCCEED", "answer": "SUCCESS" }
    }
  },
  {
    "id": "B2_SINGER_ED_SHEERAN",
    "level": "B2",
    "title": "From Busker to Superstar",
    "content": "Ed Sheeran's career path is a great example of perseverance. He started as a street performer, playing his guitar for small crowds of [1]. He slept on friends' sofas and traveled the country, driven by his [2] to succeed in the music industry. His breakthrough came when he released an independent EP which gained attention without any major label support. Ed is known for his [3] lyrics and catchy melodies. Unlike many stars, he often appears [4] dressed on stage, wearing just jeans and a t-shirt. This lack of pretension has made him extremely [5] with fans. He has won multiple awards and his tours sell out [6]. Critics praise his ability to control a stadium crowd using only a loop pedal. It is [7] to deny that he is one of the most talented [8] of the decade.",
    "answers": {
      "1": { "root": "STRANGE", "answer": "STRANGERS" },
      "2": { "root": "AMBITIOUS", "answer": "AMBITION" },
      "3": { "root": "MEANING", "answer": "MEANINGFUL" },
      "4": { "root": "CASUAL", "answer": "CASUALLY" },
      "5": { "root": "LIKE", "answer": "LIKABLE/LIKEABLE" },
      "6": { "root": "INSTANT", "answer": "INSTANTLY" },
      "7": { "root": "USE", "answer": "USELESS" },
      "8": { "root": "MUSIC", "answer": "MUSICIANS" }
    }
  },
    {
        "id": "C1_WF_01",
        "level": "C1",
        "title": "Modern Architecture",
        "content": "The skyline of London has changed [1] over the last twenty years. Traditional stone buildings now stand alongside [2] skyscrapers made of glass and steel. This juxtaposition is often controversial. Critics argue that the new towers [3] the historic character of the city. However, supporters claim they are a symbol of economic [4] . One issue is the [5] of affordable housing in the city centre. Developers often prioritise luxury apartments, which are [6] to the average worker. There is a need for more [7] planning to ensure the city serves all its residents. We must find a balance between preservation and [8] .",
        "answers": {
            "1": { "root": "DRAMA", "answer": "DRAMATICALLY" },
            "2": { "root": "IMPRESS", "answer": "IMPRESSIVE" },
            "3": { "root": "SHADOW", "answer": "OVERSHADOW" },
            "4": { "root": "INVEST", "answer": "INVESTMENTS" },
            "5": { "root": "SHORT", "answer": "SHORTAGE" },
            "6": { "root": "AFFORD", "answer": "UNAFFORDABLE" },
            "7": { "root": "THINK", "answer": "THOUGHTFUL" },
            "8": { "root": "MODERN", "answer": "MODERNISATION/MODERNIZATION" }
        }
    },
    {
        "id": "C1_WF_02",
        "level": "C1",
        "title": "Space Tourism",
        "content": "The idea of holidaying in space was once pure science fiction, but it is fast becoming a [1] . Several private companies are competing to offer suborbital flights to [2] tourists. The cost, however, is currently [3] , meaning only the super-rich can afford it. Safety is another major concern; space travel is inherently [4] . Critics argue that the environmental impact [5] the benefits. Despite these objections, the industry is moving forward. Proponents argue that it will drive [6] innovation that benefits everyone. Whether it becomes a mainstream activity remains [7] . For now, it remains the playground of the [8] elite.",
        "answers": {
            "1": { "root": "REAL", "answer": "REALITY" },
            "2": { "root": "ADVENTURE", "answer": "ADVENTURERS" },
            "3": { "root": "ASTRONOMY", "answer": "ASTRONOMICAL" },
            "4": { "root": "HAZARD", "answer": "HAZARDOUS" },
            "5": { "root": "WEIGH", "answer": "OUTWEIGHS" },
            "6": { "root": "TECHNOLOGY", "answer": "TECHNOLOGICAL" },
            "7": { "root": "DOUBT", "answer": "DOUBTFUL" },
            "8": { "root": "PRIVILEGE", "answer": "PRIVILEGED" }
        }
    },
    {
        "id": "C1_WF_03",
        "level": "C1",
        "title": "The Psychology of Colour",
        "content": "Colour plays a significant role in our daily lives, influencing our mood and [1] . Marketing companies spend millions researching the [2] effects of packaging colours. For instance, red is often used to signal urgency or hunger, which is why it is common in fast-food logos. Blue, on the other hand, creates a sense of [3] and trust. However, our reactions to colour can be subjective and culturally [4] . In some cultures, white is associated with weddings, while in others it signifies mourning. Therefore, global brands must be [5] when launching products abroad. Using the wrong colour could lead to [6] of the brand message. Understanding these nuances is [7] for any designer. It is a fascinating field of [8] .",
        "answers": {
            "1": { "root": "PERCEIVE", "answer": "PERCEPTIONS" },
            "2": { "root": "CONSCIOUS", "answer": "SUBCONSCIOUS" },
            "3": { "root": "TRANQUIL", "answer": "TRANQUILITY" },
            "4": { "root": "DEPEND", "answer": "DEPENDENT" },
            "5": { "root": "CAUTION", "answer": "CAUTIOUS" },
            "6": { "root": "INTERPRET", "answer": "MISINTERPRETATIONS" },
            "7": { "root": "ESSENCE", "answer": "ESSENTIAL" },
            "8": { "root": "INVESTIGATE", "answer": "INVESTIGATION" }
        }
    },
    {
        "id": "C1_WF_04",
        "level": "C1",
        "title": "Sleep Deprivation",
        "content": "In our fast-paced society, sleep is often undervalued. Many people view it as a luxury rather than a biological [1] . However, chronic sleep deprivation can have severe consequences. It leads to a reduction in cognitive function, making [2] difficult. It also weakens the immune system, leaving us [3] to infections. Furthermore, there is a strong link between lack of sleep and emotional [4] . People who are tired are more prone to anxiety and irritability. Employers are beginning to realise that well-rested staff are more [5] . Some companies even encourage napping during the day. It is [6] to think we can function effectively without rest. We must prioritise sleep to avoid [7] . It is the foundation of a healthy [8] .",
        "answers": {
            "1": { "root": "NECESSARY", "answer": "NECESSITY" },
            "2": { "root": "DECIDE", "answer": "DECISIONS" },
            "3": { "root": "DEFEND", "answer": "DEFENCELESS/DEFENSELESS" },
            "4": { "root": "STABLE", "answer": "INSTABILITY" },
            "5": { "root": "PRODUCE", "answer": "PRODUCTIVE" },
            "6": { "root": "LOGIC", "answer": "ILLOGICAL" },
            "7": { "root": "BURN", "answer": "BURNOUT" },
            "8": { "root": "EXIST", "answer": "EXISTENCE" }
        }
    },
    {
        "id": "C1_WF_05",
        "level": "C1",
        "title": "Renewable Energy",
        "content": "The transition away from fossil fuels is unavoidable. As oil reserves dwindle, the [1] of renewable energy sources becomes increasingly urgent. Solar and wind power have seen massive growth, but storage remains a [2] . Batteries are currently expensive and inefficient. However, scientists are optimistic about [3] breakthroughs in this area. Another challenge is the [4] of the grid infrastructure. We need a system capable of handling [5] in power supply. Despite these hurdles, the environmental argument is [6] . Climate change poses an [7] threat to our way of life. We must invest in green technology to ensure a [8] future.",
        "answers": {
            "1": { "root": "ADOPT", "answer": "ADOPTION" },
            "2": { "root": "LIMIT", "answer": "LIMITATION" },
            "3": { "root": "COME", "answer": "UPCOMING" },
            "4": { "root": "RELY", "answer": "RELIABILITY" },
            "5": { "root": "FLUCTUATE", "answer": "FLUCTUATIONS" },
            "6": { "root": "DENY", "answer": "UNDENIABLE" },
            "7": { "root": "EXIST", "answer": "EXISTENTIAL" },
            "8": { "root": "SUSTAIN", "answer": "SUSTAINABLE" }
        }
    },
      {
    "id": "C1_RECIPE_BOOKS",
    "level": "C1",
    "title": "Evolution of Recipe Writing",
    "content": "The style of recipe writing has [1] huge changes over the last century. Historically, recipes were vague, and the [2] of success depended entirely on the cook's instinct. Modern food writing, however, demands scientific [3] regarding temperatures and timings. Despite this, there are still occasional [4] in celebrity cookbooks which can frustrate amateur chefs. The true [5] of a classic cookbook lies in its ability to teach technique, not just list ingredients. The [6] of a dish often relies on how well the writer explains the process. While some predicted the death of the format, this theory has been [7] by rising sales. Today, the [8] of cuisines available in print form is truly staggering.",
    "answers": {
      "1": { "root": "GO", "answer": "UNDERGONE" },
      "2": { "root": "LIKELY", "answer": "LIKELIHOOD" },
      "3": { "root": "PRECISE", "answer": "PRECISION" },
      "4": { "root": "ACCURATE", "answer": "INACCURACIES" },
      "5": { "root": "STRONG", "answer": "STRENGTH" },
      "6": { "root": "COME", "answer": "OUTCOME" },
      "7": { "root": "PROVE", "answer": "DISPROVEN" },
      "8": { "root": "BROAD", "answer": "BREADTH" }
    }
  },
    {
    "id": "C1_HISTORY_FANTA_ORIGINS",
    "level": "C1",
    "title": "The Wartime Origins of Fanta",
    "content": "It is a little-known fact that the popular soft drink Fanta has its [1] in Nazi Germany. During World War II, a trade embargo made the syrup required for Coca-Cola [2] in the country. Facing a complete shutdown of operations, the head of Coca-Cola Deutschland decided to create a new beverage using only the ingredients available within Germany at the time. These were primarily leftovers from other food industries, including whey and apple fiber. The resulting drink was named 'Fanta', derived from the German word 'Fantasie', suggesting that its creation required significant [3]. Despite its unappealing ingredients, the drink became popular, largely out of [4] as other choices were scarce. Production ceased briefly after the war but was later revived. Today, the brand is recognizable worldwide, though its specific formula has undergone many [5] to suit local tastes. The [6] of the drink's history is often surprising to consumers. It serves as a reminder of how corporate [7] can emerge from even the most [8] historical circumstances.",
    "answers": {
      "1": { "root": "BEGIN", "answer": "BEGINNINGS" },
      "2": { "root": "AVAILABLE", "answer": "UNAVAILABLE" },
      "3": { "root": "IMAGINE", "answer": "IMAGINATION" },
      "4": { "root": "NECESSARY", "answer": "NECESSITY" },
      "5": { "root": "ALTER", "answer": "ALTERATIONS" },
      "6": { "root": "REVEAL", "answer": "REVELATION" },
      "7": { "root": "SURVIVE", "answer": "SURVIVAL" },
      "8": { "root": "FAVOUR", "answer": "UNFAVOURABLE" }
    }
  },
  {
    "id": "C1_HISTORY_MARSHALL_PLAN",
    "level": "C1",
    "title": "The Recovery of Europe",
    "content": "Following the devastation of World War II, Europe faced an unprecedented economic crisis. The Marshall Plan, initiated in 1948, was designed to address the widespread [1] and political chaos threatening the continent. The program provided over $12 billion in aid to Western European economies, aiming to remove trade barriers and modernize industry. This massive injection of capital helped to [2] democratic institutions that were at risk of collapsing. Critics at the time argued it would lead to American [3] of European markets, but the results spoke for themselves. The plan oversaw the [4] of industrial production and agricultural output. By the early 1950s, the region had witnessed a miraculous recovery, moving from [5] to prosperity. The project is often cited as a prime example of international cooperation overcoming [6]. Its success laid the groundwork for the eventual formation of the European Union, fostering a period of [7] peace and stability. The [8] of this initiative cannot be overstated.",
    "answers": {
      "1": { "root": "STABLE", "answer": "INSTABILITY" },
      "2": { "root": "STRONG", "answer": "STRENGTHEN" },
      "3": { "root": "DOMINATE", "answer": "DOMINANCE/DOMINATION" },
      "4": { "root": "NEW", "answer": "RENEWAL" },
      "5": { "root": "AUSTERE", "answer": "AUSTERITY" },
      "6": { "root": "HOSTILE", "answer": "HOSTILITY/HOSTILITIES" },
      "7": { "root": "BREAK", "answer": "UNBROKEN" },
      "8": { "root": "SIGNIFY", "answer": "SIGNIFICANCE" }
    }
  },
  {
    "id": "C1_REFUGEE_ENTREPRENEUR",
    "level": "C1",
    "title": "A Visionary Newcomer",
    "content": "When Elias fled his war-torn homeland, he left behind a successful career in architecture. Arriving in the UK with nothing, he initially faced [1] from potential employers who did not recognize his qualifications. Undeterred, he accepted menial jobs while learning the language, displaying characteristic [2]. He noticed a gap in the market for sustainable, low-cost housing materials and began experimenting with recycled plastics. His [3] approach caught the eye of investors, though many were initially [4] of his bold claims. However, Elias proved them wrong. His company has since developed a revolutionary brick that is both durable and eco-friendly. His rise from refugee to CEO is a testament to the [5] of the human spirit. He now runs a foundation dedicated to the [6] of displaced professionals into the workforce. He argues passionately that refugees are an [7] resource for any economy. His achievements have been [8] acknowledged by industry leaders.",
    "answers": {
      "1": { "root": "REJECT", "answer": "REJECTION" },
      "2": { "root": "PERSIST", "answer": "PERSISTENCE" },
      "3": { "root": "INNOVATE", "answer": "INNOVATIVE" },
      "4": { "root": "DOUBT", "answer": "DOUBTFUL" },
      "5": { "root": "RESILE", "answer": "RESILIENCE" },
      "6": { "root": "INTEGRATE", "answer": "INTEGRATION" },
      "7": { "root": "TAP", "answer": "UNTAPPED" },
      "8": { "root": "WIDE", "answer": "WIDELY" }
    }
  },
  {
    "id": "C1_SINGER_BOWIE",
    "level": "C1",
    "title": "The Chameleon of Pop",
    "content": "David Bowie was far more than just a singer; he was a cultural phenomenon whose career spanned five decades. Known for his [1] to stagnation, Bowie constantly reinvented his persona, moving seamlessly between genres. From the alien Ziggy Stardust to the polished soul singer of the 80s, his visual transformations were as important as his music. This [2] meant that he remained relevant long after his contemporaries had faded. Critics praised the [3] of his lyrics, which often dealt with alienation and fame. While some dismissed his style as superficial, others recognized the deep [4] and intellect behind his work. He was famously [5] of social norms, often blurring the lines of gender and sexuality. His influence on fashion and art is [6]. Even in his final album, released days before his death, he offered a poignant [7] on mortality. Bowie remains an enduring symbol of artistic [8].",
    "answers": {
      "1": { "root": "REFUSE", "answer": "REFUSAL" },
      "2": { "root": "PREDICT", "answer": "UNPREDICTABILITY" },
      "3": { "root": "COMPLEX", "answer": "COMPLEXITY" },
      "4": { "root": "SENSITIVE", "answer": "SENSITIVITY" },
      "5": { "root": "RESPECT", "answer": "DISRESPECTFUL" },
      "6": { "root": "DENY", "answer": "UNDENIABLE" },
      "7": { "root": "REFLECT", "answer": "REFLECTION" },
      "8": { "root": "FEAR", "answer": "FEARLESSNESS" }
    }
  },
  {
    "id": "C1_SLEEP_DEPRIVATION",
    "level": "C1",
    "title": "The Cost of Sleeplessness",
    "content": "In our fast-paced society, sleep is often viewed as a luxury rather than a biological imperative. However, chronic sleep deprivation has profound [1] consequences. Beyond simple tiredness, a lack of sleep impairs cognitive function, leading to a significant drop in productivity. Research indicates that tired individuals are prone to [2] behavior and struggle with emotional regulation. The [3] of long-term risks is alarming, including links to heart disease and diabetes. Furthermore, the brain's ability to clear out toxic proteins is [4] hindered without sufficient rest. Many people suffer from [5] insomnia, yet fail to seek medical help, relying instead on caffeine or medication. This [6] on artificial stimulants can create a vicious cycle of fatigue. Experts warn that we must not [7] the body's need for recovery. Prioritizing sleep is arguably the single most effective [8] measure for maintaining good health.",
    "answers": {
      "1": { "root": "PSYCHOLOGY", "answer": "PSYCHOLOGICAL" },
      "2": { "root": "RATIONAL", "answer": "IRRATIONAL" },
      "3": { "root": "SEVERE", "answer": "SEVERITY" },
      "4": { "root": "DRAMA", "answer": "DRAMATICALLY" },
      "5": { "root": "DIAGNOSE", "answer": "UNDIAGNOSED" },
      "6": { "root": "RELY", "answer": "RELIANCE" },
      "7": { "root": "ESTIMATE", "answer": "UNDERESTIMATE" },
      "8": { "root": "PREVENT", "answer": "PREVENTATIVE/PREVENTIVE" }
    }
  },
  {
    "id": "C1_HISTORY_VELVET_REV",
    "level": "C1",
    "title": "The Velvet Revolution",
    "content": "The Velvet Revolution of 1989 in Czechoslovakia stands as a powerful example of non-violent political change. It began as a student march but quickly grew into a massive demonstration against the one-party government. The police response was brutal, yet the protesters remained remarkably [1]. Their refusal to engage in violence completely undermined the regime's authority. Within days, the number of protesters had grown [2], filling the streets of Prague. The dissidents, led by playwright Vaclav Havel, formed a coalition to negotiate the government's [3]. The speed of the regime's collapse was [4]; few had foreseen such a rapid transfer of power. Havel, who had previously faced [5] for his views, was elected president shortly after. The revolution demonstrated the [6] of civil resistance in the face of tyranny. It marked the [7] end of 41 years of communist rule. The transition to democracy was [8] smooth compared to other nations in the region.",
    "answers": {
      "1": { "root": "AGGRESS", "answer": "NONAGGRESSIVE/UNAGGRESSIVE" },
      "2": { "root": "EXPONENT", "answer": "EXPONENTIALLY" },
      "3": { "root": "RESIGN", "answer": "RESIGNATION" },
      "4": { "root": "ASTONISH", "answer": "ASTONISHING" },
      "5": { "root": "PRISON", "answer": "IMPRISONMENT" },
      "6": { "root": "EFFECT", "answer": "EFFECTIVENESS" },
      "7": { "root": "DECIDE", "answer": "DECISIVE" },
      "8": { "root": "COMPARE", "answer": "COMPARATIVELY" }
    }
  },
  {
    "id": "C1_REFUGEE_WRITER",
    "level": "C1",
    "title": "Finding a Voice in Exile",
    "content": "Nabokov once wrote that 'my private tragedy is that I had to abandon my natural idiom'. For many refugee writers, the loss of their native language is a source of deep [1]. Yet, some manage to master their adopted tongue with [2] skill. Writing in a second language requires an intense level of [3] and precision. It forces the author to weigh every word, often resulting in a unique stylistic [4]. These writers often offer fresh perspectives on their new societies, observing cultural nuances that locals might overlook. Their stories frequently explore themes of displacement and the [5] to belong. Despite the [6] of the publishing industry to translate foreign works, immigrant voices are becoming louder. Their contribution enriches the literary landscape, adding [7] and diversity. Ultimately, literature serves as a bridge, making the experiences of the marginalized [8] to the wider public.",
    "answers": {
      "1": { "root": "GRIEVE", "answer": "GRIEF" },
      "2": { "root": "ORDINARY", "answer": "EXTRAORDINARY" },
      "3": { "root": "ACCURATE", "answer": "ACCURACY" },
      "4": { "root": "CLEAR", "answer": "CLARITY" },
      "5": { "root": "YEARN", "answer": "YEARNING" },
      "6": { "root": "RELUCT", "answer": "RELUCTANCE" },
      "7": { "root": "DEEP", "answer": "DEPTH" },
      "8": { "root": "ACCESS", "answer": "ACCESSIBLE" }
    }
  },
  {
    "id": "C1_SINGER_NINA_SIMONE",
    "level": "C1",
    "title": "The High Priestess of Soul",
    "content": "Nina Simone was a musician of unparalleled talent and temperament. Trained as a classical pianist, she was denied a scholarship to a prestigious institute, a rejection she attributed to racial [1]. This injustice fueled her lifelong commitment to civil rights activism. Her music was a fusion of jazz, blues, and classical styles, characterized by her [2] deep voice. Simone was known for her emotional honesty; she could be tender one moment and furious the next. She was [3] regarding her political views, often using her platform to challenge the status quo. Her songs became anthems for the movement, expressing the collective [4] of a generation. Despite her professional success, she struggled with mental health issues and a volatile personal life. Her relationship with audiences was often [5]; she would scold them for talking during her sets. Yet, her [6] contributions to music are undeniable. She remains an [7] figure who refused to be [8] by the expectations of her time.",
    "answers": {
      "1": { "root": "JUDGE", "answer": "PREJUDICE" },
      "2": { "root": "DISTINCT", "answer": "DISTINCTIVELY" },
      "3": { "root": "APOLOGY", "answer": "UNAPOLOGETIC" },
      "4": { "root": "RAGE", "answer": "OUTRAGE" },
      "5": { "root": "TUMULT", "answer": "TUMULTUOUS" },
      "6": { "root": "ART", "answer": "ARTISTIC" },
      "7": { "root": "ICON", "answer": "ICONIC" },
      "8": { "root": "CONFINEMENT", "answer": "CONFINED" }
    }
  },
  {
    "id": "C1_SLEEP_DREAMING",
    "level": "C1",
    "title": "The Logic of Dreams",
    "content": "The function of dreaming remains one of neuroscience's greatest mysteries. While we sleep, the brain enters a state of high activity, yet the body remains in a state of [1]. This prevents us from acting out our dreams and injuring ourselves. Dreams often appear [2], jumping between unrelated events and locations without explanation. However, psychologists suggest that this chaotic narrative serves a purpose: the [3] of emotional experiences. By replaying memories in a safe environment, the brain can reduce their emotional impact. Recurrent nightmares, however, may indicate [4] psychological distress or trauma. Interestingly, some individuals possess the ability to control their dreams, a phenomenon known as lucid dreaming. The [5] of this skill varies from person to person. Despite centuries of study, the [6] of dream interpretation remains a controversial topic. Sceptics argue that dreams are merely random neural firing, devoid of deeper meaning. Nevertheless, the [7] that our sleeping minds are hard at work is supported by [8] evidence.",
    "answers": {
      "1": { "root": "PARALYSE", "answer": "PARALYSIS" },
      "2": { "root": "LOGIC", "answer": "ILLOGICAL" },
      "3": { "root": "PROCESS", "answer": "PROCESSING" },
      "4": { "root": "RESOLVE", "answer": "UNRESOLVED" },
      "5": { "root": "LIKELY", "answer": "LIKELIHOOD" },
      "6": { "root": "VALID", "answer": "VALIDITY" },
      "7": { "root": "ASSUME", "answer": "ASSUMPTION" },
      "8": { "root": "SCIENCE", "answer": "SCIENTIFIC" }
    }
  },
  {
    "id": "C1_HISTORY_COFFEE_HOUSES",
    "level": "C1",
    "title": "The Penny Universities",
    "content": "In 17th and 18th century Europe, coffee houses played a pivotal role in social and political life. These establishments were dubbed 'Penny Universities' because for the price of a cup of coffee, one could engage in [1] debate with scholars and merchants. Unlike the rowdy taverns of the time, coffee houses were places of sobriety and [2] conversation. They became hubs for the exchange of news and [3] ideas, often alarming the authorities. Rulers frequently viewed these gatherings with [4], fearing sedition. King Charles II even attempted to ban them in 1675, citing the spread of false reports, but the public outcry forced him to withdraw the [5]. The coffee house culture fostered a new sphere of public opinion that was [6] of the state. It allowed for the circulation of journals and pamphlets, bypassing official [7]. This democratization of information was crucial in paving the way for the [8] movements that followed.",
    "answers": {
      "1": { "root": "INTELLECT", "answer": "INTELLECTUAL" },
      "2": { "root": "CONSTRUCT", "answer": "CONSTRUCTIVE" },
      "3": { "root": "REVOLT", "answer": "REVOLUTIONARY" },
      "4": { "root": "SUSPECT", "answer": "SUSPICION" },
      "5": { "root": "PROHIBIT", "answer": "PROHIBITION" },
      "6": { "root": "DEPEND", "answer": "INDEPENDENT" },
      "7": { "root": "CENSOR", "answer": "CENSORSHIP" },
      "8": { "root": "LIGHT", "answer": "ENLIGHTENMENT" }
    }
  },
  {
        "id": "C2_WF_01",
        "level": "C2",
        "title": "The Nature of Genius",
        "content": "What makes a genius? Is it an innate gift or the result of [1] hard work? Biographies of famous intellectuals often reveal a childhood marked by [2] precocity. However, talent alone is rarely enough. It must be paired with an [3] drive to succeed. Many geniuses display traits of eccentricity, often leading to social [4] . Their minds operate on a different plane, allowing them to make connections others miss. Yet, the line between genius and madness is [5] thin. History is littered with examples of brilliant minds plagued by mental illness. Society often views them with a mixture of awe and [6] . Perhaps true genius requires a certain [7] with the status quo. It is this refusal to accept accepted wisdom that leads to [8] discoveries.",
        "answers": {
            "1": { "root": "CEASE", "answer": "UNCEASING" },
            "2": { "root": "ORDINARY", "answer": "EXTRAORDINARY" },
            "3": { "root": "SHAKE", "answer": "UNSHAKEABLE/UNSHAKABLE" },
            "4": { "root": "ALIEN", "answer": "ALIENATION" },
            "5": { "root": "PERCEIVE", "answer": "IMPERCEPTIBLY" },
            "6": { "root": "SUSPECT", "answer": "SUSPICION" },
            "7": { "root": "SATISFY", "answer": "DISSATISFACTION" },
            "8": { "root": "PRECEDE", "answer": "UNPRECEDENTED" }
        }
    },
    {
        "id": "C2_WF_02",
        "level": "C2",
        "title": "Artificial Intelligence",
        "content": "The rise of Artificial Intelligence is arguably the most [1] development of our time. Its potential to revolutionise industries is vast, yet it raises profound ethical questions. The [2] of algorithms in decision-making processes is a growing concern. If an AI makes a biased decision, who is held [3] ? Furthermore, as machines become more capable, the [4] of human workers is called into question. We may face a future of mass unemployment unless we adapt. There is also the fear of the 'singularity', where AI surpasses human intelligence, leading to [5] consequences. Experts warn against [6] regarding these risks. We must ensure that AI development is aligned with human values. If we proceed [7] , we risk creating a tool we cannot control. The stakes could not be [8] .",
        "answers": {
            "1": { "root": "CONSEQUENCE", "answer": "CONSEQUENTIAL" },
            "2": { "root": "PERVADE", "answer": "PERVASIVENESS" },
            "3": { "root": "ACCOUNT", "answer": "ACCOUNTABLE" },
            "4": { "root": "DISPENSE", "answer": "DISPENSABILITY" },
            "5": { "root": "PREDICT", "answer": "UNPREDICTABLE" },
            "6": { "root": "COMPLACENT", "answer": "COMPLACENCY" },
            "7": { "root": "CHECK", "answer": "UNCHECKED" },
            "8": { "root": "MEASURE", "answer": "IMMEASURABLE" }
        }
    },
    {
        "id": "C2_WF_03",
        "level": "C2",
        "title": "Literary Criticism",
        "content": "Post-modernist literature is often characterised by its [1] and playfulness. It rejects the linear narratives of the past, preferring fragmentation and ambiguity. This can make it [2] to the casual reader. However, proponents argue that this complexity reflects the [3] nature of reality itself. By refusing to offer easy answers, these texts invite a deeper level of [4] . The author is no longer the sole authority; the reader becomes an active participant in meaning-making. This shift represents a [5] of the traditional hierarchy. Critics, however, often accuse the genre of being [6] self-indulgent. They claim it prioritises style over substance. Regardless of one's stance, its influence on contemporary fiction is [7] . It challenges us to rethink our [8] about what a story can be.",
        "answers": {
            "1": { "root": "PREDICT", "answer": "UNPREDICTABILITY" },
            "2": { "root": "ACCESS", "answer": "INACCESSIBILITY" },
            "3": { "root": "CHAOS", "answer": "CHAOTIC" },
            "4": { "root": "ENGAGE", "answer": "ENGAGEMENT" },
            "5": { "root": "STABLE", "answer": "DESTABILISATION/DESTABILIZATION" },
            "6": { "root": "EXCESS", "answer": "EXCESSIVELY" },
            "7": { "root": "DISPUTE", "answer": "INDISPUTABLE" },
            "8": { "root": "CONCEPT", "answer": "PRECONCEPTIONS" }
        }
    },
    {
        "id": "C2_WF_04",
        "level": "C2",
        "title": "Urban Exploration",
        "content": "Urban exploration, or 'urbex', involves investigating man-made structures, typically those which are abandoned. It is a hobby that exists on the [1] of legality. Explorers are drawn to the [2] beauty of decaying buildings. There is a sense of melancholy in witnessing the [3] of once-grand structures. Photographers capture the peeling paint and rusting metal, finding art in [4] . However, it is fraught with danger; rotting floors and asbestos are common hazards. Moreover, strict security measures can lead to [5] for trespassing. Despite the risks, the community is growing [6] . For many, it is an act of historical documentation, preserving the memory of places before they vanish [7] . It offers a glimpse into a world usually hidden from [8] .",
        "answers": {
            "1": { "root": "SKIRT", "answer": "OUTSKIRTS" },
            "2": { "root": "HAUNT", "answer": "HAUNTING" },
            "3": { "root": "INTEGRATE", "answer": "DISINTEGRATION" },
            "4": { "root": "SEE", "answer": "UNSEEN" },
            "5": { "root": "PROSECUTE", "answer": "PROSECUTION" },
            "6": { "root": "EXPONENT", "answer": "EXPONENTIALLY" },
            "7": { "root": "ENTIRE", "answer": "ENTIRELY" },
            "8": { "root": "LOOK", "answer": "ONLOOKERS" }
        }
    },
    {
        "id": "C2_WF_05",
        "level": "C2",
        "title": "The Philosophy of Time",
        "content": "Our perception of time is fundamentally [1] . We experience it as a linear flow, yet physics suggests this may be an illusion. Einstein's theory of relativity demonstrated that time is [2] , depending on speed and gravity. This concept is deeply [3] to the human mind, which craves order and sequence. Philosophers have long debated whether the past and future have any [4] existence, or if only the 'now' is real. If time is indeed an illusion, then our fear of mortality is [5] . However, living with such a perspective is practically impossible. We are bound by the [6] of our biology to perceive time passing. Memories serve as a [7] of who we are, anchoring us in a temporal narrative. Without this, our sense of self would likely undergo [8] .",
        "answers": {
            "1": { "root": "SUBJECT", "answer": "SUBJECTIVE" },
            "2": { "root": "FLEX", "answer": "FLEXIBLE" },
            "3": { "root": "SETTLE", "answer": "UNSETTLING" },
            "4": { "root": "OBJECT", "answer": "OBJECTIVE" },
            "5": { "root": "REVOKE", "answer": "IRREVOCABLE" },
            "6": { "root": "CONSTRAIN", "answer": "CONSTRAINTS" },
            "7": { "root": "VALID", "answer": "VALIDATION" },
            "8": { "root": "FRAGMENT", "answer": "FRAGMENTATION" }
        }
    },
      {
    "id": "C2_RECIPE_BOOKS",
    "level": "C2",
    "title": "Cookbooks as Cultural Artifacts",
    "content": "The [1] of the cookbook in modern publishing is a phenomenon worth analyzing. Despite the digital revolution, their [2] in the market is remarkable, suggesting they serve a purpose beyond mere utility. Recent years have seen [3] sales figures for high-end culinary volumes. Critics who argue [4] that print is dead fail to recognize the object's aesthetic value. The planned [5] of digital content contrasts with the permanence of a library collection. However, a common critique is the [6] of complex culinary techniques for a mass audience, which can strip dishes of their authenticity. True connoisseurs appreciate the [7] of regional flavors that detailed books preserve. It is [8] that the cookbook has transcended its original function to become a lifestyle object.",
    "answers": {
      "1": { "root": "UBIQUITOUS", "answer": "UBIQUITY" },
      "2": { "root": "ENDURE", "answer": "ENDURANCE" },
      "3": { "root": "PRECEDE", "answer": "UNPRECEDENTED" },
      "4": { "root": "CONVINCE", "answer": "UNCONVINCINGLY" },
      "5": { "root": "OBSOLETE", "answer": "OBSOLESCENCE" },
      "6": { "root": "SIMPLE", "answer": "OVERSIMPLIFICATION" },
      "7": { "root": "INTRICATE", "answer": "INTRICACIES" },
      "8": { "root": "DENY", "answer": "UNDENIABLE" }
    }
  },
    {
    "id": "C2_HISTORY_FANTA_ECONOMICS",
    "level": "C2",
    "title": "Corporate Ingenuity in Wartime",
    "content": "The inception of Fanta during the Third Reich serves as a striking case study in corporate [1] and survivalism. With the outbreak of World War II, the [2] of the proprietary Coca-Cola syrup into Nazi Germany became impossible due to trade embargoes. Faced with the [3] of their operations, the German subsidiary demonstrated remarkable resourcefulness. They concocted a new beverage utilizing industrial [4], specifically apple fibre and whey, which were among the few ingredients available. The name 'Fanta' was derived from 'Fantasie', implying that [5] was the primary ingredient in its creation. Despite the unappetizing nature of its components, the drink achieved [6] market penetration, largely due to the scarcity of alternatives. Post-war, the brand was successfully [7] into the parent company's global portfolio. Today, the [8] origins of this colourful soda are frequently overlooked by the general public.",
    "answers": {
      "1": { "root": "IMPROVISE", "answer": "IMPROVISATION" },
      "2": { "root": "IMPORT", "answer": "IMPORTATION" },
      "3": { "root": "CEASE", "answer": "CESSATION" },
      "4": { "root": "PRODUCE", "answer": "BYPRODUCTS/BY-PRODUCTS" },
      "5": { "root": "INVENT", "answer": "INVENTIVENESS" },
      "6": { "root": "PRECEDENT", "answer": "UNPRECEDENTED" },
      "7": { "root": "INTEGRATE", "answer": "REINTEGRATED" },
      "8": { "root": "AUSPICES", "answer": "INAUSPICIOUS" }
    }
  },
  {
    "id": "C2_SLEEP_NEUROBIOLOGY",
    "level": "C2",
    "title": "The Neurobiology of Sleep",
    "content": "The biological imperative of sleep extends far beyond simple physical restoration; it is [1] to the maintenance of cognitive health. Current neuroscientific models posit that sleep facilitates the [2] of memories, moving them from short-term to long-term storage. Furthermore, the glymphatic system, which clears metabolic waste from the brain, is primarily active during sleep. Consequently, chronic [3] can lead to a build-up of toxic proteins associated with neurodegenerative disorders. The [4] of these findings suggests that sleep debt is not merely a lifestyle choice but a medical concern. Individuals who habitually [5] the importance of rest may be causing irreversible damage. There is also evidence that sleep regulates emotional [6], allowing for better stress management. Unfortunately, modern society often views sleep as a sign of [7], rewarding those who sacrifice it. This cultural attitude is arguably [8] to public health outcomes.",
    "answers": {
      "1": { "root": "TRINSIC", "answer": "INTRINSIC" },
      "2": { "root": "SOLID", "answer": "CONSOLIDATION" },
      "3": { "root": "SUFFICE", "answer": "INSUFFICIENCY" },
      "4": { "root": "GRAVE", "answer": "GRAVITY" },
      "5": { "root": "ESTIMATE", "answer": "UNDERESTIMATE" },
      "6": { "root": "STABLE", "answer": "STABILITY" },
      "7": { "root": "IDLE", "answer": "IDLENESS" },
      "8": { "root": "PRODUCT", "answer": "COUNTERPRODUCTIVE" }
    }
  },
  {
    "id": "C2_HISTORY_HANSEATIC",
    "level": "C2",
    "title": "The Hanseatic League",
    "content": "The Hanseatic League was a commercial and defensive confederation of merchant guilds that dominated trade along the coast of Northern Europe. It emerged from the need to protect economic interests and ensure safe [1] across the Baltic and North Seas. At its peak, the League exercised [2] power, functioning almost as a state within a state. Its member cities enjoyed a degree of legal [3] and mutual protection that was rare for the medieval period. The League's decline began with the rise of sovereign nation-states and the changing [4] of global trade routes. However, its legacy of cross-border cooperation is often cited as a historical [5] to the modern European Union. The network created a unique cultural and architectural [6] that is still visible in cities like Lbeck and Hamburg. Ultimately, it proved that economic [7] could foster peace more effectively than military force. Its dissolution was gradual, marked by increasing [8] among its members.",
    "answers": {
      "1": { "root": "PASS", "answer": "PASSAGE" },
      "2": { "root": "RIVAL", "answer": "UNRIVALLED/UNRIVALED" },
      "3": { "root": "AUTONOMY", "answer": "AUTONOMY" },
      "4": { "root": "DYNAMIC", "answer": "DYNAMICS" },
      "5": { "root": "CURSOR", "answer": "PRECURSOR" },
      "6": { "root": "UNIFORM", "answer": "UNIFORMITY" },
      "7": { "root": "DEPEND", "answer": "INTERDEPENDENCE" },
      "8": { "root": "DISCREPANT", "answer": "DISCREPANCIES" }
    }
  },
  {
    "id": "C2_REFUGEE_BRAIN_GAIN",
    "level": "C2",
    "title": "Reframing Migration",
    "content": "The narrative surrounding refugees often focuses on the humanitarian burden, yet economists argue this view is [1] flawed. Far from being a drain on resources, the influx of skilled individuals can lead to a phenomenon known as 'brain gain'. Many displaced persons possess [2] qualifications that are disregarded due to bureaucratic hurdles. The [3] to recognize these credentials represents a massive waste of human capital. When societies facilitate the [4] of refugees into the labour market, the economic dividends are often substantial. Innovation tends to thrive in diverse environments, as newcomers bring [5] perspectives to problem-solving. Of course, the initial phase requires investment in language training and housing, which can be [6] for local councils. However, longitudinal studies show that the net fiscal impact is overwhelmingly positive. To view refugees solely as beneficiaries of aid is a gross [7] of their potential contribution. It is an [8] truth that migration drives economic dynamism.",
    "answers": {
      "1": { "root": "FUNDAMENT", "answer": "FUNDAMENTALLY" },
      "2": { "root": "VALUE", "answer": "INVALUABLE" },
      "3": { "root": "FAIL", "answer": "FAILURE" },
      "4": { "root": "INSERT", "answer": "INSERTION/REINSERTION" },
      "5": { "root": "CONVENTION", "answer": "UNCONVENTIONAL" },
      "6": { "root": "BURDEN", "answer": "BURDENSOME" },
      "7": { "root": "REPRESENT", "answer": "MISREPRESENTATION" },
      "8": { "root": "DISPUTE", "answer": "INDISPUTABLE" }
    }
  },
  {
    "id": "C2_SINGER_MARIA_CALLAS",
    "level": "C2",
    "title": "La Divina",
    "content": "Maria Callas remains the definition of the operatic diva, a title she earned through both her artistry and her [1] personality. Her voice was not conventionally beautiful; it was a complex instrument capable of conveying immense emotional weight. She was renowned for her [2] to the dramatic truth of a role, often sacrificing vocal beauty for expression. This approach revolutionized opera, turning it into a theatrical as well as a musical experience. However, her perfectionism often bordered on the [3], leading to frequent clashes with directors. Her personal life was equally [4], marked by high-profile relationships and scandals. Towards the end of her career, her voice began to deteriorate, a decline often attributed to rapid weight loss and [5] strain. Despite the [6] of her prime years, her recordings remain the benchmark for the repertoire. She possessed an [7] quality that transcended the stage. To this day, her influence on the genre is [8].",
    "answers": {
      "1": { "root": "TEMPER", "answer": "TEMPERAMENTAL" },
      "2": { "root": "COMMIT", "answer": "COMMITMENT" },
      "3": { "root": "OBSESS", "answer": "OBSESSIVE" },
      "4": { "root": "TURBULENCE", "answer": "TURBULENT" },
      "5": { "root": "PSYCHOLOGY", "answer": "PSYCHOLOGICAL" },
      "6": { "root": "BRIEF", "answer": "BREVITY" },
      "7": { "root": "DEFINE", "answer": "INDEFINABLE" },
      "8": { "root": "MEASURE", "answer": "IMMEASURABLE" }
    }
  },
  {
    "id": "C2_SLEEP_CIRCADIAN",
    "level": "C2",
    "title": "Circadian Misalignment",
    "content": "Human physiology is governed by circadian rhythms, the 24-hour cycles that regulate sleep, hormone release, and body temperature. In our modern, 24/7 society, the [1] between our internal clocks and our external schedules is becoming increasingly common. This mismatch, often termed 'social jetlag', is particularly [2] to long-term health. The ubiquitous presence of artificial light suppresses melatonin production, leading to sleep [3] and fragmentation. Shift workers are especially vulnerable, facing a heightened risk of cardiovascular incidents and metabolic disorders. The body's inability to adapt to constantly shifting schedules results in a state of chronic physiological [4]. Researchers advocate for greater [5] in work hours to accommodate different chronotypes. Ignoring these biological mandates is [6], as it leads to reduced efficiency and higher error rates. Acknowledging the [7] of our temporal biology is essential for public health. The consequences of disrupting this delicate balance are far from [8].",
    "answers": {
      "1": { "root": "SYNCHRONIZE", "answer": "DESYNCHRONIZATION" },
      "2": { "root": "DETRIMENT", "answer": "DETRIMENTAL" },
      "3": { "root": "REGULAR", "answer": "IRREGULARITIES" },
      "4": { "root": "STRESS", "answer": "STRESS" },
      "5": { "root": "FLEXIBLE", "answer": "FLEXIBILITY" },
      "6": { "root": "LOGIC", "answer": "ILLOGICAL" },
      "7": { "root": "SUPREME", "answer": "SUPREMACY" },
      "8": { "root": "SIGNIFY", "answer": "INSIGNIFICANT" }
    }
  },
  {
    "id": "C2_HISTORY_ENLIGHTENMENT",
    "level": "C2",
    "title": "The Age of Reason",
    "content": "The Enlightenment was an intellectual movement that swept across Europe, emphasizing reason, science, and individualism. It challenged the [1] of the church and monarchy, advocating for liberty and religious tolerance. Philosophers like Voltaire and Rousseau criticized the [2] nature of existing institutions. They believed that human society could be improved through [3] discourse and education. This period saw the birth of the encyclopaedia, an attempt to democratize knowledge and dispel [4] and superstition. The movement laid the philosophical foundations for future revolutions. However, it was not without its contradictions; many enlightenment thinkers held [5] views on race and gender that seem abhorrent today. Nevertheless, the era's focus on evidence-based inquiry was [6]. It marked a definitive break from the medieval worldview. The [7] of its ideals continues to shape modern [8] discourse.",
    "answers": {
      "1": { "root": "FALLIBLE", "answer": "INFALLIBILITY" },
      "2": { "root": "TYRANT", "answer": "TYRANNICAL" },
      "3": { "root": "REASON", "answer": "REASONED" },
      "4": { "root": "OBSCURE", "answer": "OBSCURANTISM" },
      "5": { "root": "CONGRUE", "answer": "INCONGRUOUS" },
      "6": { "root": "PIVOT", "answer": "PIVOTAL" },
      "7": { "root": "PERVADE", "answer": "PERVASIVENESS" },
      "8": { "root": "SOCIETY", "answer": "SOCIETAL" }
    }
  },
  {
    "id": "C2_SINGER_BOB_DYLAN",
    "level": "C2",
    "title": "The Poet Laureate of Rock",
    "content": "Bob Dylan's impact on popular music is profound, largely due to his elevation of the lyric to a form of high art. His awarding of the Nobel Prize in Literature in 2016 was met with both acclaim and [1], as traditionalists questioned whether song lyrics qualified as literature. Dylan has always been an [2] figure, refusing to be pinned down by the expectations of his fanbase. His transition from acoustic folk to electric rock in the 1960s was viewed by purists as an act of [3], yet it redefined the genre. His songs are often dense with allusion, metaphor, and [4], requiring repeated listening to decipher. He possesses a voice that is arguably [5] in conventional terms, yet it conveys a weary authority. Throughout his career, he has maintained an air of [6], rarely giving interviews or explaining his work. His extensive body of work serves as a chronicle of American history and mythology. He remains a singular, [7] force in culture, indifferent to commercial [8].",
    "answers": {
      "1": { "root": "CREDIT", "answer": "INCREDULITY" },
      "2": { "root": "ELUDE", "answer": "ELUSIVE" },
      "3": { "root": "BETRAY", "answer": "BETRAYAL" },
      "4": { "root": "AMBIGUOUS", "answer": "AMBIGUITY" },
      "5": { "root": "PLEASE", "answer": "UNPLEASANT" },
      "6": { "root": "DETACH", "answer": "DETACHMENT" },
      "7": { "root": "COMPROMISE", "answer": "UNCOMPROMISING" },
      "8": { "root": "VALID", "answer": "VALIDATION" }
    }
  },
  {
    "id": "C2_REFUGEE_STATELESSNESS",
    "level": "C2",
    "title": "The Plight of the Stateless",
    "content": "Statelessness is a legal anomaly that affects millions of people globally, rendering them invisible in the eyes of the law. Without citizenship, individuals are denied basic rights such as education, healthcare, and the freedom of movement. This legal [1] often arises from the dissolution of states or discriminatory laws targeting specific ethnic groups. The psychological toll of existing in a legal limbo is severe, leading to feelings of [2] and alienation. Stateless people are vulnerable to exploitation and [3] detention, as they have no government to advocate for them. International efforts to reduce statelessness have faced significant [4] from sovereign nations protective of their citizenship criteria. The United Nations has declared the eradication of statelessness a priority, yet progress remains [5] slow. Granting nationality is not just a moral duty but a [6] necessity for regional stability. The [7] of these individuals from society fosters poverty and unrest. It is an [8] violation of human rights that demands immediate attention.",
    "answers": {
      "1": { "root": "EXIST", "answer": "NONEXISTENCE" },
      "2": { "root": "WORTH", "answer": "WORTHLESSNESS" },
      "3": { "root": "BITRARY", "answer": "ARBITRARY" },
      "4": { "root": "RESIST", "answer": "RESISTANCE" },
      "5": { "root": "PAIN", "answer": "PAINFULLY" },
      "6": { "root": "PRAGMATISM", "answer": "PRAGMATIC" },
      "7": { "root": "EXCLUDE", "answer": "EXCLUSION" },
      "8": { "root": "DEFEND", "answer": "INDEFENSIBLE" }
    }
  },
  {
    "id": "C2_HISTORY_INDUSTRIAL_REV",
    "level": "C2",
    "title": "The Great Transformation",
    "content": "The Industrial Revolution marked a watershed moment in human history, characterized by the transition to new manufacturing processes. This period witnessed [1] levels of urbanization as populations migrated from the countryside to factory towns. While it drove technological advancement and increased economic output, the social cost was high. The working class faced [2] conditions, with long hours, low pay, and dangerous environments. Child labour was [3] until reformers began to campaign for protective legislation. The shift also led to the [4] of traditional craftsmanship, as machines replaced skilled artisans. Environmentally, the era initiated the massive extraction of fossil fuels, the consequences of which we are grappling with today. Despite the [5] hardship of the early years, the revolution ultimately raised standards of living. It fostered the growth of the middle class and the expansion of [6] literacy. However, the [7] of wealth remained a persistent issue. The era's legacy is a complex mix of progress and [8].",
    "answers": {
      "1": { "root": "PRECEDENT", "answer": "UNPRECEDENTED" },
      "2": { "root": "APPALL", "answer": "APPALLING" },
      "3": { "root": "PREVAIL", "answer": "PREVALENT" },
      "4": { "root": "ERODE", "answer": "EROSION" },
      "5": { "root": "DENY", "answer": "UNDENIABLE" },
      "6": { "root": "UNIVERSE", "answer": "UNIVERSAL" },
      "7": { "root": "EQUAL", "answer": "INEQUALITY" },
      "8": { "root": "EXPLOIT", "answer": "EXPLOITATION" }
    }
  }
]