[
  {
    "id": "B2_01",
    "level": "B2",
    "title": "The Origin of Chewing Gum",
    "content": "We tend to think of chewing gum as a modern American invention, but it has actually been around for thousands of years. The ancient Greeks used to chew a resin called mastic, [1] came from the bark of a tree. This substance was thought to have health benefits as [2] as freshening the breath. In South America, the Aztecs chewed a substance called chicle. This was natural, but in [3] of its popularity, it had a drawback: it would eventually break [4] . In modern times, early versions of gum were tasteless, but in 1869, flavoured gum was introduced. It was an instant success. Today, [5] the fact that it is banned in some places, it remains popular globally. However, environmentalists assume it is [6] problem because it is not biodegradable. Therefore, scientists are looking [7] ways to make it eco-friendly. Perhaps in the future, we will see gum that disappears [8] trace.",
    "answers": [ ["WHICH", "THAT"], ["WELL"], ["SPITE"], ["UP", "DOWN"], ["DESPITE"], ["A"], ["INTO", "FOR", "AT"], ["WITHOUT"] ]
  },
  {
    "id": "B2_02",
    "level": "B2",
    "title": "Learning a New Instrument",
    "content": "Many people say they would like to learn a musical instrument, but they often give [1] before they have really started. One of the main reasons for this is that they [2] not realise how much practice is involved. It is said that to become an expert [3] anything, you need to put in 10,000 hours of practice. That is a [4] of time! However, you don't need to be an expert to enjoy playing. If you set achievable goals, [5] as learning one simple song a week, you will see progress. It is also important to choose an instrument that suits you. For example, [6] you live in a small apartment, a drum kit might not be the best idea. Above [7] , remember that playing music should be fun, so don't be too hard on [8] if you make mistakes.",
    "answers": [ ["UP"], ["DO"], ["AT", "IN"], ["LOT"], ["SUCH"], ["IF"], ["ALL"], ["YOURSELF"] ]
  },
  {
    "id": "B2_03",
    "level": "B2",
    "title": "The Northern Lights",
    "content": "The Aurora Borealis, commonly known as the Northern Lights, is one of nature's most spectacular displays. These lights appear [1] the sky above the magnetic poles of the earth. They are created [2] electrically charged particles from the sun collide with gases in the Earth's atmosphere. The colours depend on which gas is being affected; oxygen produces green and red lights, [3] nitrogen creates blue and purple ones. The best time to see them is in winter, when the nights are longest. However, seeing them is never guaranteed because it relies [4] clear skies. Many people travel thousands of miles just [5] the chance to witness this phenomenon. It is widely regarded [6] one of the most beautiful sights in the world. If you ever get the opportunity to see them, it is an experience you [7] never forget. Just make sure you dress warmly, [8] you might freeze!",
    "answers": [ ["IN"], ["WHEN", "AS", "WHENEVER"], ["WHILE", "WHEREAS", "BUT"], ["ON", "UPON"], ["FOR"], ["AS"], ["WILL"], ["OR"] ]
  },
  {
    "id": "B2_04",
    "level": "B2",
    "title": "Running a Marathon",
    "content": "Running a marathon is widely considered one of the toughest physical challenges a person can undertake. It requires months of training to ensure the body is capable [1] running 42 kilometres without stopping. Beginners are advised to start slowly, gradually increasing [2] distance they run each week. It is also vital to pay attention to diet, as runners need plenty of energy-rich foods like pasta and rice. On the day of the race, the atmosphere is usually electric, with crowds cheering the runners [3] . Many participants run for charity, raising money for good causes. Even [4] you are not a professional athlete, finishing a marathon is a huge achievement. Most runners say that crossing the finish line makes all the hard work worth [5] . However, be warned: once you have completed one, you might find [6] wanting to do another. It can be quite addictive! So, why [7] buy a pair of running shoes and give it a [8] ?",
    "answers": [ ["OF"], ["THE"], ["ON"], ["IF", "THOUGH"], ["IT", "WHILE"], ["YOURSELF"], ["NOT"], ["GO", "TRY", "SHOT"] ]
  },
  {
    "id": "B2_05",
    "level": "B2",
    "title": "The History of Pizza",
    "content": "Pizza is one of the most popular foods in the world, but its origins are often debated. While flatbreads with toppings have existed for centuries, the modern pizza was born in Naples, Italy, in the late 18th century. It was originally food [1] the poor, sold by street vendors and eaten on the go. In 1889, a chef named Raffaele Esposito created a special pizza [2] honour of Queen Margherita of Savoy. He used tomatoes, mozzarella, and basil to represent the colours of the Italian flag. The Queen loved it, and the 'Pizza Margherita' [3] named after her. However, pizza did not become globally famous [4] after World War II, when soldiers returning from Italy brought their love for the dish home with them. Today, there are countless variations, [5] from classic Italian styles to American deep-dish. Whether you like it with pineapple [6] not, there is no denying that pizza is here to [7] . It truly is a global [8] .",
    "answers": [ ["FOR"], ["IN"], ["WAS"], ["UNTIL"], ["RANGING"], ["OR"], ["STAY"], ["PHENOMENON", "SUCCESS", "SENSATION", "OBSESSION"] ]
  },
  {
    "id": "B2_06_XMAS",
    "level": "B2",
    "title": "The Tradition of the Christmas Tree",
    "content": "For many families, the Christmas tree is the centrepiece of their holiday decorations. But where did this tradition come [1] ? It is generally believed to have started in Germany in the 16th century, when Christians brought decorated trees [2] their homes. Some built wooden pyramids and decorated them with evergreens and candles if wood [3] scarce. It is widely thought that Martin Luther, the Protestant reformer, was [4] first person to place lighted candles on a tree. Walking home one winter evening, he was awed by the brilliance of stars twinkling [5] the evergreens. To recapture the scene for his family, he erected a tree in the main room. Today, we use electric lights [6] of wax candles to avoid fire hazards. Whether real [7] artificial, the tree remains a symbol of the festive season. It is often topped with an angel, [8] symbolises the Nativity.",
    "answers": [ ["FROM"], ["INTO"], ["WAS"], ["THE"], ["AMONG", "AMONGST", "AMIDST"], ["INSTEAD"], ["OR"], ["WHICH"] ]
  },
  {
    "id": "B2_07_AIR",
    "level": "B2",
    "title": "My First Flight",
    "content": "I will never forget the first time I went on a plane. I was ten years old and we were going [1] holiday to Spain. My parents had booked the tickets months [2] advance. When we arrived at the airport, I was amazed by [3] big it was. We checked in our bags and then went through security. I felt a bit nervous when the plane started to speed [4] the runway. However, once we were in the air, the view was incredible. The houses below looked [5] toy buildings. The flight attendants were very friendly and gave us snacks. I spent most of the time looking out [6] the window at the clouds. It felt [7] magic to be flying so high. When we landed, everyone clapped, which I thought was funny. It was [8] an exciting experience that I wanted to do it again immediately.",
    "answers": [ ["ON"], ["IN"], ["HOW"], ["DOWN", "ALONG"], ["LIKE"], ["OF"], ["LIKE"], ["SUCH"] ]
  },
  {
    "id": "B2_08_SCOOT",
    "level": "B2",
    "title": "Electric Scooters in Cities",
    "content": "Electric scooters, or e-scooters, have become a common sight in many cities around the world. They are seen [1] a convenient and eco-friendly way to travel short distances. You can rent them using an app on your phone and leave them [2] you finish your journey. This makes them perfect for the 'last mile' of a commute, [3] as getting from the train station to the office. However, they are not without problems. Some pedestrians complain that riders drive [4] fast on pavements, which can be dangerous. There have also been accidents [5] cars because drivers did not see the scooters. As a result, some cities have introduced strict rules about where they can [6] ridden. Despite these issues, their popularity shows [7] sign of slowing down. They are a fun way to get [8] the city without using a car.",
    "answers": [ ["AS"], ["WHERE", "WHEREVER", "WHEN", "ONCE"], ["SUCH"], ["TOO", "SO"], ["INVOLVING", "WITH"], ["BE"], ["NO"], ["AROUND", "ROUND"] ]
  },
  {
    "id": "B2_09_BIRD",
    "level": "B2",
    "title": "The Parakeets of London",
    "content": "If you walk through a park in London, you might be surprised to see bright green parrots flying among the trees. These are ring-necked parakeets, and [1] are thousands of them in the city. Nobody knows for sure [2] they arrived. One famous story says that Jimi Hendrix released a pair [3] the 1960s. Another theory is that they escaped from a film set. Whatever the truth is, these birds have adapted remarkably well [4] the British climate. They are very noisy and can often be heard before they are [5] . They live in holes in old trees and eat fruit, berries, and nuts. While many people love seeing such colourful birds, others are worried. The parakeets can be aggressive and might take food [6] native birds. Despite this, they seem quite happy to live alongside humans. They are now a permanent part [7] London's wildlife. It is certainly [8] unusual sight in a rainy English city.",
    "answers": [ ["THERE"], ["HOW", "WHEN"], ["IN", "DURING"], ["TO"], ["SEEN", "SPOTTED", "FOUND"], ["FROM", "OFF"], ["OF"], ["AN"] ]
  },
  {
    "id": "B2_10_HEAT",
    "level": "B2",
    "title": "Hotter Summers",
    "content": "Summer used to be everyone's favourite season, but recently, the heat has become a bit too much. With temperatures regularly rising [1] 35 degrees, staying cool is a priority. Many people in northern Europe are not used [2] such heat. Houses are built to keep heat in, not let it [3] , which makes sleeping difficult. Sales of electric fans and air conditioning units have gone [4] significantly. We are also changing our habits; people go for walks later in the evening [5] it is cooler. Doctors advise drinking plenty of water to avoid becoming dehydrated. It is also important to wear sunscreen to protect [6] skin from the sun. While it is nice to go to the beach, we must be careful not to stay in the sun [7] long. It seems that hot summers are here to [8] .",
    "answers": [ ["ABOVE", "TO", "OVER"], ["TO"], ["OUT"], ["UP"], ["WHEN", "AS", "BECAUSE", "SINCE"], ["YOUR", "THE"], ["TOO"], ["STAY"] ]
  },
  {
    "id": "B2_11_AI",
    "level": "B2",
    "title": "Fun with AI Images",
    "content": "Artificial Intelligence is not just for serious work; it can also be a lot of fun. New programs allow anyone [1] create amazing pictures just by typing a description. For example, you can ask for a picture of a cat riding a skateboard [2] space, and the AI will generate it in seconds. It feels [3] magic! You don't need to be an artist or know [4] to draw. This technology uses millions of images from the internet to learn what things look like. People are using it to make funny greeting cards or designs for T-shirts. However, sometimes the results are [5] bit strange. The AI might give a person six fingers [6] three legs! Despite these mistakes, it is a great way to unleash your creativity. It is exciting to see [7] the computer comes up with. Why not give it [8] try?",
    "answers": [ ["TO"], ["IN", "INTO", "THROUGH"], ["LIKE"], ["HOW"], ["A"], ["OR"], ["WHAT"], ["A"] ]
  },
  {
    "id": "B2_ITALIA_90",
    "level": "B2",
    "title": "Italia '90: A Summer to Remember",
    "content": "The 1990 World Cup in Italy was a huge event for football fans. For Ireland, it was particularly special because [1] was the first time the national team had qualified for the tournament. The team played remarkably well [2] though they did not win the trophy. Everyone remembers the song 'Nessun Dorma', [3] became famous all over the world during that summer. Fans traveled to Italy [4] great numbers to support the 'Boys in Green'. The atmosphere was amazing, [5] only in the stadiums but also on the streets back home. It is still remembered [6] one of the best sporting events in history. Even people who [7] not usually like football found themselves glued to the TV. It brought the whole country [8] in a way that hasn't happened since.",
    "answers": [
      ["IT"],
      ["EVEN"],
      ["WHICH", "THAT"],
      ["IN"],
      ["NOT"],
      ["AS"],
      ["DID"],
      ["TOGETHER", "CLOSER"]
    ]
  },
  {
    "id": "B2_RETURN_IRELAND",
    "level": "B2",
    "title": "Return to Recycle",
    "content": "Ireland has introduced a new system to recycle plastic bottles and aluminum cans called 'Re-turn'. When you buy a drink with the special Re-turn logo, you pay a small deposit [1] addition to the price of the drink. You get this money back [2] you return the empty, undamaged container to a reverse vending machine. These machines are found [3] supermarkets and shops across the country. The aim is to reduce litter and ensure that more plastic [4] recycled instead of being thrown away. Since the scheme started, millions of items have [5] returned. It is [6] easier than many people thought it would be. You just need to make [7] the bottle still has its barcode. It is a simple way to help [8] environment.",
    "answers": [
      ["IN"],
      ["WHEN", "ONCE", "IF", "PROVIDED", "PROVIDING"],
      ["AT", "IN", "OUTSIDE", "NEAR"],
      ["IS", "GETS"],
      ["BEEN"],
      ["MUCH", "FAR", "CONSIDERABLY", "LOTS", "A"],
      ["SURE", "CERTAIN"],
      ["THE"]
    ]
  },
  {
    "id": "B2_PARMIGIANO",
    "level": "B2",
    "title": "The King of Cheese",
    "content": "Parmigiano Reggiano is a famous Italian cheese produced in a specific area of Northern Italy. To make it, farmers use milk [1] cows that eat only fresh grass or hay. The cheese is crafted into large wheels that weigh about 40 kilograms. Each wheel is marked with a unique number so [2] can be identified later. The cheese must age for [3] least 12 months before it is sold. After this time, an expert checks it [4] tapping the crust with a small hammer to listen for defects. If there are [5] holes inside, the cheese cannot be sold as top quality. It is amazing to see how much work goes [6] making just one wheel. The result is a hard cheese [7] a rich, salty taste. It is perfect [8] grating over your favorite pasta dish.",
    "answers": [
      ["FROM", "OF"],
      ["IT"],
      ["AT"],
      ["BY"],
      ["ANY"],
      ["INTO"],
      ["WITH", "HAS"],
      ["FOR"]
    ]
  },
    {
    "id": "B2_BLUE_MONDAY",
    "level": "B2",
    "title": "The Saddest Day?",
    "content": "The third Monday [1] January is often called 'Blue Monday'. It is said to be the most depressing day of the year. This idea was started [2] a travel company that wanted to sell more holidays. They used a mathematical formula to choose the date, looking at things like the bad weather and how [3] debt people have after Christmas. However, scientists say there is [4] real proof that this day is sadder than any other. Even [5] the science is not real, you will hear people talking about it every year. It is really just a normal day like [6] other. The best thing to do is to ignore it and not let it make [7] feel down. After all, spring is not [8] far away.",
    "answers": [
      ["IN", "OF"],
      ["BY"],
      ["MUCH"],
      ["NO", "LITTLE"],
      ["THOUGH", "IF"],
      ["ANY"],
      ["YOU", "US"],
      ["TOO", "SO", "VERY"]
    ]
  },
  {
    "id": "B2_ALONE_IN_BERLIN",
    "level": "B2",
    "title": "A Story of Resistance",
    "content": "The book 'Alone in Berlin' tells the true story of a couple living in Germany during the Second World War. After their son dies in the war, Otto and Anna Quangel decide to fight [1] against the government. They write messages on postcards attacking Hitler and leave [2] in public places across the city. It was a very dangerous thing to [3] because the police were looking for them. They knew that if they were caught, they [4] be killed. For a long time, they managed to avoid being found. The book shows how ordinary people can show great courage even [5] terrible times. It is [6] of the most exciting books I have ever read. It was written in a very short time but is now famous all over the [7]. Everyone [8] read it.",
    "answers": [
      ["BACK"],
      ["THEM"],
      ["DO"],
      ["WOULD", "COULD", "MIGHT"],
      ["IN", "DURING"],
      ["ONE"],
      ["WORLD"],
      ["SHOULD", "MUST"]
    ]
  },
  {
    "id": "B2_DOG_SMELL",
    "level": "B2",
    "title": "The Super Nose",
    "content": "Dogs are famous [1] their amazing sense of smell. While humans rely mostly on their eyes, dogs use their noses to understand the world. A dog’s nose is much more sensitive [2] a human’s; in fact, it is thousands of times better. They have a special part of [3] brains just for smelling. This helps them to find things that we cannot see [4] all. Police dogs use this skill to look [5] missing people or hidden objects. When a dog breathes [6], it can smell things from very far away. They also have wet noses [7] help to catch the scent particles in the air. It is [8] surprise that they are such good hunters.",
    "answers": [
      ["FOR"],
      ["THAN"],
      ["THEIR"],
      ["AT"],
      ["FOR"],
      ["IN"],
      ["WHICH", "THAT"],
      ["NO", "LITTLE"]
    ]
  },
    {
    "id": "B2_JANUARY",
    "level": "B2",
    "title": "The First Month",
    "content": "January is named [1] the Roman god Janus. He had two faces, one looking back at the old year and one looking forward to the new [2]. It is traditionally the time [3] make resolutions. However, [4] many people keep them for long. By the end of the month, most have given [5]. It is also usually the coldest month [6] the year in the northern hemisphere. Despite the weather, it represents a fresh start [7] everyone. It is a time to plan for the year [8].",
    "answers": [
      ["AFTER"],
      ["ONE"],
      ["TO"],
      ["NOT"],
      ["UP"],
      ["OF"],
      ["FOR"],
      ["AHEAD"]
    ]
  },
  {
    "id": "B2_PLUTO_PHOTOS",
    "level": "B2",
    "title": "A New Look at Pluto",
    "content": "For a long time, Pluto was considered the ninth planet. Then, [1] 2006, it was reclassified as a dwarf planet. A few years ago, the New Horizons probe flew past it and took amazing photos. The images showed that Pluto [2] mountains made of ice and a huge heart-shaped area. Scientists were surprised [3] how complex the surface was. It took the spacecraft nine years to get [4]. The data sent back [5] Earth has changed what we know about the outer solar system. It turns [6] that Pluto is [7] just a dead rock. It is a fascinating world [8] its own.",
    "answers": [
      ["IN"],
      ["HAD", "HAS"],
      ["BY", "AT"],
      ["THERE"],
      ["TO"],
      ["OUT"],
      ["NOT"],
      ["ON"]
    ]
  },
  {
    "id": "B2_STREAMING",
    "level": "B2",
    "title": "Changing TV Habits",
    "content": "The way we watch television has changed completely. We no [1] have to wait for a specific time to see our favorite show. Streaming services allow us to watch what we want, [2] we want. However, this convenience comes [3] a price. There are now [4] many different services that it can be expensive to subscribe to them all. Some people spend more [5] they used to spend on cable TV. Another problem is choosing [6] to watch. We spend hours scrolling through lists [7] actually picking something. It was easier when there were only [8] few channels.",
    "answers": [
      ["LONGER"],
      ["WHEN", "WHENEVER"],
      ["AT"],
      ["SO"],
      ["THAN"],
      ["WHAT"],
      ["WITHOUT", "BEFORE", "INSTEAD"],
      ["A"]
    ]
  },
  {
    "id": "B2_BUTTERFLIES",
    "level": "B2",
    "title": "The Great Migration",
    "content": "Butterflies are some of the most beautiful insects in the world. There are thousands of species, but the Monarch is famous [1] its long migration. Every year, millions of them fly from Canada to Mexico to escape the cold. It is a mystery [2] they know where to go, especially as no single butterfly makes the whole journey. They lay their eggs on plants, [3] hatch into caterpillars. This transformation is known [4] metamorphosis. Unfortunately, butterfly numbers are going [5] due to habitat loss. We need to protect the flowers they feed [6]. If we don't, we might lose these amazing creatures [7]. They are important for the environment [8] addition to being beautiful.",
    "answers": [
      ["FOR"],
      ["HOW"],
      ["WHICH", "THAT"],
      ["AS"],
      ["DOWN"],
      ["ON", "UPON"],
      ["FOREVER"],
      ["IN"]
    ]
  },
  {
    "id": "B2_TV_REMAKES",
    "level": "B2",
    "title": "Everything Old is New Again",
    "content": "It seems that every time you turn on the TV, there is a remake of an old show. Television producers seem obsessed [1] the past. They take a popular series from twenty years ago and make [2] again with new actors. Sometimes these remakes are successful, but often they are not [3] good as the original. Fans of the old shows usually hate [4]. They argue that the new versions lack the magic of the [5] time. So why do studios keep doing it? It is mainly because it is less risky [6] trying a completely new idea. They know there is already an audience waiting [7] it. However, it would be nice to see something original [8] an alternative.",
    "answers": [
      ["WITH"],
      ["IT"],
      ["SO"],
      ["THEM"],
      ["FIRST"],
      ["THAN"],
      ["FOR"],
      ["AS"]
    ]
  },
  {
    "id": "B2_BUTTER",
    "level": "B2",
    "title": "Back to Butter",
    "content": "For years, we were told that butter was bad for our health. Doctors said we [1] eat margarine instead because it had less fat. However, recent research suggests that butter is not as harmful [2] we thought. In fact, it is a natural product made from milk, [3] margarine is highly processed. Chefs have always preferred butter because [4] its rich flavor. Now, consumers are buying it [5] increasingly large numbers. Of course, it is still high in calories, so you shouldn't eat too [6]. But a little bit on your toast is fine. It seems that grandmother was right [7] along. Everything is good in moderation, [8] butter.",
    "answers": [
      ["SHOULD", "MUST"],
      ["AS"],
      ["WHEREAS", "WHILE", "BUT"],
      ["OF"],
      ["IN"],
      ["MUCH"],
      ["ALL"],
      ["INCLUDING", "LIKE", "EVEN"]
    ]
  },
  {
    "id": "B2_HONEY",
    "level": "B2",
    "title": "Liquid Gold",
    "content": "Honey is a truly amazing food. It is the only food made by insects that humans eat. Bees collect nectar from flowers and make [1] into honey to store for the winter. It is naturally sweet and can be used instead [2] sugar in cakes and drinks. One of the most incredible things about honey is [3] it never goes bad. Archaeologists have found pots of honey in ancient Egyptian tombs that are thousands of years [4] and are still safe to eat. It also has medicinal properties and is good [5] sore throats. To make just one jar, bees have to visit millions of flowers. We should appreciate the hard work they put [6] it. Sadly, bee populations are falling, [7] is a worry for farmers. We rely on them to pollinate [8] crops.",
    "answers": [
      ["IT"],
      ["OF"],
      ["THAT"],
      ["OLD"],
      ["FOR"],
      ["INTO"],
      ["WHICH"],
      ["OUR", "THE"]
    ]
  },
  {
    "id": "B2_BABIES_PLANES",
    "level": "B2",
    "title": "A Difficult Flight",
    "content": "There is nothing worse than trying to sleep on a plane and hearing a baby cry. It is a sound that cuts right [1] you. However, before you get angry, you should try to understand. Flying is confusing for a baby and the change in air pressure can cause pain in [2] ears. They don't know how to 'pop' their ears [3] adults do. The parents are usually more stressed [4] anyone else. They are desperate [5] stop the noise but often can't. Instead of staring, we should [6] patient. Maybe offer a smile to the parents. Remember that you [7] once a baby too. Hopefully, the flight will be over [8].",
    "answers": [
      ["THROUGH"],
      ["THEIR"],
      ["LIKE", "AS"],
      ["THAN"],
      ["TO"],
      ["BE"],
      ["WERE"],
      ["SOON"]
    ]
  },
  {
    "id": "B2_1984",
    "level": "B2",
    "title": "Big Brother is Watching",
    "content": "George Orwell's novel '1984' is one of the most famous books [1] the 20th century. Although it was written in 1948, it predicts a future that feels very familiar today. In the book, the government controls everything and there are cameras everywhere. The leader is known [2] 'Big Brother'. The phrase \"Big Brother is watching you\" comes [3] this book. Orwell was worried [4] the loss of privacy and freedom. Today, with CCTV and the internet, many people feel his warnings have [5] true. It is a frightening story, but one that everyone should read. It makes you think about [6] much power the state has. It remains relevant, even [7] it is fiction. It serves as a warning to [8] all.",
    "answers": [
      ["OF"],
      ["AS"],
      ["FROM"],
      ["ABOUT"],
      ["COME"],
      ["HOW"],
      ["THOUGH", "IF", "WHEN"],
      ["US"]
    ]
  },
  {
    "id": "B2_GENETICS",
    "level": "B2",
    "title": "The Code of Life",
    "content": "The study of genetics has advanced hugely in the last few decades. Scientists have mapped the human genome, [1] is the set of instructions that makes us who we are. This knowledge is helping doctors to understand diseases [2] cancer and heart disease. They hope that one day they will [3] able to cure these illnesses by fixing broken genes. There is also research into 'designer babies', where parents could choose the eye color [4] height of their children. This raises many ethical questions that [5] to be answered. Just because we can do something, does not mean we [6]. However, the potential benefits are huge. It is an exciting time [7] be involved in biology. The future of medicine looks very bright [8] of this research.",
    "answers": [
      ["WHICH"],
      ["LIKE", "SUCH"],
      ["BE"],
      ["OR", "AND"],
      ["NEED", "HAVE"],
      ["SHOULD"],
      ["TO"],
      ["BECAUSE"]
    ]
  },
  {
    "id": "C1_01",
    "level": "C1",
    "title": "The Impact of Noise",
    "content": "Noise pollution is rarely given the same attention as air or water pollution, yet it takes a heavy [1] on our health. It is [2] from being a minor irritation; studies show it wreaks [3] on our cardiovascular system. [4] only does it cause stress, but it also disrupts sleep patterns. The problem is particularly acute in cities, where residents are subjected [5] a constant barrage of sound. Interestingly, the [6] traffic there is, the louder it becomes, as drivers use their horns in frustration. Authorities are finally waking up to the issue, realising that silence is [7] longer a luxury, but a necessity. It is high [8] we took action to lower the volume of our lives.",
    "answers": [ ["TOLL"], ["FAR"], ["HAVOC"], ["NOT"], ["TO"], ["MORE"], ["NO"], ["TIME"] ]
  },
  {
    "id": "C1_02",
    "level": "C1",
    "title": "Christmas in Iceland",
    "content": "Icelandic Christmas traditions are steeped in folklore and are quite distinct from those in the rest of Europe. [1] leads the celebrations is not a single Santa Claus, but thirteen 'Yule Lads'. These mischievous trolls come down from the mountains one by one in the thirteen nights [2] up to Christmas. Children place a shoe on their windowsill, hoping to wake up to a small gift. However, if they have misbehaved, they will find a rotting potato [3] . The Lads are the sons of Grýla, a terrifying ogress. As [4] that were not enough, there is also the Yule Cat, a beast that eats anyone who hasn't received a new piece of clothing. This tradition likely started to encourage farm workers to finish processing wool [5] time for the holidays. Despite their scary origins, these figures are now beloved, adding a unique [6] of mystery to the season. It is certainly a time [7] locals and tourists alike look forward to. The season simply wouldn't be the same [8] them.",
    "answers": [ ["WHAT", "WHO"], ["LEADING"], ["INSTEAD"], ["IF"], ["IN"], ["SENSE", "AIR", "TOUCH"], ["WHICH", "THAT"], ["WITHOUT"] ]
  },
  {
    "id": "C1_03",
    "level": "C1",
    "title": "Vertical Farming",
    "content": "By 2050, the global population will have risen significantly, placing a huge strain on food production. Traditional farming is subject [1] the whims of the weather, but vertical farming offers a solution. By growing crops indoors, farmers can control every variable, [2] an end to the risk of drought or frost. Moreover, these farms can be built in city centres, drastically reducing the distance food travels [3] farm to fork. However, the energy costs involved are substantial. Unless [4] is a major breakthrough in solar efficiency, vertical farms may remain too expensive. Critics argue that [5] than solving the hunger crisis, they will strictly serve the luxury market. Be [6] as it may, the technology is undeniably impressive. It remains to be [7] whether it can feed the world, but it is certainly a step in the right [8] .",
    "answers": [ ["TO"], ["PUTTING"], ["FROM"], ["THERE"], ["RATHER"], ["THAT"], ["SEEN"], ["DIRECTION"] ]
  },
  {
    "id": "C1_04",
    "level": "C1",
    "title": "The Benefits of Bilingualism",
    "content": "Speaking more than one language is often seen as a useful skill for travel, but recent research suggests the benefits go far deeper. It appears that the bilingual brain operates differently [1] that of a monolingual speaker. Constantly switching between languages serves as a form of exercise for the brain, strengthening the area responsible [2] executive functions like problem-solving. Moreover, studies have shown that bilingualism can delay the onset of dementia. It seems that the effort required to suppress one language while speaking the [3] builds up a 'cognitive reserve'. [4] addition to cognitive benefits, there are social advantages. Bilinguals are often better at understanding other people's perspectives, [5] leads to greater empathy. It is never too late to start learning; even adults who pick [6] a new language later in life can experience these positive effects. So, [7] than viewing language learning as a chore, we should see it as an investment. The evidence speaks for [8] .",
    "answers": [ ["FROM", "TO"], ["FOR"], ["OTHER"], ["IN"], ["WHICH"], ["UP"], ["RATHER"], ["ITSELF"] ]
  },
  {
    "id": "C1_05",
    "level": "C1",
    "title": "Remote Working",
    "content": "The concept of working from home is not new, but the scale at which it is happening today is unprecedented. Advancements in technology have [1] it possible for employees to collaborate from opposite sides of the globe. For many, the lack of a daily commute is the biggest advantage, freeing [2] hours of time each week. Additionally, it offers a better work-life balance, allowing parents to spend more time with their children. On the [3] hand, some argue that remote work leads to isolation. Without the casual interactions that take place in an office, team spirit can suffer. There is also the risk of 'burnout', as the boundary [4] work and home life becomes blurred. Many employees find it hard to switch [5] at the end of the day. To combat this, experts suggest creating a dedicated workspace. Whether remote work will replace the traditional office entirely remains to be [6] . However, it is clear that the 'hybrid' model is likely to become the new norm. The way we work has changed [7] good. We must adapt [8] get left behind.",
    "answers": [ ["MADE"], ["UP"], ["OTHER"], ["BETWEEN"], ["OFF"], ["SEEN"], ["FOR"], ["OR"] ]
  },
  {
    "id": "C1_06",
    "level": "C1",
    "title": "KFC for Christmas?",
    "content": "In most parts of the world, a traditional Christmas dinner involves turkey or ham. However, in Japan, the festive meal of choice is Kentucky Fried Chicken. This unique tradition dates [1] to 1974, when KFC launched a marketing campaign called 'Kentucky for Christmas'. At the time, Japan had no established Christmas traditions, so the company filled the void [2] remarkable success. Today, it is [3] popular that families have to order their meals months in advance. The 'party bucket' often includes not just chicken, [4] also cake and wine. While it may seem strange to outsiders, for many Japanese people, Christmas wouldn't be the same [5] it. The Colonel Sanders statues outside the restaurants are even dressed [6] in Santa suits. It serves as a fascinating example of how a commercial brand can integrate [7] into a culture's holiday customs. It just goes to [8] the power of advertising.",
    "answers": [ ["BACK"], ["WITH"], ["SO"], ["BUT"], ["WITHOUT"], ["UP"], ["ITSELF"], ["SHOW", "PROVE"] ]
  },
  {
    "id": "C1_07",
    "level": "C1",
    "title": "The Changing Face of Air Travel",
    "content": "The Golden Age of air travel, characterized by ample legroom and gourmet meals, is largely a thing of the past. Today, flying is often viewed [1] a means to an end rather than a luxury experience. Budget airlines have democratised travel, making it accessible to millions, but this has come at a [2] . Passengers are often subjected to cramped seats and a plethora of extra charges for baggage. Furthermore, the environmental impact of aviation has come [3] intense scrutiny. The concept of 'flight shame' is discouraging people [4] taking unnecessary trips. Consequently, there is a growing demand for cleaner aviation fuels. Engineers are currently working on electric planes, though they are likely years [5] from commercial use. Until then, we must weigh the convenience of flying [6] the carbon footprint it leaves. The industry finds itself at a crossroads, needing to adapt [7] face being grounded by regulations. The future of flight remains up in the [8] .",
    "answers": [ ["AS"], ["PRICE", "COST"], ["UNDER"], ["FROM"], ["AWAY", "OFF"], ["AGAINST"], ["OR"], ["AIR"] ]
  },
  {
    "id": "C1_08",
    "level": "C1",
    "title": "The E-Scooter Debate",
    "content": "Walk through any major European city today, and you are likely to encounter the silent hum of electric scooters. Hailed by many [1] the solution to urban congestion, they offer a quick way to navigate traffic. However, their arrival has not been universally welcomed. The sight of scooters scattered across pavements has drawn the ire of pedestrians, [2] claim they are a tripping hazard. Moreover, the speed [3] which they travel can be alarming. Accidents involving e-scooters are on the rise, leading to calls for stricter regulation. The challenge lies [4] integrating this new mode of transport with existing infrastructure. Roads built for cars are ill-equipped to handle them, [5] are pavements designed for walking. Unless a compromise is [6] , the conflict between riders and pedestrians will escalate. We need to find a way to share our streets [7] endangering anyone. It is a bumpy road [8] .",
    "answers": [ ["AS"], ["WHO"], ["AT"], ["IN"], ["NOR", "NEITHER", "AS"], ["REACHED", "FOUND"], ["WITHOUT"], ["AHEAD"] ]
  },
  {
    "id": "C1_09",
    "level": "C1",
    "title": "Bin Chickens: An Australian Icon?",
    "content": "The Australian White Ibis is a bird that elicits strong reactions. Historically a wetland species, drought and habitat loss forced it to migrate to urban areas. Now, it is a common sight in Sydney, scavenging for food in rubbish bins. [1] from being admired, it is often reviled as a pest. However, ecologists argue that the ibis is simply doing [2] it takes to survive. They have shown remarkable adaptability, learning to open bin lids. In [3] of their poor reputation, they have become a cultural icon. Their resilience is actually quite admirable. They serve [4] a reminder of how wildlife is forced to adapt to human encroachment. Rather [5] viewing them with disgust, perhaps we should view them with a degree of respect. After [6] , it is our waste that sustains them. We have created the perfect environment [7] them to thrive. They are here to stay, whether we like it [8] not.",
    "answers": [ ["FAR"], ["WHAT", "WHATEVER"], ["SPITE"], ["AS"], ["THAN"], ["ALL"], ["FOR"], ["OR"] ]
  },
  {
    "id": "C1_10",
    "level": "C1",
    "title": "Adapting to the Heat",
    "content": "As global temperatures continue to break records, the reality of hotter summers is something we must all adjust to. For countries traditionally accustomed to mild weather, this shift presents [1] significant logistical challenge. Our infrastructure, particularly our housing stock, is designed to retain heat, which becomes a liability [2] temperatures soar. Retrofitting homes with shutters and ventilation is expensive but necessary. Beyond architecture, our daily routines may need to change. The southern European concept of the 'siesta' might [3] become the norm further north. Working during the hottest part of the day could become unsafe. Agriculture is also [4] threat, with crops failing due to drought. Water conservation will move from being a moral choice to a legal [5] . We are entering unchartered territory. Ignoring the problem is no [6] an option. We must adapt our cities and our behaviour to cope with this new thermal reality. The heat is [7] just uncomfortable; it is a warning. We need to act [8] it is too late.",
    "answers": [ ["A"], ["WHEN", "AS", "WHENEVER"], ["WELL"], ["UNDER"], ["REQUIREMENT", "NECESSITY", "OBLIGATION"], ["LONGER"], ["NOT"], ["BEFORE"] ]
  },
  {
    "id": "C1_11",
    "level": "C1",
    "title": "The Art of Algorithms",
    "content": "The emergence of AI image generators has sparked a fierce debate in the art world. On the one hand, these tools allow anyone to create stunning visuals simply by entering a text prompt. It democratises art, allowing those [1] technical skills to express themselves visually. The results can be surreal. On the [2] hand, traditional artists are concerned about copyright. The AI models are trained [3] millions of existing images, often without the consent of the original creators. Is it inspiration, or is it theft? Furthermore, there is the question of authorship; [4] creates the image, the user or the machine? Despite these ethical grey areas, the technology is undeniably fun to play with. It allows us to visualise the impossible, [5] as a city made of cheese. It blurs the line [6] reality and fantasy. Whether it will replace human artists is [7] to be seen. However, it has certainly opened [8] a new frontier in digital creativity.",
    "answers": [ ["WITHOUT", "LACKING", "MISSING"], ["OTHER"], ["ON", "USING", "WITH"], ["WHO"], ["SUCH"], ["BETWEEN"], ["YET"], ["UP"] ]
  },
  {
    "id": "C1_ITALIA_90",
    "level": "C1",
    "title": "Italia '90: A Cultural Watershed",
    "content": "Italia '90 is often cited [1] the tournament that changed the face of modern football. [2] only did it popularize the sport in markets like the US, but it also fused high culture with the beautiful game. Luciano Pavarotti’s rendition of 'Nessun Dorma' became an anthem [3] which the competition is inextricably linked. From an Irish perspective, the team's performance was nothing [4] of miraculous. The squad, led by Jack Charlton, exceeded all expectations by reaching the quarter-finals. [5] did anyone expect the fans to win hearts globally with their good spirits. The legacy of that summer endures, [6] having taken place over three decades ago. It remains a touchstone for nostalgia, reminding us of a time [7] football felt more innocent. Few events have left [8] a lasting mark on the national psyche.",
    "answers": [
      ["AS"],
      ["NOT"],
      ["TO", "WITH"],
      ["SHORT"],
      ["LITTLE", "NEITHER", "NOR", "SCARCELY", "HARDLY"],
      ["DESPITE"],
      ["WHEN", "WHERE"],
      ["SUCH"]
    ]
  },
  {
    "id": "C1_RETURN_IRELAND",
    "level": "C1",
    "title": "The Circular Economy in Action",
    "content": "The introduction of the Deposit Return Scheme in Ireland marks a significant step towards a circular economy. The premise is straightforward: a refundable deposit is charged, which is fully redeemed [1] return of the container. While there was initial skepticism regarding consumer compliance, the uptake has been swift, with return rates soaring [2] expectations. [3] vast is the volume of plastic being collected that recycling targets are being met ahead of schedule. The scheme applies to containers [4] in size from 150ml to 3 litres. Critics argued it would be inconvenient, yet [5] has proven to be quite the opposite for most. Crucial to the success is the reverse vending machine technology, [6] instantly verifies the barcode. [7] the scheme to fail, the environmental consequences would be dire, but fortunately, the public has adapted well. It serves [8] a robust model for other nations to follow.",
    "answers": [
      ["UPON", "ON"],
      ["BEYOND", "ABOVE", "EXCEEDING", "SURPASSING"],
      ["SO"],
      ["RANGING", "VARYING"],
      ["IT"],
      ["WHICH", "THAT"],
      ["WERE"],
      ["AS"]
    ]
  },
  {
    "id": "C1_PARMIGIANO",
    "level": "C1",
    "title": "Strictly Parmesan",
    "content": "True Parmigiano Reggiano is the product of a strict legal definition known as Protected Designation of Origin. The milk utilized must not [1] been refrigerated, ensuring the survival of native bacteria necessary for fermentation. Once the curd is formed, it is cooked and molded into the iconic shape. [2] distinguishes this cheese from imitators is the aging process, which lasts a minimum of 12 months. During maturation, the amino acid tyrosine crystallizes, giving the cheese [3] characteristic crunch. An expert inspector, known as a 'battitore', strikes the wheel to check for defects. Should hollow sounds [4] detected, the wheel is stripped of its markings. [5] is the strictness of the consortium that only perfect wheels bear the official name. This attention to detail accounts [6] the cheese's global reputation. It is widely regarded [7] the 'King of Cheeses'. Few foods depend so heavily [8] tradition and craftsmanship.",
    "answers": [
      ["HAVE"],
      ["WHAT"],
      ["ITS"],
      ["BE"],
      ["SUCH"],
      ["FOR"],
      ["AS"],
      ["UPON", "ON"]
    ]
  },
    {
    "id": "C1_BLUE_MONDAY",
    "level": "C1",
    "title": "The Myth of Blue Monday",
    "content": "The concept of Blue Monday, supposedly the most melancholic day of the year, was coined in 2005. It was originally part [1] a marketing campaign by a travel agency hoping to boost bookings. They claimed to [2] calculated the date using a complex equation. This formula took into account variables [3] as weather conditions, debt levels, and time since Christmas. Despite having [4] basis in actual science, the idea has stuck in the public consciousness. Psychologists have criticized it, arguing that mental health issues should not [5] trivialized in this way. It implies that depression is dictated by the calendar, [6] is simply not true. Nevertheless, every January, the media pays attention [7] this pseudo-event. It seems we enjoy having something to complain [8].",
    "answers": [
      ["OF"],
      ["HAVE"],
      ["SUCH"],
      ["NO", "LITTLE"],
      ["BE"],
      ["WHICH"],
      ["TO"],
      ["ABOUT"]
    ]
  },
  {
    "id": "C1_ALONE_IN_BERLIN",
    "level": "C1",
    "title": "A Masterpiece Rediscovered",
    "content": "For decades, Hans Fallada’s novel 'Alone in Berlin' remained relatively unknown outside Germany. It was not [1] 2009 that an English translation became a surprise bestseller. The story focuses [2] a working-class couple who resist the Nazi regime. What makes the book remarkable is that it was written in [3] 24 days. Fallada wrote it shortly before his death, drawing [4] real Gestapo files for inspiration. The rediscovery of the book has [5] hailed as a major literary event. It reminds us that resistance was possible, even [6] the face of terror. The book sat gathering dust for years, which is [7] shame given its power. Now, it is recognized as a masterpiece [8] deserves to be read by future generations.",
    "answers": [
      ["UNTIL"],
      ["ON", "UPON"],
      ["JUST", "ONLY"],
      ["ON", "UPON"],
      ["BEEN"],
      ["IN"],
      ["A"],
      ["THAT", "WHICH"]
    ]
  },
  {
    "id": "C1_DOG_SMELL",
    "level": "C1",
    "title": "A World of Scent",
    "content": "A dog’s sense of smell is a marvel of nature. It is estimated that their olfactory ability is up to 100,000 times more acute [1] our own. This is partly due to the way their nostrils function independently, allowing [2] to determine the direction of a scent. Furthermore, dogs possess a structure called Jacobson’s organ, [3] detects specific chemicals like pheromones. This allows them to communicate [4] one another without making a sound. When a dog sniffs, the air is separated; some goes to the lungs, while the rest is analyzed [5] the brain. [6] only can they track physical items, but they can also detect changes in human emotions. It is this unique capability [7] makes them invaluable in search and rescue operations. We are only just beginning to understand [8] complex their sensory world is.",
    "answers": [
      ["THAN"],
      ["THEM"],
      ["WHICH", "THAT"],
      ["WITH"],
      ["BY"],
      ["NOT"],
      ["THAT"],
      ["HOW"]
    ]
  },
    {
    "id": "C1_TABLET_BIRTH",
    "level": "C1",
    "title": "The Birth of the Tablet",
    "content": "When the iPad was unveiled in 2010, it took the tech world [1] storm. However, the concept of a tablet computer was far from new, with prototypes dating [2] to the 1980s. Microsoft had launched a version a decade earlier, but it failed to catch on due to a [3] of user-friendly software. Apple succeeded [4] others had stumbled by focusing entirely on the touch interface. The device bridged the [5] between the smartphone and the laptop, creating a completely new category of electronics. Critics initially dismissed it, claiming there was [6] market for such a gadget. [7] did they know that it would revolutionize how we consume media. Today, tablets are [8] to stay, becoming essential tools for education and business.",
    "answers": [
      ["BY"],
      ["BACK"],
      ["LACK"],
      ["WHERE"],
      ["GAP"],
      ["NO"],
      ["LITTLE"],
      ["HERE"]
    ]
  },
  {
    "id": "C1_DATA_PRIVACY",
    "level": "C1",
    "title": "The Cost of Connection",
    "content": "In the digital age, we often prioritize convenience [1] the expense of privacy. We accept cookies on websites without [2] it a second thought, eager to access content immediately. [3] do we stop to read the terms and conditions in full. As a result, our personal information is often sold [4] to advertisers and third parties. There is a real risk that this data could fall [5] the wrong hands. Identity theft is [6] the rise, affecting millions of users annually. Those [7] accounts have been compromised often report feeling violated and helpless. [8] we take action to secure our digital footprint, these problems will only persist.",
    "answers": [
      ["AT"],
      ["GIVING"],
      ["RARELY", "SELDOM", "SCARCELY", "HARDLY"],
      ["ON"],
      ["INTO"],
      ["ON"],
      ["WHOSE"],
      ["UNLESS"]
    ]
  },
  {
    "id": "C1_HOT_SAUCE",
    "level": "C1",
    "title": "Feeling the Burn",
    "content": "In recent years, the humble hot sauce has experienced an explosion [1] popularity. This surge can be partly put [2] to the rise of internet shows where celebrities eat increasingly spicy wings. People seem to enjoy pushing themselves to the [3], testing their tolerance for pain. The brain releases endorphins in response [4] the heat, creating a natural high. Artisan sauces now range [5] the mildly tangy to the dangerously spicy. Some are [6] hot that they require a legal waiver to consume. It has evolved from a simple condiment into a collector's item, [7] bottles trading for high prices. There appears to be no [8] to the public's appetite for fire.",
    "answers": [
      ["IN", "OF"],
      ["DOWN"],
      ["LIMIT", "EXTREME", "BRINK", "EDGE"],
      ["TO"],
      ["FROM"],
      ["SO"],
      ["WITH"],
      ["END", "LIMIT"]
    ]
  },
  {
    "id": "C1_NAPOLEONIC_REENACTMENT",
    "level": "C1",
    "title": "Living History",
    "content": "Every June, thousands of enthusiasts travel to Belgium to [1] tribute to the soldiers of the Battle of Waterloo. They strive to ensure every detail is [2] keeping with the period, from buttons to boots. [3] is the dedication of the participants that they often camp in the mud, refusing modern comforts. The air is filled [4] the smell of gunpowder as cannons are fired. Spectators watch as [5] they were witnessing real history unfold before their eyes. [6] from the battle itself, they also recreate the daily life of the camps. It requires [7] great deal of money to maintain the equipment. However, the reenactors consider it [8] worth the expense to keep the past alive.",
    "answers": [
      ["PAY"],
      ["IN"],
      ["SUCH"],
      ["WITH"],
      ["IF", "THOUGH"],
      ["APART", "ASIDE"],
      ["A"],
      ["WELL"]
    ]
  },
  {
    "id": "C1_TOLSTOY_DEATH",
    "level": "C1",
    "title": "The Last Station",
    "content": "The final days of Leo Tolstoy were far [1] peaceful. At the age of 82, the great writer fled his home [2] the dead of night. He sought to escape the stifling atmosphere of his estate and his troubled marriage. He journeyed by train but was forced to stop at a small station [3] to a sudden illness. The station master took him in, but the press soon descended [4] the location. It turned [5] a media circus, with cameras filming his every move. His wife arrived but was [6] from seeing him by his devoted followers. [7] he remained at home, he might have died in relative comfort. Instead, he passed away in a stranger's bed, [8] finally found the liberation he craved.",
    "answers": [
      ["FROM"],
      ["IN"],
      ["DUE", "OWING"],
      ["UPON", "ON"],
      ["INTO"],
      ["PREVENTED", "STOPPED", "KEPT", "BARRED", "BLOCKED"],
      ["HAD"],
      ["HAVING"]
    ]
  },
  {
    "id": "C1_ACADEMIA_BRITANICA",
    "level": "C1",
    "title": "A Legacy of Language",
    "content": "The Academia Británica in Córdoba is not merely a language school; it is a piece of history. Founded in 1953 by John and Brita Haycraft, it is recognized [1] the birthplace of the International House World Organization. The couple arrived in Córdoba and, captivated [2] the city's charm, decided to stay. They set [3] the school in a small room, initially teaching just a handful of students. However, their innovative methods soon took [4], revolutionizing how languages were taught. [5] it not for their pioneering spirit, the global landscape of language education might look very different. The school was later passed to the Cremades family, under [6] stewardship it has continued to flourish. [7] having operated for over seven decades, it remains a leader in its field. It stands as a testament [8] the power of cultural exchange.",
    "answers": [
      ["AS"],
      ["BY"],
      ["UP"],
      ["OFF"],
      ["WERE"],
      ["WHOSE"],
      ["DESPITE"],
      ["TO"]
    ]
  },
   {
    "id": "C1_KAS_CYCLING",
    "level": "C1",
    "title": "The Yellow and Blue Army",
    "content": "The KAS cycling team remains one of the most iconic squads in the history of the sport. Instantly recognizable [1] virtue of their yellow and blue jerseys, they were a dominant force in the peloton. Their resurgence in the 1980s can be put [2] to the arrival of Irish legend Sean Kelly. [3] only did Kelly secure victories in the Classics, but he also captured the Vuelta a España title. The team's strategy often relied on brute strength, wearing rivals down [4] relentless attacks. [5] it not been for the untimely death of the team owner, their reign might have continued well into the 90s. Today, the kit is considered a collector's item, highly sought [6] by enthusiasts. It represents a golden era [7] cycling was defined by grit and determination. Few teams have left [8] a lasting impression on the collective memory of fans.",
    "answers": [
      ["BY"],
      ["DOWN"],
      ["NOT"],
      ["WITH", "UNDER"],
      ["HAD"],
      ["AFTER"],
      ["WHEN", "WHERE"],
      ["SUCH"]
    ]
  },
    {
    "id": "C1_PLUTO_REVISITED",
    "level": "C1",
    "title": "Pluto: A Planet No More?",
    "content": "Once considered the ninth planet, Pluto's controversial demotion in 2006 was met [1] widespread debate. However, the New Horizons mission later revealed a world far more complex [2] anyone had imagined. [3] did we expect to find active geology on such a small, cold body. It turned [4] to be a dynamic landscape with mountains of ice. [5] it not for this mission, we would still view it as a frozen, dead rock. It is [6] no means inactive, possessing a nitrogen atmosphere. It orbits the sun at a vast distance, [7] accounts for its frigid temperatures. Whether it should be reinstated as a planet is a matter of opinion, but it is certainly a world [8] its own right.",
    "answers": [
      ["WITH"],
      ["THAN"],
      ["LITTLE"],
      ["OUT"],
      ["WERE", "HAD"],
      ["BY"],
      ["WHICH"],
      ["IN"]
    ]
  },
  {
    "id": "C1_STREAMING_WARS",
    "level": "C1",
    "title": "The Fragmented Screen",
    "content": "The television landscape has undergone a seismic shift, largely brought [1] by the advent of streaming. We are [2] longer beholden to broadcast schedules, consuming content on demand. However, the market is becoming saturated, leaving viewers overwhelmed [3] choice. Subscribing to every platform can amount [4] a small fortune, often exceeding the cost of traditional cable. It is often a case of quantity [5] than quality, with endless lists of mediocre shows. [6] you to cancel your subscription, you might miss out on the latest cultural phenomenon. It remains to be seen [7] this fragmentation is sustainable in the long run. We are undeniably spoiled [8] content, but at a price.",
    "answers": [
      ["ABOUT"],
      ["NO"],
      ["WITH", "BY"],
      ["TO"],
      ["RATHER"],
      ["SHOULD", "WERE"],
      ["WHETHER", "IF"],
      ["FOR"]
    ]
  },
  {
    "id": "C1_BUTTERFLY_MIGRATION",
    "level": "C1",
    "title": "The Monarch's Journey",
    "content": "The Monarch butterfly completes a migration [1] distance is unrivaled in the insect world. They travel thousands of miles, navigating [2] means of an internal compass linked to the sun. What makes it remarkable is that no single individual makes the entire trip; it takes several generations to [3] so. They are currently [4] threat from habitat loss and climate change. Conservationists warn that [5] action is taken immediately, the species could face extinction. Their decline is largely blamed [6] the destruction of milkweed plants. We must preserve the habitat [7] which they cannot survive. They are [8] vital importance to the pollination of our ecosystems.",
    "answers": [
      ["WHOSE"],
      ["BY"],
      ["DO"],
      ["UNDER"],
      ["UNLESS"],
      ["ON", "UPON"],
      ["WITHOUT"],
      ["OF"]
    ]
  },
  {
    "id": "C1_1984_RELEVANCE",
    "level": "C1",
    "title": "Orwell's Warning",
    "content": "George Orwell's masterpiece '1984' is arguably more relevant today [1] ever before. He depicted a dystopian society stripped [2] privacy, where independent thought is a crime. The term 'Orwellian' has entered the lexicon, referring to a state [3] surveillance is total and inescapable. [4] only did he predict the use of cameras, but also the manipulation of truth by those in power. It serves [5] a stark warning about the dangers of totalitarianism. [6] we to ignore his message, we do so at our own peril. It is [7] doubt one of the most prophetic books of the 20th century. It remains a testament [8] his genius.",
    "answers": [
      ["THAN"],
      ["OF"],
      ["WHERE"],
      ["NOT"],
      ["AS"],
      ["WERE"],
      ["WITHOUT"],
      ["TO"]
    ]
  },
  {
    "id": "C1_GENETICS_CRISPR",
    "level": "C1",
    "title": "Editing Life",
    "content": "CRISPR technology has placed us [1] the brink of a medical revolution. The potential to cure hereditary diseases is immense, but [2] are the ethical risks involved. We must seriously consider [3] we have the moral right to alter the human genome. [4] implies that we could eventually design humans to specification. The technology is [5] from perfect and could introduce unintended mutations. We must ensure it is used for the benefit of [6], rather than becoming a luxury for the wealthy. [7] should we allow such powerful tools to go unregulated. It is a topic that remains open [8] fierce debate.",
    "answers": [
      ["ON", "AT"],
      ["SO"],
      ["WHETHER", "IF"],
      ["IT"],
      ["FAR"],
      ["ALL"],
      ["NOR", "NEITHER"],
      ["TO"]
    ]
  },
  {
    "id": "C1_BIRO_HISTORY",
    "level": "C1",
    "title": "The Ballpoint Revolution",
    "content": "László Bíró, a Hungarian journalist, is the man responsible [1] the invention of the modern ballpoint pen. He noticed that newspaper ink dried quickly, unlike the ink [2] was used in traditional fountain pens. He fled the Nazis during World War II, eventually settling [3] Argentina. It was the Royal Air Force [4] helped bring the pen to global prominence. They required a writing instrument that would not leak [5] high altitudes. [6] successful was the design that it became the standard for aircrews. Today, the brand name has become synonymous [7] the object itself in many parts of the world. It is hard to imagine daily life [8] it.",
    "answers": [
      ["FOR"],
      ["WHICH"],
      ["IN"],
      ["THAT", "WHO"],
      ["AT"],
      ["SO"],
      ["WITH"],
      ["WITHOUT"]
    ]
  },
  {
    "id": "C1_STEALTH_BOMBER",
    "level": "C1",
    "title": "The Invisible Plane",
    "content": "The B-2 Spirit is a marvel of engineering, designed to be hidden [1] radar. Its unique 'flying wing' shape allows it to slip through defenses undetected, [2] giving it a significant strategic advantage. The cost of the program was astronomical, amounting [3] billions of dollars per aircraft. [4] its massive size, it is incredibly quiet and difficult to track. It utilizes advanced materials capable [5] absorbing radar waves. Only a small number were ever built, largely [6] to the immense expense of production and maintenance. It looks [7] something from a science fiction movie rather than a military jet. It remains [8] service today as a key part of the US Air Force.",
    "answers": [
      ["FROM"],
      ["THEREBY", "THUS"],
      ["TO"],
      ["DESPITE"],
      ["OF"],
      ["DUE", "OWING"],
      ["LIKE"],
      ["IN"]
    ]
  },
  {
    "id": "C1_ARUBA_GEOGRAPHY",
    "level": "C1",
    "title": "One Happy Island",
    "content": "Located in the southern Caribbean, Aruba differs [1] many of its neighbors in terms of climate. It lies outside the main hurricane belt, meaning it is rarely struck [2] the violent storms that affect the region. The climate is arid, giving [3] to a desert-like landscape filled with cacti rather than rainforests. It was historically a Dutch colony, the influence of [4] is still visible in the architecture and language. Tourism is the mainstay of the economy, accounting [5] a large percentage of the island's GDP. The island prides itself [6] its pristine white sandy beaches and calm waters. [7] matter when you visit, the sun is almost guaranteed to be shining. It is a destination like [8] others.",
    "answers": [
      ["FROM"],
      ["BY"],
      ["RISE"],
      ["WHICH"],
      ["FOR"],
      ["ON"],
      ["NO"],
      ["FEW"]
    ]
  },
  {
    "id": "C1_HIPPIES_HISTORY",
    "level": "C1",
    "title": "The Flower Children",
    "content": "The counterculture movement of the 1960s, known [1] the hippie movement, changed the cultural landscape forever. It began in the United States before spreading [2] other parts of the Western world. Participants rebelled [3] the conservative values of the post-war generation. The movement reached its peak [4] the famous 'Summer of Love' in 1967. [5] having a reputation for laziness, many hippies were politically active and organized protests. They opposed the Vietnam War, calling [6] peace and love instead of conflict. Their fashion style, characterized [7] tie-dye clothing and long hair, remains iconic. They paved the [8] for the modern environmental and civil rights movements.",
    "answers": [
      ["AS"],
      ["TO"],
      ["AGAINST"],
      ["WITH", "DURING"],
      ["DESPITE"],
      ["FOR"],
      ["BY"],
      ["WAY"]
    ]
  },
  {
    "id": "C1_AIR_TRAVEL",
    "level": "C1",
    "title": "The Modern Passenger",
    "content": "Modern air travel is often an endurance test rather [1] a luxury experience. Passengers are frequently packed into seats with [2] or no legroom. Airlines now charge for extras that used to be included, [3] as luggage and meals. There is nothing worse than being stuck next to a screaming infant, through [4] fault of the parents. However, we must [5] in mind that the ability to fly is a technological miracle. [6] were we to drive the same distance, the journey would take days. It is statistically the safest mode of transport, [7] to popular belief and fear of flying. We should be grateful [8] the opportunity to traverse the globe so easily.",
    "answers": [
      ["THAN"],
      ["LITTLE"],
      ["SUCH"],
      ["NO"],
      ["BEAR", "KEEP"],
      ["WERE"],
      ["CONTRARY"],
      ["FOR"]
    ]
  },
  {
    "id": "C2_01",
    "level": "C2",
    "title": "The Nature of Memory",
    "content": "Memory is often likened to a video recorder, yet this analogy bears [1] resemblance to reality. Far [2] being a static archive, memory is a dynamic, reconstructive process. Every time we recall an event, we essentially rewrite it, unconsciously adding or removing details. Were [3] not for this malleability, we might be trapped by our pasts, unable to move on. However, this also makes eyewitness testimony notoriously unreliable. No [4] had the crime been committed than three witnesses gave three contradictory descriptions. This discrepancy is often [5] to the power of suggestion; a leading question can plant a false memory with alarming ease. We must, therefore, take our recollections with a [6] of salt. What we remember is often a blend of fact and fiction, designed more for creating a coherent narrative [7] for preserving the [8] truth.",
    "answers": [ ["LITTLE", "NO"], ["FROM"], ["IT"], ["SOONER"], ["DUE", "DOWN"], ["PINCH", "GRAIN"], ["THAN"], ["WHOLE", "ABSOLUTE"] ]
  },
  {
    "id": "C2_02",
    "level": "C2",
    "title": "The Art of Translation",
    "content": "Translation is a discipline that requires far more than a dictionary; it demands a deep understanding of cultural nuance. A literal translation often falls [1] , failing to convey the humor or emotion of the original. Ideally, a translator should be invisible, ensuring the new text reads [2] if it were written in the target language. However, some concepts are uniquely tied to their culture. [3] is the complexity of certain idioms that they simply cannot be transposed. In such cases, the translator must take liberties, prioritising the spirit of the text [4] the letter. It stands to [5] that poetry is the hardest form to translate, as the sound is as vital as the meaning. Suffice it to [6] , it is an art form in its own right. We should pay tribute to these linguistic bridges, without [7] literature would remain trapped behind national borders. They are the unsung heroes of the literary [8] .",
    "answers": [ ["FLAT", "SHORT"], ["AS"], ["SUCH"], ["OVER"], ["REASON"], ["SAY"], ["WHICH", "WHOM"], ["WORLD", "SPHERE"] ]
  },
  {
    "id": "C2_03",
    "level": "C2",
    "title": "Restoring Old Masterpieces",
    "content": "The restoration of ancient art is a field fraught with controversy. The question [1] to how far a restorer should intervene is fiercely debated. Should they merely clean the surface, or repair the damage of centuries? Over time, varnish oxidises, turning yellow and obscuring the artist's original intent. Stripping this layer away can reveal colours so vivid they take the viewer [2] surprise. However, critics argue that this patina of age is part of the work's history and should be left [3] . There is also the risk of over-cleaning; for [4] of damaging the paint, modern restorers operate with extreme caution. They use materials that are reversible, so that [5] future generations disagree with their methods, the work can be undone. It is [6] from an easy task. Ultimately, the goal is to present the work in a state as [7] to the original as possible, while respecting the passage of time. It requires the hand of an artist and the mind of a scientist [8] equal measure.",
    "answers": [ ["AS"], ["BY"], ["ALONE", "INTACT", "UNTOUCHED"], ["FEAR"], ["SHOULD"], ["FAR"], ["CLOSE", "NEAR"], ["IN"] ]
  },
  {
    "id": "C2_04",
    "level": "C2",
    "title": "The Decline of Silence",
    "content": "In our hyper-connected world, true silence has become a rare commodity. We are bombarded by a constant stream of notifications, traffic, and background music, to the [1] where silence can feel unsettling. Yet, silence is essential for cognitive regeneration. Research indicates that the brain requires periods of quiet to consolidate memory and emotion. Without it, we exist in a state of chronic cognitive load, unable to think deeply. It is [2] wonder that practices like meditation are surging in popularity; we are seemingly desperate to reclaim a sense of peace. Some have gone so [3] as to pay for 'silent retreats', where speech is forbidden. It seems paradoxical that we must pay for something that was once free. [4] doubt, technology has brought many benefits, but it has also eroded our private mental space. We must set [5] moments of stillness in our day. [6] is at stake is nothing less than our mental health. Silence is not empty; it is full [7] answers. We need only listen [8] them.",
    "answers": [ ["POINT"], ["LITTLE", "SMALL", "NO"], ["FAR"], ["WITHOUT"], ["ASIDE"], ["WHAT"], ["OF"], ["TO"] ]
  },
  {
    "id": "C2_05",
    "level": "C2",
    "title": "The Future of Flight",
    "content": "Aviation stands on the precipice of a major transformation. For decades, the focus was purely on speed and capacity, but the climate crisis has shifted the paradigm entirely. The industry is under immense pressure to decarbonise, a task [1] is easier said than done. Electric batteries, while promising for short hops, are currently too heavy for long-haul flights. Hydrogen offers a potential solution, yet the infrastructure required to support it is virtually non-existent. [2] technological hurdles, there is the issue of cost. Green aviation will almost certainly come with a higher price tag. We may see a return to a time when flying was a rare luxury. Furthermore, the concept of supersonic travel is experiencing a renaissance. New designs promise to muffle the sonic boom, [3] overland flights feasible. However, this seems at [4] with the sustainability agenda. [5] we can reconcile our desire to travel with the health of the planet is the defining question. Radical change is not just desirable; it is [6] . The skies of tomorrow will look very different [7] those of today. We must brace ourselves for [8] turbulence ahead.",
    "answers": [ ["WHICH", "THAT"], ["BESIDES", "DESPITE"], ["MAKING"], ["ODDS"], ["WHETHER", "HOW"], ["IMPERATIVE", "ESSENTIAL", "UNAVOIDABLE"], ["FROM", "TO"], ["SOME"] ]
  },
  {
    "id": "C2_06",
    "level": "C2",
    "title": "Citizen Science",
    "content": "The term 'citizen science' refers to the involvement of the general public in data collection for scientific projects. Historically, science was the preserve of the elite, but the digital age has democratised the field to an extent previously [1] of. Today, ordinary people can contribute to complex studies by tracking bird migrations or classifying galaxies online. This massive workforce allows scientists to process data at a speed that would otherwise be impossible. [2] from being a cost-cutting exercise, this collaboration fosters a deeper public understanding of scientific methods. However, concerns have been [3] regarding the quality of data collected by amateurs. Can a hobbyist be relied upon to be as rigorous as a professional? To mitigate this, strict verification protocols are put [4] place. The consensus is that the benefits far outweigh the risks. Had it not been [5] citizen scientists, many recent environmental changes might have gone unnoticed. It serves [6] a reminder that we all have a stake in understanding our world. We should [7] no account dismiss the contributions of the enthusiast. Science is, after [8] , a collective endeavour.",
    "answers": [ ["UNDREAMED"], ["FAR"], ["RAISED", "VOICED"], ["IN"], ["FOR"], ["AS"], ["ON"], ["ALL"] ]
  },
  {
    "id": "C2_07",
    "level": "C2",
    "title": "Micromobility and the City",
    "content": "The proliferation of dockless electric scooters represents a paradigm shift in urban micromobility. Ostensibly, they offer a panacea for the 'last mile' problem, bridging the [1] between public transport hubs and final destinations. Advocates laud them for reducing reliance on private cars and lowering emissions. However, their integration into the urban fabric has been anything [2] seamless. The haphazard abandonment of vehicles on thoroughfares constitutes a significant nuisance. Furthermore, the legal status of riders often occupies a grey area, complicating liability in the [3] of accidents. City planners are scrambling to retrofit infrastructure that was never designed with such devices in [4] . We are witnessing a clash between disruptive technology and civic order. To ban them would be to stifle innovation, yet to allow them unfettered access is to invite chaos. A regulatory framework that balances safety [5] utility is urgently required. The scooter phenomenon forces us to reimagine who the streets belong to. They are a litmus test for our adaptability. Ultimately, the success of micromobility rests [6] our ability to foster a culture of mutual respect. Until then, the pavement remains a battleground. It is a bumpy ride in [7] respects than [8] .",
    "answers": [ ["GAP"], ["BUT"], ["EVENT"], ["MIND"], ["WITH", "AND"], ["ON", "UPON"], ["MORE"], ["ONE"] ]
  },
  {
    "id": "C2_08",
    "level": "C2",
    "title": "Synanthropes: Wildlife in the Concrete Jungle",
    "content": "We tend to view cities as devoid of nature, yet a specific class of animals, known as synanthropes, flourishes alongside us. The Ring-necked Parakeet in London is a prime example. Originally from the Himalayas, these birds have not merely survived in the urban sprawl; they have [1] . Their success lies in their cognitive flexibility; they exploit our waste and our warmth. While their vibrant plumage is aesthetically pleasing, their presence is not without controversy. They are aggressive competitors, often displacing native species [2] nesting sites. This raises uncomfortable questions about what constitutes 'natural' in the Anthropocene. Are they invasive aliens to be culled, or pioneers to be admired? Our reaction to them reveals much about our own relationship with the environment. We appreciate nature [3] so long as it adheres to our rules. When it becomes noisy or messy, our tolerance wanes. Yet, these birds mirror our own success; they are adaptable, opportunistic, and loud. They are the ultimate urbanites. To wish them [4] is futile. We must learn to coexist with the biodiversity we have inadvertently created. The city is an ecosystem in its [5] right. We are not the [6] inhabitants. We must learn to share, [7] we like it or [8] .",
    "answers": [ ["THRIVED", "FLOURISHED", "PROSPERED"], ["FROM"], ["ONLY"], ["AWAY"], ["OWN"], ["SOLE", "ONLY"], ["WHETHER"], ["NOT"] ]
  },
  {
    "id": "C2_09",
    "level": "C2",
    "title": "The Urban Heat Island Effect",
    "content": "As climatic patterns shift, our cities are becoming thermal traps, a phenomenon known as the Urban Heat Island effect. Concrete and asphalt absorb solar radiation by day and re-radiate it by night, preventing the city [1] cooling down. This creates a microclimate significantly hotter than the surrounding countryside. The implications for public health are profound. We are facing a future where heatwaves are not anomalies [2] the norm. Architectural responses are evolving; green roofs and reflective surfaces are moving from niche to mainstream. However, mitigation is only half the battle; adaptation is equally crucial. We may see a restructuring of the working day, or a redesign of public spaces to prioritise shade. The era of the glass-facade skyscraper, essentially a greenhouse, may well be [3] . We must build with the climate, not [4] it. The resilience of our urban centres depends on it. Water management, too, will become a defining issue of the century. We can no [5] take a temperate climate for granted. The city of the future must be a cool refuge. Failure to act will result [6] large swathes of our urban environment becoming [7] but uninhabitable. We must act [8] it is too late.",
    "answers": [ ["FROM"], ["BUT"], ["OVER", "ENDED"], ["AGAINST"], ["LONGER"], ["IN"], ["ALL", "ANYTHING"], ["BEFORE"] ]
  },
  {
    "id": "C2_10",
    "level": "C2",
    "title": "Generative AI and Creativity",
    "content": "The advent of generative AI models capable of synthesizing images from textual prompts has precipitated an ontological crisis in the arts. For centuries, the act of creation was inextricably linked to human agency and technical skill. AI ruptures this link, allowing for the instantaneous manifestation of visual ideas. Proponents hail this as a liberation of imagination, a tool that transcends the [1] of manual dexterity. Detractors, however, view it as an existential threat, a commodification of the soul. The legal labyrinth regarding copyright is equally complex; does an algorithm infringe on the rights of the artists whose work it digested? We are forced to interrogate the very definition of 'art'. Is it the process or the product that [2] ? If a machine can move us to tears, is the emotion any less valid? The genie is well and truly out of the [3] . Rather than resisting, we might be better served by exploring the new hybrid forms of creativity that emerge. It acts as a mirror, reflecting our collective visual culture back at us, often in distorted ways. It is a tool of infinite potential and [4] risk. We are the curators of this new synthetic reality. It is a brave new world, [5] we are ready for it or [6] . It is [7] to us to define the parameters. The future is [8] written.",
    "answers": [ ["LIMITATIONS", "CONSTRAINTS", "LIMITS"], ["MATTERS", "COUNTS"], ["BOTTLE"], ["INHERENT", "CONSIDERABLE"], ["WHETHER"], ["NOT"], ["UP", "DOWN"], ["BEING"] ]
  },
  {
    "id": "C2_11",
    "level": "C2",
    "title": "The Winter Solstice and Christmas",
    "content": "The placement of Christmas in late December is no coincidence; it aligns almost perfectly with the winter solstice. For ancient cultures, this was a pivotal time, marking the shortest day and the turning [1] towards the return of the sun. The Romans celebrated Saturnalia, a riotous festival of overturning social norms, [2] which slaves were served by their masters. Many customs we associate with Christmas, such as greenery and feasting, have their [3] in these pagan observances. The church, rather than suppressing these deep-rooted traditions, opted to co-opt them. By assigning the birth of Christ to this date, they ensured a smoother transition for converts. Thus, Christmas is a hybrid festival, a tapestry woven from various threads of history. [4] the theological significance is paramount for believers, the underlying rhythm is one of seasonal renewal. It speaks to a primal human need to find light in the darkness. Even in our secular age, this urge remains as [5] as ever. We gather, we light fires, and we feast, just [6] our ancestors did. It is a celebration of survival [7] much as faith. The solstice reminds us that even the longest night must [8] way to dawn.",
    "answers": [ ["POINT"], ["DURING", "IN"], ["ROOTS", "ORIGINS"], ["WHILE", "ALTHOUGH", "WHILST"], ["STRONG", "POWERFUL"], ["LIKE", "AS"], ["SO"], ["GIVE"] ]
  },
  {
  "id": "C2_COFFEE_SPAIN_V2",
  "level": "C2",
  "title": "The Spanish Roast Renaissance",
  "content": "For decades, the *torrefacto* method—glazing beans with sugar—has [1] sway over Spanish coffee culture. Its prevalence is due to a process [2] roots lie in the 1940s, a practice born [3] of necessity to preserve the harvest. [4] sooner had the 'Third Wave' movement reached Spain, however, than local palates began to shift. Consumers are no [5] willing to put up with the harsh bitterness of burnt sugar. The demand for specialty roasts has taken off in [6], with artisan cafés springing up in major cities. Purists insist that the bean [7] treated with respect, arguing that sugar merely masks the flavor. It is an ambitious cultural shift, [8] that *torrefacto* has been the norm for generations.",
  "answers": [
    ["HELD"],
    ["WHOSE"],
    ["OUT"],
    ["NO"],
    ["LONGER"],
    ["EARNEST"],
    ["BE"],
    ["GIVEN", "CONSIDERING", "SEEING"]
  ]
  },
  {
    "id": "C2_ITALIA_90",
    "level": "C2",
    "title": "A Nation Holds its Breath",
    "content": "The 1990 World Cup remains a watershed moment in Irish cultural history, an event [1] significance extends far beyond the football pitch. It was a time when the nation, [2] relatively insular, seemed to open itself up to the wider world. The team's journey to the quarter-finals was nothing [3] of miraculous, given their underdog status. [4] sooner had the tournament begun than the entire country was gripped by a collective euphoria. [5] it not for the penalty shootout heartbreak against Italy, who knows how far they might have gone? [6] did the fans know that this summer would define a generation. It is remembered not so [7] for the technical quality of the football, as for the spirit of the occasion. It was a summer like [8] other.",
    "answers": [
      ["WHOSE"],
      ["HITHERTO", "PREVIOUSLY", "FORMERLY"],
      ["SHORT"],
      ["NO"],
      ["WERE"],
      ["LITTLE"],
      ["MUCH"],
      ["NO"]
    ]
  },
  {
    "id": "C2_RETURN_IRELAND",
    "level": "C2",
    "title": "The Economics of Return",
    "content": "The implementation of the Deposit Return Scheme in Ireland represents a paradigm shift in consumer behavior. The system operates on the premise that placing a monetary value on waste incentivizes collection, [1] closing the loop in the product lifecycle. [2] initially met with some grumbles regarding storage and convenience, the public has largely adapted. The onus is squarely [3] the consumer to preserve the integrity of the container; [4] the barcode be damaged, the machine will reject it. It is not so [5] a tax as a refundable deposit, designed to discourage littering. The scheme has proven effective, [6] the logistical challenges faced by smaller retailers. [7] it plastic or aluminum, the material is diverted from landfill. We must not lose [8] of the fact that reduction is as important as recycling.",
    "answers": [
      ["THEREBY", "THUS"],
      ["ALBEIT", "THOUGH", "ALTHOUGH", "WHILE"],
      ["ON", "UPON"],
      ["SHOULD"],
      ["MUCH"],
      ["NOTWITHSTANDING", "DESPITE"],
      ["BE"],
      ["SIGHT", "TRACK"]
    ]
  },
  {
    "id": "C2_PARMIGIANO",
    "level": "C2",
    "title": "The Strict Laws of Cheese",
    "content": "The production of Parmigiano Reggiano is governed by regulations of draconian strictness. The cattle must be fed on locally grown forage, to the [1] of fermented silage, which could interfere with the aging process. The milk is used raw, [2] the delicate native flora be destroyed by heat. [3] distinguishes this cheese is the formation of tyrosine crystals, giving it that characteristic crunch. During the inspection, a master grader taps the wheel; [4] any hollow sounds to be detected, the wheel would be stripped of its official markings. It is [5] by no means a rapid process, requiring a minimum of 12 months. The resulting flavor is savory and complex, [6] anything else in the dairy world. It acts [7] a flavor enhancer in countless dishes. It is revered globally, and [8] so.",
    "answers": [
      ["EXCLUSION"],
      ["LEST", "OTHERWISE", "OR"],
      ["WHAT"],
      ["WERE"],
      ["BY"],
      ["UNLIKE"],
      ["AS"],
      ["RIGHTLY", "JUSTIFIABLY", "DESERVEDLY"]
    ]
  },
    {
    "id": "C2_BLUE_MONDAY",
    "level": "C2",
    "title": "The Pseudoscience of Sadness",
    "content": "The designation of the third Monday in January as 'Blue Monday' is a striking example of pseudoscience entering the mainstream. Born [1] of a PR stunt, the concept relies on a nonsensical formula lacking [2] scientific credibility whatsoever. Academics have poured scorn on the idea, warning that it risks trivializing clinical depression. [3] harmful is this narrative that charities actively campaign against it. The suggestion that our mood is predetermined by the calendar is [4] absurd and dangerous. [5] we to take it seriously, we would have to ignore individual circumstances entirely. The irony is that by telling people they [6] to feel miserable, we may create a self-fulfilling prophecy. We would do [7] to ignore such fabrications. Ultimately, a day is only [8] bad as we perceive it to be.",
    "answers": [
      ["OUT"],
      ["ANY", "ALL"],
      ["SO"],
      ["BOTH"],
      ["WERE"],
      ["OUGHT"],
      ["WELL", "BETTER"],
      ["AS"]
    ]
  },
  {
    "id": "C2_ALONE_IN_BERLIN",
    "level": "C2",
    "title": "Everyman's Resistance",
    "content": "The publishing history of 'Alone in Berlin' is almost as dramatic as the plot itself. Written in a feverish sprint by Hans Fallada in 1947, the manuscript lay neglected for over half a century before finding a global audience. Primo Levi, [1] stranger to the horrors of the era, described it as the greatest book ever written about German resistance. The protagonists, the Quangels, wage a silent war, [2] sole weapon being the postcard. It is a study in the banality of evil, but also the quiet dignity of defiance. [3] it not been for the rediscovery, this masterpiece might have been lost forever. The fact that it resonates so [4] with modern readers is a testament to its quality. It is rare for a book to bridge [5] a gap in time. Fallada depicts a world where trust has eroded, [6] neighbor turns against neighbor. It is [7] doubt one of the most significant literary resurrections of recent times. It serves [8] a reminder of the power of the written word.",
    "answers": [
      ["NO"],
      ["THEIR"],
      ["HAD"],
      ["STRONGLY", "DEEPLY", "POWERFULLY"],
      ["SUCH"],
      ["WHERE"],
      ["WITHOUT"],
      ["AS"]
    ]
  },
  {
    "id": "C2_DOG_SMELL",
    "level": "C2",
    "title": "The Olfactory Umwelt",
    "content": "The canine olfactory system is an apparatus of baffling complexity. To say a dog smells better than a human is a gross understatement; they inhabit an entirely different sensory reality, or 'Umwelt'. [1] to us is a simple breeze, is to a dog a rich tapestry of information. Their nostrils function [2] stereo, enabling them to construct a 3D map of their surroundings. [3] to this is the sheer size of their olfactory bulb, which dwarfs our own. They can detect odors in parts per trillion, [4] akin to finding a single drop of blood in an Olympic pool. [5] a dog lose its sight, it would still navigate the world with ease. Research suggests they can even smell the passage of time, distinguishing [6] the past and the future through the decay of scent particles. [7] we to possess such a faculty, our perception of reality would be unrecognizable. It is truly a sense [8] parallel.",
    "answers": [
      ["WHAT"],
      ["IN"],
      ["ADDED"],
      ["SOMETHING", "MUCH"],
      ["SHOULD"],
      ["BETWEEN"],
      ["WERE"],
      ["WITHOUT"]
    ]
  },
    {
    "id": "C2_NIETZSCHE",
    "level": "C2",
    "title": "Nietzsche Reclaimed",
    "content": "Friedrich Nietzsche's philosophy has long been obscured by misinterpretation. Much of the blame for this [1] at the door of his sister, Elisabeth, who curated his archives with a distinct nationalist agenda. It was she [2] distorted his 'will to power' into a political slogan. [3] it not for recent scholarship, this view might still prevail. Modern readings reveal a thinker concerned [4] with individual liberty than state control. His critique of morality is now seen as a precursor to existentialism. It is high [5] we separated the man from the myth. Few philosophers have had [6] a profound impact on literature and art. He remains a figure of [7] small significance in the history of ideas. Ultimately, his work serves as a warning that ideas are no [8] than the people who interpret them.",
    "answers": [
      ["LIES", "LAID", "SITS", "RESTS"],
      ["WHO", "THAT"],
      ["WERE"],
      ["LESS", "MORE"],
      ["TIME"],
      ["SUCH"],
      ["NO"],
      ["SAFER", "BETTER"]
    ]
  },
  {
    "id": "C2_LINGUISTICS",
    "level": "C2",
    "title": "Words and Worlds",
    "content": "The 'Linguistic Turn' in 20th-century philosophy revolutionized our understanding of reality. The central premise is that philosophical problems are, [1] essence, problems of language. Wittgenstein argued that we are held captive [2] a picture of how language works. We must not look for the meaning of a word, [3] rather its use in a specific context. Concepts we take for granted, like truth or knowledge, have [4] fixed definition outside of the language game in which they are played. It is [5] if language constructs the world, rather than merely reflecting it. [6] closely are words tied to thought that we cannot imagine one without the other. Philosophy, therefore, becomes a form of therapy, clearing [7] misunderstandings. It teaches us that the limits of our language mean the limits of our [8].",
    "answers": [
      ["IN"],
      ["BY"],
      ["BUT"],
      ["NO"],
      ["AS"],
      ["SO"],
      ["UP", "AWAY"],
      ["WORLD"]
    ]
  },
  {
    "id": "C2_DOLLY",
    "level": "C2",
    "title": "Hello, Dolly",
    "content": "The birth of Dolly the sheep in 1996 marked a watershed moment in science. She was the first mammal to be cloned [1] an adult somatic cell, a feat previously thought impossible. The announcement was met [2] a mixture of awe and ethical apprehension. [3] only did it prove that specialized cells could be reprogrammed, but it also raised the specter of human cloning. The press speculated wildly, a reaction [4] immediate condemnation from religious groups. Dolly herself lived a relatively normal life, [5] she did suffer from early onset arthritis. She died at the age of six, which is young [6] a sheep. Her remains are now [7] display in the National Museum of Scotland. Her legacy lives on, having paved the [8] for advances in stem cell research.",
    "answers": [
      ["FROM"],
      ["WITH"],
      ["NOT"],
      ["PROVOKING", "DRAWING", "CAUSING", "SPARKING", "TRIGGERING"],
      ["THOUGH", "ALTHOUGH", "WHILE"],
      ["FOR"],
      ["ON"],
      ["WAY"]
    ]
  },
  {
    "id": "C2_TAYTO_PARK",
    "level": "C2",
    "title": "The Crisp Theme Park",
    "content": "For a theme park named after a humble potato crisp, Tayto Park achieved remarkable success. Located in Ireland, it managed to compete [1] established European attractions against all odds. Its centerpiece, the Cú Chulainn Coaster, is famous [2] being one of the largest wooden rollercoasters in existence. [3] strange as the concept of a crisp-themed park might seem, visitor numbers soared from the outset. It became a rite of passage for Irish families, firmly embedding itself [4] the national culture. [5] should the weather turn bad, as it often does, the park offers extensive indoor facilities. Eventually, the branding deal came to [6] end, and it was renamed Emerald Park. [7] severing ties with the snack manufacturer, it aims to broaden its appeal. Yet, for many, it will always be known [8] its original name.",
    "answers": [
      ["WITH", "AGAINST"],
      ["FOR"],
      ["AS"],
      ["IN", "WITHIN"],
      ["SHOULD", "LEST"],
      ["AN"],
      ["THUS", "THEREBY", "IN"],
      ["BY"]
    ]
  },
  {
    "id": "C2_FILM_ADAPTATION",
    "level": "C2",
    "title": "From Page to Screen",
    "content": "Adapting 19th-century literature for the screen is a task fraught with difficulty. Novels by Dickens or Tolstoy are characterized [1] their sprawling plots and rich internal monologues. Filmmakers often struggle to condense hundreds of pages [2] a two-hour runtime without losing the essence. [3] often than not, subplots are excised and characters merged. The visual language of cinema must replace the descriptive power of prose, [4] easy feat given the density of the source material. Purists often complain that the adaptation plays fast and [5] with the original text. However, a slavish adherence to the book can result [6] a sterile and dull film. The best adaptations are those that capture the spirit, [7] if they deviate from the letter of the plot. It is a delicate balancing act, [8] requiring great artistic sensitivity.",
    "answers": [
      ["BY"],
      ["INTO"],
      ["MORE"],
      ["NO"],
      ["LOOSE"],
      ["IN"],
      ["EVEN"],
      ["ONE"]
    ]
  },
  {
    "id": "C2_QUANTUM_ENTANGLEMENT",
    "level": "C2",
    "title": "The Quantum Paradox",
    "content": "Quantum entanglement represents a fundamental departure from classical physics, positing a scenario [1] particles remain interconnected regardless of distance. When two particles are entangled, the state of one cannot be fully described without [2] to the other. Measurement of one immediately influences its partner, a concept Einstein found [3] preposterous that he famously dismissed it. This 'action at a distance' appears to contradict the principle of locality, [4] to which objects are influenced only by their immediate surroundings. [5] is the strangeness of this phenomenon that it challenges the very fabric of reality. Yet, experimental tests known as Bell tests have consistently validated it, proving that the universe is [6] from being locally real. [7] we to unlock the full potential of this interconnectedness, computing power would increase exponentially. We are standing on the [8] of a new era in information technology.",
    "answers": [
      ["WHEREBY", "WHERE", "IN", "WHEREIN"],
      ["REFERENCE", "RECOURSE"],
      ["SO"],
      ["ACCORDING"],
      ["SUCH"],
      ["FAR"],
      ["WERE"],
      ["BRINK", "VERGE", "EDGE", "CUSP"]
    ]
  }
]